{
  "id": "00aa2aca-3c71-56ad-8b05-df1eed2e8783",
  "catalog": "sigma",
  "name": "proc_creation_win_reg_susp_paths",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1112",
    "attack.t1562.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "oobe",
        "winlogon",
        "wdigest"
      ],
      "raw_values": [
        "*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\*",
        "*\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE*",
        "*\\\\Policies\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon*",
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\Currentversion\\\\Winlogon*",
        "*\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest*",
        "*\\\\Microsoft\\\\Windows Defender\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "reg.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\reg.exe\" or process.pe.original_file_name:\"reg.exe\") and (process.command_line like~ (\"*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\*\", \"*\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE*\", \"*\\\\Policies\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon*\", \"*\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\Currentversion\\\\Winlogon*\", \"*\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest*\", \"*\\\\Microsoft\\\\Windows Defender\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_reg_susp_paths.eql",
  "metadata": {}
}