{
  "id": "00c3e944-159a-533e-8c21-93da852b97e4",
  "catalog": "sigma",
  "name": "proc_access_win_lsass_susp_access_flag",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.grantedaccess",
      "raw_field": "winlog.event_data.GrantedAccess",
      "operator": "like~",
      "values": [
        "0x14c2",
        "0x100000",
        "0x1418",
        "0x1438",
        "0x143a",
        "0x1f0fff",
        "0x1f1fff",
        "0x1f2fff",
        "0x1f3fff",
        "0x40"
      ],
      "raw_values": [
        "*30",
        "*50",
        "*70",
        "*90",
        "*B0",
        "*D0",
        "*F0",
        "*18",
        "*38",
        "*58",
        "*78",
        "*98",
        "*B8",
        "*D8",
        "*F8",
        "*1A",
        "*3A",
        "*5A",
        "*7A",
        "*9A",
        "*BA",
        "*DA",
        "*FA",
        "*0x14C2",
        "0x100000*",
        "0x1418*",
        "0x1438*",
        "0x143a*",
        "0x1f0fff*",
        "0x1f1fff*",
        "0x1f2fff*",
        "0x1f3fff*",
        "0x40*"
      ]
    },
    {
      "field": "winlog.event_data.calltrace",
      "raw_field": "winlog.event_data.CallTrace",
      "operator": "like~",
      "values": [
        "|c:\\\\program files\\\\windows defender\\\\mprtp.dll",
        "|c:\\\\program files\\\\windows defender\\\\mpclient.dll"
      ],
      "raw_values": [
        "*|c:\\\\program files\\\\windows defender\\\\mprtp.dll*",
        "*|c:\\\\program files\\\\windows defender\\\\MpClient.dll*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "procexp64.exe",
        "procexp.exe",
        "aurora-agent-64.exe",
        "aurora-agent.exe",
        "thor.exe",
        "thor64.exe",
        "handle.exe",
        "handle64.exe"
      ],
      "raw_values": [
        "*\\\\PROCEXP64.EXE",
        "*\\\\PROCEXP.EXE",
        "*\\\\aurora-agent-64.exe",
        "*\\\\aurora-agent.exe",
        "*\\\\thor.exe",
        "*\\\\thor64.exe",
        "*\\\\handle.exe",
        "*\\\\handle64.exe"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": ":",
      "values": [
        "\\\\lsass.exe"
      ],
      "raw_values": [
        "*\\\\lsass.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msmpeng.exe",
        "explorer.exe",
        "mbupdatr.exe",
        "code.exe",
        "vmtoolsd.exe",
        "mbaminstallerservice.exe",
        "webexhost.exe"
      ],
      "raw_values": [
        "*:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*",
        "*\\\\MsMpEng.exe",
        "*\\\\explorer.exe",
        "*:\\\\ProgramData\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe",
        "*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe",
        "*:\\\\ProgramData\\\\VMware\\\\VMware Tools\\\\*",
        "*\\\\vmtoolsd.exe",
        "*\\\\MBAMInstallerService.exe",
        "*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe",
        "*\\\\SteamLibrary\\\\steamapps\\\\*"
      ]
    },
    {
      "field": "winlog.event_data.calltrace",
      "raw_field": "winlog.event_data.CallTrace",
      "operator": ":",
      "values": [
        "|?:\\\\programdata\\\\microsoft\\\\windows defender\\\\definition updates\\\\{",
        "}\\\\mpengine.dll+"
      ],
      "raw_values": [
        "*|?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Definition Updates\\\\{*",
        "*}\\\\mpengine.dll+*"
      ]
    },
    {
      "field": "winlog.event_data.grantedaccess",
      "raw_field": "winlog.event_data.GrantedAccess",
      "operator": ":",
      "values": [
        "0x1418",
        "0x401",
        "0x40"
      ],
      "raw_values": [
        "0x1418",
        "0x401",
        "0x40"
      ]
    }
  ],
  "raw_query": "any where (winlog.event_data.TargetImage:\"*\\\\lsass.exe\" and ((winlog.event_data.GrantedAccess like~ (\"*30\", \"*50\", \"*70\", \"*90\", \"*B0\", \"*D0\", \"*F0\", \"*18\", \"*38\", \"*58\", \"*78\", \"*98\", \"*B8\", \"*D8\", \"*F8\", \"*1A\", \"*3A\", \"*5A\", \"*7A\", \"*9A\", \"*BA\", \"*DA\", \"*FA\", \"*0x14C2\")) or (winlog.event_data.GrantedAccess like~ (\"0x100000*\", \"0x1418*\", \"0x1438*\", \"0x143a*\", \"0x1f0fff*\", \"0x1f1fff*\", \"0x1f2fff*\", \"0x1f3fff*\", \"0x40*\")))) and (not ((process.executable like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\")) or (process.executable:\"*:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*\" and process.executable:\"*\\\\MsMpEng.exe\") or ((winlog.event_data.CallTrace:\"*|?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Definition Updates\\\\{*\" and winlog.event_data.CallTrace:\"*}\\\\mpengine.dll+*\") and winlog.event_data.GrantedAccess:\"0x1418\") or (winlog.event_data.CallTrace like~ (\"*|c:\\\\program files\\\\windows defender\\\\mprtp.dll*\", \"*|c:\\\\program files\\\\windows defender\\\\MpClient.dll*\")) or (process.executable:\"*\\\\explorer.exe\" and winlog.event_data.GrantedAccess:\"0x401\"))) and (not (process.executable:\"*:\\\\ProgramData\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe\" or process.executable:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\" or (process.executable:\"*:\\\\ProgramData\\\\VMware\\\\VMware Tools\\\\*\" and process.executable:\"*\\\\vmtoolsd.exe\") or ((process.executable like~ (\"*\\\\PROCEXP64.EXE\", \"*\\\\PROCEXP.EXE\")) and winlog.event_data.GrantedAccess:\"0x40\") or (process.executable:\"*\\\\MBAMInstallerService.exe\" and winlog.event_data.GrantedAccess:\"0x40\") or ((process.executable like~ (\"*\\\\aurora-agent-64.exe\", \"*\\\\aurora-agent.exe\", \"*\\\\thor.exe\", \"*\\\\thor64.exe\")) and winlog.event_data.GrantedAccess:\"0x40\") or ((process.executable like~ (\"*\\\\handle.exe\", \"*\\\\handle64.exe\")) and winlog.event_data.GrantedAccess:\"0x40\") or (process.executable:\"*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe\" and winlog.event_data.GrantedAccess:\"0x401\") or process.executable:\"*\\\\SteamLibrary\\\\steamapps\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_access/proc_access_win_lsass_susp_access_flag.eql",
  "metadata": {}
}