{
  "id": "00c54b8e-5cb7-5124-b586-746090bf8581",
  "catalog": "sigma",
  "name": "win_security_user_added_to_local_administrators",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4732"
      ],
      "raw_values": [
        "4732"
      ]
    },
    {
      "field": "winlog.event_data.targetusername",
      "raw_field": "winlog.event_data.TargetUserName",
      "operator": ":",
      "values": [
        "administr"
      ],
      "raw_values": [
        "Administr*"
      ]
    },
    {
      "field": "winlog.event_data.targetsid",
      "raw_field": "winlog.event_data.TargetSid",
      "operator": ":",
      "values": [
        "s-1-5-32-544"
      ],
      "raw_values": [
        "S-1-5-32-544"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and ((event.code:\"4732\" and (winlog.event_data.TargetUserName:\"Administr*\" or winlog.event_data.TargetSid:\"S-1-5-32-544\")) and (not user.name:\"*$\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_user_added_to_local_administrators.eql",
  "metadata": {}
}