{
  "id": "02dca9e3-0842-5dcf-84a8-ef2b8be4b212",
  "catalog": "sigma",
  "name": "win_security_invoke_obfuscation_via_rundll_services_security",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1027",
    "attack.t1059.001"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4697"
      ],
      "raw_values": [
        "4697"
      ]
    },
    {
      "field": "winlog.event_data.servicefilename",
      "raw_field": "winlog.event_data.ServiceFileName",
      "operator": ":",
      "values": [
        "rundll32.exe",
        "shell32.dll",
        "shellexec_rundll",
        "powershell"
      ],
      "raw_values": [
        "*rundll32.exe*",
        "*shell32.dll*",
        "*shellexec_rundll*",
        "*powershell*"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4697\" and (winlog.event_data.ServiceFileName:\"*rundll32.exe*\" and winlog.event_data.ServiceFileName:\"*shell32.dll*\" and winlog.event_data.ServiceFileName:\"*shellexec_rundll*\" and winlog.event_data.ServiceFileName:\"*powershell*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_invoke_obfuscation_via_rundll_services_security.eql",
  "metadata": {}
}