{
  "id": "0300ae10-387a-5c30-93d4-5c365495c6d5",
  "catalog": "sigma",
  "name": "proc_creation_win_powershell_crypto_namespace",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.dll"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".aescryptoserviceprovider",
        ".descryptoserviceprovider",
        ".dsacryptoserviceprovider",
        ".rc2cryptoserviceprovider",
        ".rijndael",
        ".rsacryptoserviceprovider",
        ".tripledescryptoserviceprovider"
      ],
      "raw_values": [
        "*.AesCryptoServiceProvider*",
        "*.DESCryptoServiceProvider*",
        "*.DSACryptoServiceProvider*",
        "*.RC2CryptoServiceProvider*",
        "*.Rijndael*",
        "*.RSACryptoServiceProvider*",
        "*.TripleDESCryptoServiceProvider*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "system.security.cryptography."
      ],
      "raw_values": [
        "*System.Security.Cryptography.*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) or (process.pe.original_file_name like~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and process.command_line:\"*System.Security.Cryptography.*\" and (process.command_line like~ (\"*.AesCryptoServiceProvider*\", \"*.DESCryptoServiceProvider*\", \"*.DSACryptoServiceProvider*\", \"*.RC2CryptoServiceProvider*\", \"*.Rijndael*\", \"*.RSACryptoServiceProvider*\", \"*.TripleDESCryptoServiceProvider*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_powershell_crypto_namespace.eql",
  "metadata": {}
}