{
  "id": "044c8ef8-885b-53d9-aaf0-e05e0d0960be",
  "catalog": "sigma",
  "name": "proc_creation_win_cmd_net_use_and_exec_combo",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".exe",
        ".dll",
        ".bat",
        ".vbs",
        ".ps1"
      ],
      "raw_values": [
        "*.exe *",
        "*.dll *",
        "*.bat *",
        "*.vbs *",
        "*.ps1 *"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe*"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "Cmd.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "net use http"
      ],
      "raw_values": [
        "* net use http*",
        "*& start /b *",
        "*\\\\DavWWWRoot\\\\*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\cmd.exe*\" or process.pe.original_file_name:\"Cmd.EXE\") and (process.command_line:\"* net use http*\" and process.command_line:\"*& start /b *\" and process.command_line:\"*\\\\DavWWWRoot\\\\*\") and (process.command_line like~ (\"*.exe *\", \"*.dll *\", \"*.bat *\", \"*.vbs *\", \"*.ps1 *\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_cmd_net_use_and_exec_combo.eql",
  "metadata": {}
}