{
  "id": "0512d840-811d-57c8-9933-a9fdbca968ba",
  "catalog": "sigma",
  "name": "win_codeintegrity_revoked_image_loaded",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "like~",
      "values": [
        "3032",
        "3035"
      ],
      "raw_values": [
        "3032",
        "3035"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-codeintegrity/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-CodeIntegrity/Operational"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-CodeIntegrity/Operational\" and (event.code like~ (\"3032\", \"3035\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/code_integrity/win_codeintegrity_revoked_image_loaded.eql",
  "metadata": {}
}