{
  "id": "0543ed85-e30c-5bd7-87bc-c97f92bd1ee3",
  "catalog": "sigma",
  "name": "proc_creation_win_findstr_sysmon_discovery_via_default_altitude",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "find.exe",
        "findstr.exe"
      ],
      "raw_values": [
        "*\\\\find.exe",
        "*\\\\findstr.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "find.exe",
        "findstr.exe"
      ],
      "raw_values": [
        "FIND.EXE",
        "FINDSTR.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "385201"
      ],
      "raw_values": [
        "* 385201*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\find.exe\", \"*\\\\findstr.exe\")) or (process.pe.original_file_name like~ (\"FIND.EXE\", \"FINDSTR.EXE\"))) and process.command_line:\"* 385201*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_findstr_sysmon_discovery_via_default_altitude.eql",
  "metadata": {}
}