{
  "id": "06038c57-3ca4-5505-8cda-d34778da64d8",
  "catalog": "sigma",
  "name": "win_system_hack_smbexec",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": "like~",
      "values": [
        ".bat & del",
        "__output 2^>^&1 >"
      ],
      "raw_values": [
        "*.bat & del *",
        "*__output 2^>^&1 >*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    },
    {
      "field": "winlog.event_data.servicename",
      "raw_field": "winlog.event_data.ServiceName",
      "operator": ":",
      "values": [
        "btobto"
      ],
      "raw_values": [
        "BTOBTO"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and ((winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\") and (winlog.event_data.ServiceName:\"BTOBTO\" or (winlog.event_data.ImagePath like~ (\"*.bat & del *\", \"*__output 2^>^&1 >*\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/system/service_control_manager/win_system_hack_smbexec.eql",
  "metadata": {}
}