{
  "id": "0758c722-6524-537b-be4f-fd0ca9e91cab",
  "catalog": "sigma",
  "name": "proc_creation_win_regsvr32_network_pattern",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.010"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "ftp",
        "http"
      ],
      "raw_values": [
        "* /i*",
        "* -i*",
        "*ftp*",
        "*http*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "regsvr32.exe"
      ],
      "raw_values": [
        "*\\\\regsvr32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "regsvr32.exe"
      ],
      "raw_values": [
        "REGSVR32.EXE"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\regsvr32.exe\" or process.pe.original_file_name:\"REGSVR32.EXE\") and (process.command_line like~ (\"* /i*\", \"* -i*\")) and (process.command_line like~ (\"*ftp*\", \"*http*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_regsvr32_network_pattern.eql",
  "metadata": {}
}