{
  "id": "07cf2244-3cb5-5f35-9aa0-b4351a242567",
  "catalog": "sigma",
  "name": "proc_creation_win_net_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1007",
    "attack.t1049",
    "attack.t1018",
    "attack.t1135",
    "attack.t1201",
    "attack.t1069.001",
    "attack.t1069.002",
    "attack.t1087.001",
    "attack.t1087.002",
    "attack.t1021.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "*\\\\net.exe",
        "*\\\\net1.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "net.exe",
        "net1.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "accounts",
        "group",
        "localgroup",
        "share",
        "start",
        "stop",
        "user",
        "view"
      ],
      "raw_values": [
        "* accounts*",
        "* group*",
        "* localgroup*",
        "* share*",
        "* start*",
        "* stop *",
        "* user*",
        "* view*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\net.exe\", \"*\\\\net1.exe\")) or (process.pe.original_file_name like~ (\"net.exe\", \"net1.exe\"))) and (process.command_line like~ (\"* accounts*\", \"* group*\", \"* localgroup*\", \"* share*\", \"* start*\", \"* stop *\", \"* user*\", \"* view*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_net_execution.eql",
  "metadata": {}
}