{
  "id": "0895df8b-293a-55a5-99f7-d8553bd0bc9e",
  "catalog": "sigma",
  "name": "proc_creation_win_vmware_toolbox_cmd_persistence_susp",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "temp"
      ],
      "raw_values": [
        "*:\\\\PerfLogs\\\\*",
        "*:\\\\Temp\\\\*",
        "*:\\\\Windows\\\\System32\\\\Tasks\\\\*",
        "*:\\\\Windows\\\\Tasks\\\\*",
        "*:\\\\Windows\\\\Temp\\\\*",
        "*\\\\AppData\\\\Local\\\\Temp*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vmwaretoolboxcmd.exe"
      ],
      "raw_values": [
        "*\\\\VMwareToolBoxCmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "toolbox-cmd.exe"
      ],
      "raw_values": [
        "toolbox-cmd.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "script",
        "set"
      ],
      "raw_values": [
        "* script *",
        "* set *"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\VMwareToolBoxCmd.exe\" or process.pe.original_file_name:\"toolbox-cmd.exe\") and (process.command_line:\"* script *\" and process.command_line:\"* set *\") and (process.command_line like~ (\"*:\\\\PerfLogs\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Windows\\\\System32\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_vmware_toolbox_cmd_persistence_susp.eql",
  "metadata": {}
}