{
  "id": "0b6d128e-83e1-54b6-81ac-78a9b67f3fac",
  "catalog": "sigma",
  "name": "proc_creation_win_certutil_encode_susp_location",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-encode",
        "encode",
        "–encode",
        "—encode",
        "―encode",
        "$recycle.bin"
      ],
      "raw_values": [
        "*-encode*",
        "*/encode*",
        "*–encode*",
        "*—encode*",
        "*―encode*",
        "*\\\\AppData\\\\Roaming\\\\*",
        "*\\\\Desktop\\\\*",
        "*\\\\Local\\\\Temp\\\\*",
        "*\\\\PerfLogs\\\\*",
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\Windows\\\\Temp\\\\*",
        "*$Recycle.Bin*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "*\\\\certutil.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "CertUtil.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\certutil.exe\" or process.pe.original_file_name:\"CertUtil.exe\") and process.command_line like~ (\"*-encode*\", \"*/encode*\", \"*–encode*\", \"*—encode*\", \"*―encode*\") and (process.command_line like~ (\"*\\\\AppData\\\\Roaming\\\\*\", \"*\\\\Desktop\\\\*\", \"*\\\\Local\\\\Temp\\\\*\", \"*\\\\PerfLogs\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\Windows\\\\Temp\\\\*\", \"*$Recycle.Bin*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_certutil_encode_susp_location.eql",
  "metadata": {}
}