{
  "id": "0ccc9b59-d095-57f8-ab74-e3360f9f1418",
  "catalog": "sigma",
  "name": "proc_creation_win_gpg4win_susp_location",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "gpg.exe",
        "gpg2.exe"
      ],
      "raw_values": [
        "*\\\\gpg.exe",
        "*\\\\gpg2.exe"
      ]
    },
    {
      "field": "process.pe.product",
      "raw_field": "process.pe.product",
      "operator": ":",
      "values": [
        "gnu privacy guard (gnupg)"
      ],
      "raw_values": [
        "GNU Privacy Guard (GnuPG)"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "gnupg’s openpgp tool"
      ],
      "raw_values": [
        "GnuPG’s OpenPGP tool"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "-passphrase"
      ],
      "raw_values": [
        "*-passphrase*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\gpg.exe\", \"*\\\\gpg2.exe\")) or process.pe.product:\"GNU Privacy Guard (GnuPG)\" or process.pe.description:\"GnuPG’s OpenPGP tool\") and process.command_line:\"*-passphrase*\" and (process.command_line like~ (\"*:\\\\PerfLogs\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\AppData\\\\Roaming\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_gpg4win_susp_location.eql",
  "metadata": {}
}