{
  "id": "1103650c-372f-507c-ab52-cb5f72e0c7fb",
  "catalog": "sigma",
  "name": "Lateral Movement via PsExec",
  "description": "Detects lateral movement using PsExec remote execution",
  "severity": "high",
  "mitre_techniques": [
    "attack.t1570",
    "attack.t1021.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "Image",
      "operator": "in",
      "values": [
        "psexec.exe",
        "psexesvc.exe"
      ],
      "raw_values": [
        "psexec.exe",
        "psexesvc.exe"
      ]
    }
  ],
  "raw_query": "process where process.name in (\"psexec.exe\",\"psexesvc.exe\")",
  "language": "sigma",
  "translated_query": "process where process.name in (\"psexec.exe\",\"psexesvc.exe\")",
  "source_path": "demo",
  "metadata": {}
}