{
  "id": "11f3ab0f-c94e-5a5d-a618-79713a4bfa22",
  "catalog": "sigma",
  "name": "dns_query_win_susp_external_ip_lookup",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1590"
  ],
  "event_categories": [
    "dns"
  ],
  "conditions": [
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": "like~",
      "values": [
        "www.ip.cn",
        "l2.io",
        "api.2ip.ua",
        "api.bigdatacloud.net",
        "api.ipify.org",
        "bot.whatismyipaddress.com",
        "canireachthe.net",
        "checkip.amazonaws.com",
        "checkip.dyndns.org",
        "curlmyip.com",
        "db-ip.com",
        "edns.ip-api.com",
        "eth0.me",
        "freegeoip.app",
        "geoipy.com",
        "getip.pro",
        "icanhazip.com",
        "ident.me",
        "ifconfig.io",
        "ifconfig.me",
        "ip-api.com",
        "ip.360.cn",
        "ip.anysrc.net",
        "ip.taobao.com",
        "ip.tyk.nu",
        "ipaddressworld.com",
        "ipapi.co",
        "ipconfig.io",
        "ipecho.net",
        "ipinfo.io",
        "ipip.net",
        "ipof.in",
        "ipv4.icanhazip.com",
        "ipv4bot.whatismyipaddress.com",
        "ipv6-test.com",
        "ipwho.is",
        "jsonip.com",
        "myexternalip.com",
        "seeip.org",
        "wgetip.com",
        "whatismyip.akamai.com",
        "whois.pconline.com.cn",
        "wtfismyip.com"
      ],
      "raw_values": [
        "www.ip.cn",
        "l2.io",
        "*api.2ip.ua*",
        "*api.bigdatacloud.net*",
        "*api.ipify.org*",
        "*bot.whatismyipaddress.com*",
        "*canireachthe.net*",
        "*checkip.amazonaws.com*",
        "*checkip.dyndns.org*",
        "*curlmyip.com*",
        "*db-ip.com*",
        "*edns.ip-api.com*",
        "*eth0.me*",
        "*freegeoip.app*",
        "*geoipy.com*",
        "*getip.pro*",
        "*icanhazip.com*",
        "*ident.me*",
        "*ifconfig.io*",
        "*ifconfig.me*",
        "*ip-api.com*",
        "*ip.360.cn*",
        "*ip.anysrc.net*",
        "*ip.taobao.com*",
        "*ip.tyk.nu*",
        "*ipaddressworld.com*",
        "*ipapi.co*",
        "*ipconfig.io*",
        "*ipecho.net*",
        "*ipinfo.io*",
        "*ipip.net*",
        "*ipof.in*",
        "*ipv4.icanhazip.com*",
        "*ipv4bot.whatismyipaddress.com*",
        "*ipv6-test.com*",
        "*ipwho.is*",
        "*jsonip.com*",
        "*myexternalip.com*",
        "*seeip.org*",
        "*wgetip.com*",
        "*whatismyip.akamai.com*",
        "*whois.pconline.com.cn*",
        "*wtfismyip.com*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "chrome.exe",
        "firefox.exe",
        "msedge.exe",
        "msedgewebview2.exe"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe",
        "C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe",
        "*\\\\msedge.exe",
        "*\\\\msedgewebview2.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "brave.exe",
        "maxthon.exe",
        "microsoftedge.exe",
        "opera.exe",
        "safari.exe",
        "seamonkey.exe",
        "vivaldi.exe",
        "whale.exe"
      ],
      "raw_values": [
        "*\\\\brave.exe",
        "*\\\\maxthon.exe",
        "C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*",
        "*\\\\WindowsApps\\\\MicrosoftEdge.exe",
        "*\\\\opera.exe",
        "*\\\\safari.exe",
        "*\\\\seamonkey.exe",
        "*\\\\vivaldi.exe",
        "*\\\\whale.exe"
      ]
    }
  ],
  "raw_query": "any where ((dns.question.name like~ (\"www.ip.cn\", \"l2.io\")) or (dns.question.name like~ (\"*api.2ip.ua*\", \"*api.bigdatacloud.net*\", \"*api.ipify.org*\", \"*bot.whatismyipaddress.com*\", \"*canireachthe.net*\", \"*checkip.amazonaws.com*\", \"*checkip.dyndns.org*\", \"*curlmyip.com*\", \"*db-ip.com*\", \"*edns.ip-api.com*\", \"*eth0.me*\", \"*freegeoip.app*\", \"*geoipy.com*\", \"*getip.pro*\", \"*icanhazip.com*\", \"*ident.me*\", \"*ifconfig.io*\", \"*ifconfig.me*\", \"*ip-api.com*\", \"*ip.360.cn*\", \"*ip.anysrc.net*\", \"*ip.taobao.com*\", \"*ip.tyk.nu*\", \"*ipaddressworld.com*\", \"*ipapi.co*\", \"*ipconfig.io*\", \"*ipecho.net*\", \"*ipinfo.io*\", \"*ipip.net*\", \"*ipof.in*\", \"*ipv4.icanhazip.com*\", \"*ipv4bot.whatismyipaddress.com*\", \"*ipv6-test.com*\", \"*ipwho.is*\", \"*jsonip.com*\", \"*myexternalip.com*\", \"*seeip.org*\", \"*wgetip.com*\", \"*whatismyip.akamai.com*\", \"*whois.pconline.com.cn*\", \"*wtfismyip.com*\"))) and (not (process.executable:\"*\\\\brave.exe\" or (process.executable like~ (\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (process.executable like~ (\"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\")) or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\", \"C:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\")) or process.executable:\"*\\\\maxthon.exe\" or (process.executable:\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\" or process.executable:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\" or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\", \"C:\\\\Program Files\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\"))) or ((process.executable like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeCore\\\\*\", \"C:\\\\Program Files\\\\Microsoft\\\\EdgeCore\\\\*\")) and (process.executable like~ (\"*\\\\msedge.exe\", \"*\\\\msedgewebview2.exe\"))) or process.executable:\"*\\\\opera.exe\" or process.executable:\"*\\\\safari.exe\" or process.executable:\"*\\\\seamonkey.exe\" or process.executable:\"*\\\\vivaldi.exe\" or process.executable:\"*\\\\whale.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/dns_query/dns_query_win_susp_external_ip_lookup.eql",
  "metadata": {}
}