{
  "id": "1331faf7-718d-51e2-aa89-bf0af8aa5bda",
  "catalog": "sigma",
  "name": "create_remote_thread_win_susp_target_shell_application",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1055"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": "like~",
      "values": [
        "\\\\cmd.exe",
        "\\\\powershell.exe",
        "\\\\pwsh.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msmpeng.exe"
      ],
      "raw_values": [
        "*\\\\MsMpEng.exe"
      ]
    }
  ],
  "raw_query": "any where (winlog.event_data.TargetImage like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and (not (process.executable like~ (\"C:\\\\Windows\\\\System32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\", \"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\"))) and (not process.executable:\"*\\\\MsMpEng.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/create_remote_thread/create_remote_thread_win_susp_target_shell_application.eql",
  "metadata": {}
}