{
  "id": "134af9d4-15ec-5039-a3e7-b8911fe82107",
  "catalog": "sigma",
  "name": "proc_creation_win_mshta_lethalhta_technique",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.005"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "*\\\\svchost.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "*\\\\mshta.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\svchost.exe\" and process.executable:\"*\\\\mshta.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_mshta_lethalhta_technique.eql",
  "metadata": {}
}