{
  "id": "13a40f4a-e329-5601-95c1-5f83f6f26489",
  "catalog": "sigma",
  "name": "proc_creation_win_bginfo_suspicious_child_process",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "bginfo.exe",
        "bginfo64.exe"
      ],
      "raw_values": [
        "*\\\\bginfo.exe",
        "*\\\\bginfo64.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "calc.exe",
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "notepad.exe",
        "powershell.exe",
        "pwsh.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\calc.exe",
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\notepad.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\wscript.exe",
        "*\\\\AppData\\\\Local\\\\*",
        "*\\\\AppData\\\\Roaming\\\\*",
        "*:\\\\Users\\\\Public\\\\*",
        "*:\\\\Temp\\\\*",
        "*:\\\\Windows\\\\Temp\\\\*",
        "*:\\\\PerfLogs\\\\*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable like~ (\"*\\\\bginfo.exe\", \"*\\\\bginfo64.exe\")) and ((process.executable like~ (\"*\\\\calc.exe\", \"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\notepad.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\wscript.exe\")) or (process.executable like~ (\"*\\\\AppData\\\\Local\\\\*\", \"*\\\\AppData\\\\Roaming\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*:\\\\PerfLogs\\\\*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_bginfo_suspicious_child_process.eql",
  "metadata": {}
}