{
  "id": "14866b3a-5332-5dfb-aba3-6a1858a4e169",
  "catalog": "sigma",
  "name": "proc_creation_win_powershell_cmdline_special_characters",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1027",
    "attack.t1059.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.dll"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "ssm-document-worker.exe"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Amazon\\\\SSM\\\\ssm-document-worker.exe"
      ]
    }
  ],
  "raw_query": "any where (((process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) or (process.pe.original_file_name like~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (process.command_line like~ (\"SigmaRegularExpression(regexp=SigmaString(['\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\+']), flags=set())\", \"SigmaRegularExpression(regexp=SigmaString(['\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\{']), flags=set())\", \"SigmaRegularExpression(regexp=SigmaString(['\\\\^.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\^.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\^.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\^.', <SpecialChars.WILDCARD_MULTI: 1>, '\\\\^']), flags=set())\", \"SigmaRegularExpression(regexp=SigmaString(['`.', <SpecialChars.WILDCARD_MULTI: 1>, '`.', <SpecialChars.WILDCARD_MULTI: 1>, '`.', <SpecialChars.WILDCARD_MULTI: 1>, '`.', <SpecialChars.WILDCARD_MULTI: 1>, '`']), flags=set())\"))) and (not (process.parent.executable:\"C:\\\\Program Files\\\\Amazon\\\\SSM\\\\ssm-document-worker.exe\" or (process.command_line like~ (\"*new EventSource(\\\"Microsoft.Windows.Sense.Client.Management\\\"*\", \"*public static extern bool InstallELAMCertificateInfo(SafeFileHandle handle);*\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_powershell_cmdline_special_characters.eql",
  "metadata": {}
}