{
  "id": "15e85e17-062d-505b-af77-84b91cf28ca1",
  "catalog": "sigma",
  "name": "proc_creation_win_odbcconf_exec_susp_locations",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.008"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "crmlog"
      ],
      "raw_values": [
        "*:\\\\PerfLogs\\\\*",
        "*:\\\\ProgramData\\\\*",
        "*:\\\\Temp\\\\*",
        "*:\\\\Users\\\\Public\\\\*",
        "*:\\\\Windows\\\\Registration\\\\CRMLog*",
        "*:\\\\Windows\\\\System32\\\\com\\\\dmp\\\\*",
        "*:\\\\Windows\\\\System32\\\\FxsTmp\\\\*",
        "*:\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\*",
        "*:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\*",
        "*:\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\*",
        "*:\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\*",
        "*:\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\*",
        "*:\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*",
        "*:\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\*",
        "*:\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\*",
        "*:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\*",
        "*:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*",
        "*:\\\\Windows\\\\Tasks\\\\*",
        "*:\\\\Windows\\\\Temp\\\\*",
        "*:\\\\Windows\\\\Tracing\\\\*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*\\\\AppData\\\\Roaming\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "odbcconf.exe"
      ],
      "raw_values": [
        "*\\\\odbcconf.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "odbcconf.exe"
      ],
      "raw_values": [
        "odbcconf.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\odbcconf.exe\" or process.pe.original_file_name:\"odbcconf.exe\") and (process.command_line like~ (\"*:\\\\PerfLogs\\\\*\", \"*:\\\\ProgramData\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\Registration\\\\CRMLog*\", \"*:\\\\Windows\\\\System32\\\\com\\\\dmp\\\\*\", \"*:\\\\Windows\\\\System32\\\\FxsTmp\\\\*\", \"*:\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\*\", \"*:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\*\", \"*:\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\*\", \"*:\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\*\", \"*:\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\*\", \"*:\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*\", \"*:\\\\Windows\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*:\\\\Windows\\\\Tracing\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\AppData\\\\Roaming\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_odbcconf_exec_susp_locations.eql",
  "metadata": {}
}