{
  "id": "17cd98a5-8831-5b5e-989e-d73134a83830",
  "catalog": "sigma",
  "name": "proc_creation_win_findstr_download",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "findstr"
      ],
      "raw_values": [
        "*findstr*",
        "*\\\\\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "findstr.exe"
      ],
      "raw_values": [
        "*findstr.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "findstr.exe"
      ],
      "raw_values": [
        "FINDSTR.EXE"
      ]
    }
  ],
  "raw_query": "any where (process.command_line:\"*findstr*\" or process.executable:\"*findstr.exe\" or process.pe.original_file_name:\"FINDSTR.EXE\") and (process.command_line like~ (\"* -v *\", \"* /v *\", \"* –v *\", \"* —v *\", \"* ―v *\") and process.command_line like~ (\"* -l *\", \"* /l *\", \"* –l *\", \"* —l *\", \"* ―l *\") and process.command_line:\"*\\\\\\\\*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_findstr_download.eql",
  "metadata": {}
}