{
  "id": "19dbfac2-7ece-5ca0-ac39-f7ca72f0faa6",
  "catalog": "sigma",
  "name": "proc_creation_win_lolbin_pcwutl",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "RUNDLL32.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "pcwutl",
        "launchapplication"
      ],
      "raw_values": [
        "*pcwutl*",
        "*LaunchApplication*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\rundll32.exe\" or process.pe.original_file_name:\"RUNDLL32.EXE\") and (process.command_line:\"*pcwutl*\" and process.command_line:\"*LaunchApplication*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_lolbin_pcwutl.eql",
  "metadata": {}
}