{
  "id": "1a33f882-54d8-5037-ac17-c3eac81ab423",
  "catalog": "sigma",
  "name": "proc_creation_win_mstsc_run_local_rdp_file_susp_location",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1219.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".rdp",
        "color",
        "tasks_migrated"
      ],
      "raw_values": [
        "*.rdp",
        "*.rdp\\",
        "*:\\\\Users\\\\Public\\\\*",
        "*:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color*",
        "*:\\\\Windows\\\\System32\\\\Tasks_Migrated *",
        "*:\\\\Windows\\\\Tasks\\\\*",
        "*:\\\\Windows\\\\Temp\\\\*",
        "*:\\\\Windows\\\\Tracing\\\\*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*\\\\Downloads\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mstsc.exe"
      ],
      "raw_values": [
        "*\\\\mstsc.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "mstsc.exe"
      ],
      "raw_values": [
        "mstsc.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\mstsc.exe\" or process.pe.original_file_name:\"mstsc.exe\") and (process.command_line like~ (\"*.rdp\", \"*.rdp\\\"\")) and (process.command_line like~ (\"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color*\", \"*:\\\\Windows\\\\System32\\\\Tasks_Migrated *\", \"*:\\\\Windows\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*:\\\\Windows\\\\Tracing\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\Downloads\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_mstsc_run_local_rdp_file_susp_location.eql",
  "metadata": {}
}