{
  "id": "1bd7ba26-0c4f-5b81-87f6-2f7d17e18625",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_maze_ransomware",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "winword.exe"
      ],
      "raw_values": [
        "*\\\\WINWORD.exe",
        "*\\\\Temp\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        ".tmp",
        "wmic.exe"
      ],
      "raw_values": [
        "*.tmp",
        "*\\\\wmic.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "shadowcopy delete",
        "system32"
      ],
      "raw_values": [
        "*shadowcopy delete",
        "*\\\\..\\\\..\\\\system32*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable:\"*\\\\WINWORD.exe\" and process.executable:\"*.tmp\") or (process.executable:\"*\\\\wmic.exe\" and process.parent.executable:\"*\\\\Temp\\\\*\" and process.command_line:\"*shadowcopy delete\") or (process.command_line:\"*shadowcopy delete\" and process.command_line:\"*\\\\..\\\\..\\\\system32*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2020/Malware/Maze/proc_creation_win_malware_maze_ransomware.eql",
  "metadata": {}
}