{
  "id": "1c292952-bde8-5d28-9e26-7ac8163be157",
  "catalog": "sigma",
  "name": "image_load_malware_pingback_backdoor",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msdtc.exe"
      ],
      "raw_values": [
        "*\\\\msdtc.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "oci.dll"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\oci.dll"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\msdtc.exe\" and file.path:\"C:\\\\Windows\\\\oci.dll\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2021/Malware/Pingback/image_load_malware_pingback_backdoor.eql",
  "metadata": {}
}