{
  "id": "1d330249-5d40-5a8f-b678-31daaab6a86f",
  "catalog": "sigma",
  "name": "proc_creation_win_bitsadmin_download_susp_extensions",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1197",
    "attack.t1036.003",
    "attack.t1105"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "transfer",
        "create",
        "addfile",
        ".7z",
        ".asax",
        ".ashx",
        ".asmx",
        ".asp",
        ".aspx",
        ".bat",
        ".cfm",
        ".cgi",
        ".chm",
        ".cmd",
        ".dll",
        ".gif",
        ".jpeg",
        ".jpg",
        ".jsp",
        ".jspx",
        ".log",
        ".png",
        ".ps1",
        ".psm1",
        ".rar",
        ".scf",
        ".sct",
        ".txt",
        ".vbe",
        ".vbs",
        ".war",
        ".wsf",
        ".wsh",
        ".xll",
        ".zip"
      ],
      "raw_values": [
        "* /transfer *",
        "* /create *",
        "* /addfile *",
        "*.7z*",
        "*.asax*",
        "*.ashx*",
        "*.asmx*",
        "*.asp*",
        "*.aspx*",
        "*.bat*",
        "*.cfm*",
        "*.cgi*",
        "*.chm*",
        "*.cmd*",
        "*.dll*",
        "*.gif*",
        "*.jpeg*",
        "*.jpg*",
        "*.jsp*",
        "*.jspx*",
        "*.log*",
        "*.png*",
        "*.ps1*",
        "*.psm1*",
        "*.rar*",
        "*.scf*",
        "*.sct*",
        "*.txt*",
        "*.vbe*",
        "*.vbs*",
        "*.war*",
        "*.wsf*",
        "*.wsh*",
        "*.xll*",
        "*.zip*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "bitsadmin.exe"
      ],
      "raw_values": [
        "*\\\\bitsadmin.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "bitsadmin.exe"
      ],
      "raw_values": [
        "bitsadmin.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\bitsadmin.exe\" or process.pe.original_file_name:\"bitsadmin.exe\") and (process.command_line like~ (\"* /transfer *\", \"* /create *\", \"* /addfile *\")) and (process.command_line like~ (\"*.7z*\", \"*.asax*\", \"*.ashx*\", \"*.asmx*\", \"*.asp*\", \"*.aspx*\", \"*.bat*\", \"*.cfm*\", \"*.cgi*\", \"*.chm*\", \"*.cmd*\", \"*.dll*\", \"*.gif*\", \"*.jpeg*\", \"*.jpg*\", \"*.jsp*\", \"*.jspx*\", \"*.log*\", \"*.png*\", \"*.ps1*\", \"*.psm1*\", \"*.rar*\", \"*.scf*\", \"*.sct*\", \"*.txt*\", \"*.vbe*\", \"*.vbs*\", \"*.war*\", \"*.wsf*\", \"*.wsh*\", \"*.xll*\", \"*.zip*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_bitsadmin_download_susp_extensions.eql",
  "metadata": {}
}