{
  "id": "1d48ea01-b638-56f3-b44e-227b5fe0ed67",
  "catalog": "sigma",
  "name": "image_load_usp_svchost_clfsw32",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1055"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "*\\\\svchost.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "clfsw32.dll"
      ],
      "raw_values": [
        "*\\\\clfsw32.dll"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\svchost.exe\" and file.path:\"*\\\\clfsw32.dll\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2021/TA/PRIVATELOG/image_load_usp_svchost_clfsw32.eql",
  "metadata": {}
}