{
  "id": "1d927cef-2dba-59c0-9f2f-139fbd3929b6",
  "catalog": "sigma",
  "name": "proc_creation_win_xwizard_execution_non_default_location",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "xwizard.exe"
      ],
      "raw_values": [
        "*\\\\xwizard.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "xwizard.exe"
      ],
      "raw_values": [
        "xwizard.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\xwizard.exe\" or process.pe.original_file_name:\"xwizard.exe\") and (not (process.executable like~ (\"C:\\\\Windows\\\\System32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\", \"C:\\\\Windows\\\\WinSxS\\\\*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_xwizard_execution_non_default_location.eql",
  "metadata": {}
}