{
  "id": "1ebacfd1-1bb3-5056-9cfd-1de0cb565748",
  "catalog": "sigma",
  "name": "proc_creation_win_dump64_defender_av_bypass_rename",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1003.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-ma",
        "-mp"
      ],
      "raw_values": [
        "* -ma *",
        "* -mp *"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "program files",
        "dump64.exe"
      ],
      "raw_values": [
        ":\\\\Program Files*",
        "*\\\\Microsoft Visual Studio\\\\*",
        "*\\\\dump64.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "procdump"
      ],
      "raw_values": [
        "procdump"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\":\\\\Program Files*\" and process.executable:\"*\\\\Microsoft Visual Studio\\\\*\" and process.executable:\"*\\\\dump64.exe\") and (process.pe.original_file_name:\"procdump\" or (process.command_line like~ (\"* -ma *\", \"* -mp *\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_dump64_defender_av_bypass_rename.eql",
  "metadata": {}
}