{
  "id": "2058532f-b573-5fd9-ae90-034c235f9302",
  "catalog": "sigma",
  "name": "proc_creation_win_certmgr_certificate_installation",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1553.004"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certmgr.exe"
      ],
      "raw_values": [
        "*\\\\CertMgr.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certmgt.exe"
      ],
      "raw_values": [
        "CERTMGT.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "add",
        "root"
      ],
      "raw_values": [
        "*/add*",
        "*root*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\CertMgr.exe\" or process.pe.original_file_name:\"CERTMGT.EXE\") and (process.command_line:\"*/add*\" and process.command_line:\"*root*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_certmgr_certificate_installation.eql",
  "metadata": {}
}