{
  "id": "2076a92a-9b30-5864-8439-c5b8a0ffb738",
  "catalog": "sigma",
  "name": "proc_creation_win_reg_windows_defender_tamper",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "windows defender security center",
        "disallowexploitprotectionoverride",
        "enablecontrolledfolderaccess",
        "mpenablepus",
        "puaprotection",
        "spynetreporting",
        "submitsamplesconsent",
        "tamperprotection",
        "disableaccess",
        "disableantispyware",
        "disableantispywarerealtimeprotection",
        "disableantivirus",
        "disableantivirussignatures",
        "disablearchivescanning",
        "disablebehaviormonitoring",
        "disableblockatfirstseen",
        "disablecloudprotection",
        "disableconfig",
        "disableenhancednotifications",
        "disableintrusionpreventionsystem",
        "disableioavprotection",
        "disablenetworkprotection",
        "disableonaccessprotection",
        "disableprivacymode",
        "disablerealtimemonitoring",
        "disableroutinelytakingaction",
        "disablescanonrealtimeenable",
        "disablescriptscanning",
        "disablesecuritycenter",
        "notification_suppress",
        "signaturedisableupdateonstartupwithoutengine"
      ],
      "raw_values": [
        "*SOFTWARE\\\\Microsoft\\\\Windows Defender\\\\*",
        "*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender Security Center*",
        "*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\*",
        "*DisallowExploitProtectionOverride*",
        "*EnableControlledFolderAccess*",
        "*MpEnablePus*",
        "*PUAProtection*",
        "*SpynetReporting*",
        "*SubmitSamplesConsent*",
        "*TamperProtection*",
        "*DisableAccess*",
        "*DisableAntiSpyware*",
        "*DisableAntiSpywareRealtimeProtection*",
        "*DisableAntiVirus*",
        "*DisableAntiVirusSignatures*",
        "*DisableArchiveScanning*",
        "*DisableBehaviorMonitoring*",
        "*DisableBlockAtFirstSeen*",
        "*DisableCloudProtection*",
        "*DisableConfig*",
        "*DisableEnhancedNotifications*",
        "*DisableIntrusionPreventionSystem*",
        "*DisableIOAVProtection*",
        "*DisableNetworkProtection*",
        "*DisableOnAccessProtection*",
        "*DisablePrivacyMode*",
        "*DisableRealtimeMonitoring*",
        "*DisableRoutinelyTakingAction*",
        "*DisableScanOnRealtimeEnable*",
        "*DisableScriptScanning*",
        "*DisableSecurityCenter*",
        "*Notification_Suppress*",
        "*SignatureDisableUpdateOnStartupWithoutEngine*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "reg.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "add",
        "d 0",
        "d 1"
      ],
      "raw_values": [
        "* add *",
        "*d 0*",
        "*d 1*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\reg.exe\" or process.pe.original_file_name:\"reg.exe\") and (process.command_line like~ (\"*SOFTWARE\\\\Microsoft\\\\Windows Defender\\\\*\", \"*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender Security Center*\", \"*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\*\"))) and (((process.command_line:\"* add *\" and process.command_line:\"*d 0*\") and (process.command_line like~ (\"*DisallowExploitProtectionOverride*\", \"*EnableControlledFolderAccess*\", \"*MpEnablePus*\", \"*PUAProtection*\", \"*SpynetReporting*\", \"*SubmitSamplesConsent*\", \"*TamperProtection*\"))) or ((process.command_line:\"* add *\" and process.command_line:\"*d 1*\") and (process.command_line like~ (\"*DisableAccess*\", \"*DisableAntiSpyware*\", \"*DisableAntiSpywareRealtimeProtection*\", \"*DisableAntiVirus*\", \"*DisableAntiVirusSignatures*\", \"*DisableArchiveScanning*\", \"*DisableBehaviorMonitoring*\", \"*DisableBlockAtFirstSeen*\", \"*DisableCloudProtection*\", \"*DisableConfig*\", \"*DisableEnhancedNotifications*\", \"*DisableIntrusionPreventionSystem*\", \"*DisableIOAVProtection*\", \"*DisableNetworkProtection*\", \"*DisableOnAccessProtection*\", \"*DisablePrivacyMode*\", \"*DisableRealtimeMonitoring*\", \"*DisableRoutinelyTakingAction*\", \"*DisableScanOnRealtimeEnable*\", \"*DisableScriptScanning*\", \"*DisableSecurityCenter*\", \"*Notification_Suppress*\", \"*SignatureDisableUpdateOnStartupWithoutEngine*\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_reg_windows_defender_tamper.eql",
  "metadata": {}
}