{
  "id": "2196cb05-ef94-5f37-9c87-89fb3b8a4824",
  "catalog": "sigma",
  "name": "proc_creation_win_apt_fin7_exploitation_indicators",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "notepad++.exe",
        "rdpinit.exe"
      ],
      "raw_values": [
        "*\\\\notepad++.exe",
        "*\\\\rdpinit.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe",
        "notepad++.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\notepad++.exe"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable:\"*\\\\notepad++.exe\" and process.executable:\"*\\\\cmd.exe\") or (process.parent.executable:\"*\\\\rdpinit.exe\" and process.executable:\"*\\\\notepad++.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2024/TA/FIN7/proc_creation_win_apt_fin7_exploitation_indicators.eql",
  "metadata": {}
}