{
  "id": "22318fad-e2a2-5662-b2f4-c21db8497e30",
  "catalog": "sigma",
  "name": "win_security_apt_slingshot",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1053"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4701"
      ],
      "raw_values": [
        "4701"
      ]
    },
    {
      "field": "winlog.event_data.taskname",
      "raw_field": "winlog.event_data.TaskName",
      "operator": ":",
      "values": [
        "\\\\microsoft\\\\windows\\\\defrag\\\\scheduleddefrag"
      ],
      "raw_values": [
        "\\\\Microsoft\\\\Windows\\\\Defrag\\\\ScheduledDefrag"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4701\" and winlog.event_data.TaskName:\"\\\\Microsoft\\\\Windows\\\\Defrag\\\\ScheduledDefrag\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2018/TA/Slingshot/win_security_apt_slingshot.eql",
  "metadata": {}
}