{
  "id": "24c12114-055c-5a6c-9eeb-3484e377032b",
  "catalog": "sigma",
  "name": "proc_creation_win_exploit_cve_2022_22954_vmware_workspace_one_rce",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "prunsrv.exe"
      ],
      "raw_values": [
        "*\\\\prunsrv.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "powershell.exe",
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\cmd.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "c powershell"
      ],
      "raw_values": [
        "*/c powershell*"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\prunsrv.exe\" and (process.executable:\"*\\\\powershell.exe\" or (process.executable:\"*\\\\cmd.exe\" and process.command_line:\"*/c powershell*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2022/Exploits/CVE-2022-22954/proc_creation_win_exploit_cve_2022_22954_vmware_workspace_one_rce.eql",
  "metadata": {}
}