{
  "id": "255fde8c-4595-54d5-b8a2-eee6a487ca19",
  "catalog": "sigma",
  "name": "proc_creation_win_wsl_windows_binaries_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1202"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "']), flags=set())"
      ],
      "raw_values": [
        "SigmaRegularExpression(regexp=SigmaString(['[a-zA-Z]:\\\\\\\\']), flags=set())"
      ]
    },
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": ":",
      "values": [
        "\\\\\\\\wsl.localhost"
      ],
      "raw_values": [
        "*\\\\\\\\wsl.localhost*"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"SigmaRegularExpression(regexp=SigmaString(['[a-zA-Z]:\\\\\\\\']), flags=set())\" and process.working_directory:\"*\\\\\\\\wsl.localhost*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_wsl_windows_binaries_execution.eql",
  "metadata": {}
}