{
  "id": "25903f68-9db3-56ce-b54a-8a956310a74a",
  "catalog": "sigma",
  "name": "file_delete_win_delete_backup_file",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1490"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe",
        "wt.exe",
        "rundll32.exe",
        "regsvr32.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\wt.exe",
        "*\\\\rundll32.exe",
        "*\\\\regsvr32.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".vhd",
        ".bac",
        ".bak",
        ".wbcat",
        ".bkf",
        ".set",
        ".win",
        ".dsk"
      ],
      "raw_values": [
        "*.VHD",
        "*.bac",
        "*.bak",
        "*.wbcat",
        "*.bkf",
        "*.set",
        "*.win",
        "*.dsk"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\wt.exe\", \"*\\\\rundll32.exe\", \"*\\\\regsvr32.exe\")) and (file.path like~ (\"*.VHD\", \"*.bac\", \"*.bak\", \"*.wbcat\", \"*.bkf\", \"*.set\", \"*.win\", \"*.dsk\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/file/file_delete/file_delete_win_delete_backup_file.eql",
  "metadata": {}
}