{
  "id": "25b97de9-375f-5806-ae40-ee5b7bd81c61",
  "catalog": "sigma",
  "name": "proc_creation_win_reg_import_from_suspicious_paths",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "%temp%",
        "%tmp%",
        "%appdata%"
      ],
      "raw_values": [
        "*C:\\\\Users\\\\*",
        "*%temp%*",
        "*%tmp%*",
        "*%appdata%*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*C:\\\\Windows\\\\Temp\\\\*",
        "*C:\\\\ProgramData\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "reg.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "import"
      ],
      "raw_values": [
        "* import *"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\reg.exe\" or process.pe.original_file_name:\"reg.exe\") and process.command_line:\"* import *\" and (process.command_line like~ (\"*C:\\\\Users\\\\*\", \"*%temp%*\", \"*%tmp%*\", \"*%appdata%*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*C:\\\\Windows\\\\Temp\\\\*\", \"*C:\\\\ProgramData\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_reg_import_from_suspicious_paths.eql",
  "metadata": {}
}