{
  "id": "2b1cdc46-fbdd-5f39-8503-bf0a2695ed07",
  "catalog": "sigma",
  "name": "win_system_exploit_cve_2022_21919_or_cve_2021_34484",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "application"
      ],
      "raw_values": [
        "Application"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "1511"
      ],
      "raw_values": [
        "1511"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "microsoft-windows-user profiles service"
      ],
      "raw_values": [
        "Microsoft-Windows-User Profiles Service"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Application\" and (event.code:\"1511\" and winlog.provider_name:\"Microsoft-Windows-User Profiles Service\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2022/Exploits/CVE-2022-21919/win_system_exploit_cve_2022_21919_or_cve_2021_34484.eql",
  "metadata": {}
}