{
  "id": "2de65dd2-f981-51a0-8b8e-21d0ac1cb15a",
  "catalog": "sigma",
  "name": "proc_creation_win_ilasm_il_code_compilation",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "dll",
        "exe"
      ],
      "raw_values": [
        "* /dll*",
        "* /exe*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "ilasm.exe"
      ],
      "raw_values": [
        "*\\\\ilasm.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "ilasm.exe"
      ],
      "raw_values": [
        "ilasm.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\ilasm.exe\" or process.pe.original_file_name:\"ilasm.exe\") and (process.command_line like~ (\"* /dll*\", \"* /exe*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_ilasm_il_code_compilation.eql",
  "metadata": {}
}