{
  "id": "2e5fdd03-d987-598a-a2e0-df4ab8fb9bb7",
  "catalog": "sigma",
  "name": "proc_creation_win_cmdkey_recon",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1003.005"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmdkey.exe"
      ],
      "raw_values": [
        "*\\\\cmdkey.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmdkey.exe"
      ],
      "raw_values": [
        "cmdkey.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\cmdkey.exe\" or process.pe.original_file_name:\"cmdkey.exe\") and process.command_line like~ (\"* -l*\", \"* /l*\", \"* –l*\", \"* —l*\", \"* ―l*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_cmdkey_recon.eql",
  "metadata": {}
}