{
  "id": "3115b36f-7dd0-5106-97fa-c149a7f315bf",
  "catalog": "sigma",
  "name": "proc_creation_win_hktl_sharp_chisel",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "sharpchisel.exe"
      ],
      "raw_values": [
        "*\\\\SharpChisel.exe"
      ]
    },
    {
      "field": "process.pe.product",
      "raw_field": "process.pe.product",
      "operator": ":",
      "values": [
        "sharpchisel"
      ],
      "raw_values": [
        "SharpChisel"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\SharpChisel.exe\" or process.pe.product:\"SharpChisel\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hktl_sharp_chisel.eql",
  "metadata": {}
}