{
  "id": "3132c598-cd91-5faf-b5c9-07af013ea34c",
  "catalog": "sigma",
  "name": "proc_creation_win_msiexec_masquerading",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1036.005"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msiexec.exe"
      ],
      "raw_values": [
        "*\\\\msiexec.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "\\\\msiexec.exe"
      ],
      "raw_values": [
        "\\\\msiexec.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\msiexec.exe\" or process.pe.original_file_name:\"\\\\msiexec.exe\") and (not (process.executable like~ (\"C:\\\\Windows\\\\System32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\", \"C:\\\\Windows\\\\WinSxS\\\\*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_msiexec_masquerading.eql",
  "metadata": {}
}