{
  "id": "33bf63d2-c49b-5169-88bf-009aef6cbd11",
  "catalog": "sigma",
  "name": "proc_creation_win_remote_access_tools_ammyy_admin_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\rundll32.exe\" and process.command_line:\"*AMMYY\\\\aa_nts.dll\\\",run*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_remote_access_tools_ammyy_admin_execution.eql",
  "metadata": {}
}