{
  "id": "342cf018-7a98-55ea-a886-3746d9678ec0",
  "catalog": "sigma",
  "name": "sysmon_wmi_susp_scripting",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059.005"
  ],
  "event_categories": [
    "wmi"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "iex(",
        "-nop",
        "-noprofile",
        "-decode",
        "-enc",
        "wscript.shell",
        "system.security.cryptography.frombase64transform"
      ],
      "raw_values": [
        "* iex(*",
        "* -nop *",
        "* -noprofile *",
        "* -decode *",
        "* -enc *",
        "*WScript.Shell*",
        "*System.Security.Cryptography.FromBase64Transform*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "new-object",
        "net.webclient",
        ".downloadstring",
        ".downloadfile"
      ],
      "raw_values": [
        "*new-object*",
        "*net.webclient*",
        "*.downloadstring*",
        "*.downloadfile*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*new-object*\" and process.executable:\"*net.webclient*\" and process.executable:\"*.downloadstring*\") or (process.executable:\"*new-object*\" and process.executable:\"*net.webclient*\" and process.executable:\"*.downloadfile*\") or (process.executable like~ (\"* iex(*\", \"* -nop *\", \"* -noprofile *\", \"* -decode *\", \"* -enc *\", \"*WScript.Shell*\", \"*System.Security.Cryptography.FromBase64Transform*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/wmi_event/sysmon_wmi_susp_scripting.eql",
  "metadata": {}
}