{
  "id": "36048b69-d39e-5604-bdd7-bc7bae9e46b4",
  "catalog": "sigma",
  "name": "proc_creation_win_curl_useragent",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1071.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "--user-agent"
      ],
      "raw_values": [
        "* -A *",
        "* --user-agent *"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "curl.exe"
      ],
      "raw_values": [
        "*\\\\curl.exe"
      ]
    },
    {
      "field": "process.pe.product",
      "raw_field": "process.pe.product",
      "operator": ":",
      "values": [
        "the curl executable"
      ],
      "raw_values": [
        "The curl executable"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\curl.exe\" or process.pe.product:\"The curl executable\") and (process.command_line like~ (\"* -A *\", \"* --user-agent *\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_curl_useragent.eql",
  "metadata": {}
}