{
  "id": "361abf69-6760-560d-83d0-f368001cdbe7",
  "catalog": "sigma",
  "name": "dns_query_win_malware_socgholish_second_stage_c2",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1219.002"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": ":",
      "values": [
        "sigmaregularexpression(regexp=sigmastring(['[a-f0-9]{4,8}\\\\.(', <specialchars.wildcard_single: 2>, ':[a-z0-9\\\\-]+\\\\.){2}[a-z0-9\\\\-]+']), flags=set())"
      ],
      "raw_values": [
        "SigmaRegularExpression(regexp=SigmaString(['[a-f0-9]{4,8}\\\\.(', <SpecialChars.WILDCARD_SINGLE: 2>, ':[a-z0-9\\\\-]+\\\\.){2}[a-z0-9\\\\-]+']), flags=set())"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\wscript.exe\" and dns.question.name:\"SigmaRegularExpression(regexp=SigmaString(['[a-f0-9]{4,8}\\\\.(', <SpecialChars.WILDCARD_SINGLE: 2>, ':[a-z0-9\\\\-]+\\\\.){2}[a-z0-9\\\\-]+']), flags=set())\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Malware/dns_query_win_malware_socgholish_second_stage_c2.eql",
  "metadata": {}
}