{
  "id": "365b83dc-4083-5bab-a863-55b97cbb95dd",
  "catalog": "sigma",
  "name": "proc_creation_win_pua_nsudo",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1569.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "nsudo.exe",
        "nsudolc.exe",
        "nsudolg.exe"
      ],
      "raw_values": [
        "*\\\\NSudo.exe",
        "*\\\\NSudoLC.exe",
        "*\\\\NSudoLG.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "nsudo.exe",
        "nsudolc.exe",
        "nsudolg.exe"
      ],
      "raw_values": [
        "NSudo.exe",
        "NSudoLC.exe",
        "NSudoLG.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-u:s",
        "-u:t",
        "-u:e",
        "-p:e",
        "-m:s",
        "-m:h",
        "-u=s",
        "-u=t",
        "-u=e",
        "-p=e",
        "-m=s",
        "-m=h",
        "-showwindowmode:hide"
      ],
      "raw_values": [
        "*-U:S *",
        "*-U:T *",
        "*-U:E *",
        "*-P:E *",
        "*-M:S *",
        "*-M:H *",
        "*-U=S *",
        "*-U=T *",
        "*-U=E *",
        "*-P=E *",
        "*-M=S *",
        "*-M=H *",
        "*-ShowWindowMode:Hide*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\NSudo.exe\", \"*\\\\NSudoLC.exe\", \"*\\\\NSudoLG.exe\")) or (process.pe.original_file_name like~ (\"NSudo.exe\", \"NSudoLC.exe\", \"NSudoLG.exe\"))) and (process.command_line like~ (\"*-U:S *\", \"*-U:T *\", \"*-U:E *\", \"*-P:E *\", \"*-M:S *\", \"*-M:H *\", \"*-U=S *\", \"*-U=T *\", \"*-U=E *\", \"*-P=E *\", \"*-M=S *\", \"*-M=H *\", \"*-ShowWindowMode:Hide*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_pua_nsudo.eql",
  "metadata": {}
}