{
  "id": "36c4efed-5c19-524e-b5e6-e23c533dc5b3",
  "catalog": "sigma",
  "name": "registry_set_scr_file_executed_by_rundll32",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.011"
  ],
  "event_categories": [
    "registry"
  ],
  "conditions": [
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": "like~",
      "values": [
        "c:\\\\windows\\\\system32\\\\",
        "c:\\\\windows\\\\syswow64\\\\"
      ],
      "raw_values": [
        "*C:\\\\Windows\\\\System32\\\\*",
        "*C:\\\\Windows\\\\SysWOW64\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": ":",
      "values": [
        "\\\\control panel\\\\desktop\\\\scrnsave.exe"
      ],
      "raw_values": [
        "*\\\\Control Panel\\\\Desktop\\\\SCRNSAVE.EXE*"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": ":",
      "values": [
        ".scr"
      ],
      "raw_values": [
        "*.scr"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\rundll32.exe\" and (registry.path:\"*\\\\Control Panel\\\\Desktop\\\\SCRNSAVE.EXE*\" and winlog.event_data.Details:\"*.scr\") and (not (winlog.event_data.Details like~ (\"*C:\\\\Windows\\\\System32\\\\*\", \"*C:\\\\Windows\\\\SysWOW64\\\\*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/registry/registry_set/registry_set_scr_file_executed_by_rundll32.eql",
  "metadata": {}
}