{
  "id": "383cef26-ca1b-5153-9da7-43634f8a9426",
  "catalog": "sigma",
  "name": "proc_creation_win_cmd_http_appdata",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059.003",
    "attack.t1059.001",
    "attack.t1105"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "http",
        "%appdata%"
      ],
      "raw_values": [
        "*http*",
        "*://*",
        "*%AppData%*"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\cmd.exe\" and (process.command_line:\"*http*\" and process.command_line:\"*://*\" and process.command_line:\"*%AppData%*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_cmd_http_appdata.eql",
  "metadata": {}
}