{
  "id": "39a243ac-ed7d-5a73-b238-110004e3aaa7",
  "catalog": "sigma",
  "name": "image_load_office_excel_xll_susp_load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1204.002"
  ],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "excel.exe"
      ],
      "raw_values": [
        "*\\\\excel.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".xll"
      ],
      "raw_values": [
        "*.xll"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\excel.exe\" and (file.path like~ (\"*\\\\Desktop\\\\*\", \"*\\\\Downloads\\\\*\", \"*\\\\Perflogs\\\\*\", \"*\\\\Temp\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\Windows\\\\Tasks\\\\*\")) and file.path:\"*.xll\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/image_load/image_load_office_excel_xll_susp_load.eql",
  "metadata": {}
}