{
  "id": "3ac987f6-b672-530f-8dc9-cee7c2ee1a87",
  "catalog": "sigma",
  "name": "proc_creation_win_winget_add_insecure_custom_source",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "winget.exe"
      ],
      "raw_values": [
        "*\\\\winget.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "winget.exe"
      ],
      "raw_values": [
        "winget.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "source",
        "add"
      ],
      "raw_values": [
        "*source *",
        "*add *",
        "*http://*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\winget.exe\" or process.pe.original_file_name:\"winget.exe\") and (process.command_line:\"*source *\" and process.command_line:\"*add *\" and process.command_line:\"*http://*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_winget_add_insecure_custom_source.eql",
  "metadata": {}
}