{
  "id": "3cbe7bf6-208d-5ed4-9dad-20f89735b818",
  "catalog": "sigma",
  "name": "proc_creation_win_mstsc_remote_connection",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-v:",
        "–v:",
        "—v:",
        "―v:"
      ],
      "raw_values": [
        "* -v:*",
        "* /v:*",
        "* –v:*",
        "* —v:*",
        "* ―v:*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mstsc.exe"
      ],
      "raw_values": [
        "*\\\\mstsc.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "mstsc.exe"
      ],
      "raw_values": [
        "mstsc.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "wslhost.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\System32\\\\lxss\\\\wslhost.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "wslg.rdp"
      ],
      "raw_values": [
        "*C:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\mstsc.exe\" or process.pe.original_file_name:\"mstsc.exe\") and process.command_line like~ (\"* -v:*\", \"* /v:*\", \"* –v:*\", \"* —v:*\", \"* ―v:*\")) and (not (process.parent.executable:\"C:\\\\Windows\\\\System32\\\\lxss\\\\wslhost.exe\" and process.command_line:\"*C:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_mstsc_remote_connection.eql",
  "metadata": {}
}