{
  "id": "3e5c8d6b-0849-511b-bdac-8adc3b03f521",
  "catalog": "sigma",
  "name": "proc_creation_win_uac_bypass_pkgmgr_dism",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.integritylevel",
      "raw_field": "winlog.event_data.IntegrityLevel",
      "operator": "like~",
      "values": [
        "high",
        "system",
        "s-1-16-16384",
        "s-1-16-12288"
      ],
      "raw_values": [
        "High",
        "System",
        "S-1-16-16384",
        "S-1-16-12288"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "pkgmgr.exe"
      ],
      "raw_values": [
        "*\\\\pkgmgr.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dism.exe"
      ],
      "raw_values": [
        "*\\\\dism.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\pkgmgr.exe\" and process.executable:\"*\\\\dism.exe\" and (winlog.event_data.IntegrityLevel like~ (\"High\", \"System\", \"S-1-16-16384\", \"S-1-16-12288\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_uac_bypass_pkgmgr_dism.eql",
  "metadata": {}
}