{
  "id": "3ec01858-f07d-5169-a2ee-1f7e7d01312f",
  "catalog": "sigma",
  "name": "proc_creation_win_netsh_port_forwarding_3389",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1090"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "netsh.exe"
      ],
      "raw_values": [
        "*\\\\netsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "netsh.exe"
      ],
      "raw_values": [
        "netsh.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "=3389"
      ],
      "raw_values": [
        "* i*",
        "* p*",
        "*=3389*",
        "* c*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\netsh.exe\" or process.pe.original_file_name:\"netsh.exe\") and (process.command_line:\"* i*\" and process.command_line:\"* p*\" and process.command_line:\"*=3389*\" and process.command_line:\"* c*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_netsh_port_forwarding_3389.eql",
  "metadata": {}
}