{
  "id": "3ece3182-c879-5b0d-8eb0-92092f70e1e9",
  "catalog": "sigma",
  "name": "proc_creation_win_extexport_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "extexport.exe"
      ],
      "raw_values": [
        "*\\\\Extexport.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "extexport.exe"
      ],
      "raw_values": [
        "extexport.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\Extexport.exe\" or process.pe.original_file_name:\"extexport.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_extexport_execution.eql",
  "metadata": {}
}