{
  "id": "42991c2e-d270-53ac-bf25-6c061d728f51",
  "catalog": "sigma",
  "name": "net_connection_win_domain_telegram_api_non_browser_access",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1102",
    "attack.t1567",
    "attack.t1105"
  ],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "chrome.exe",
        "firefox.exe",
        "msedge.exe",
        "msedgewebview2.exe"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe",
        "C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe",
        "*\\\\msedge.exe",
        "*\\\\msedgewebview2.exe"
      ]
    },
    {
      "field": "destination.domain",
      "raw_field": "destination.domain",
      "operator": ":",
      "values": [
        "api.telegram.org"
      ],
      "raw_values": [
        "*api.telegram.org*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "brave.exe",
        "maxthon.exe",
        "microsoftedge.exe",
        "opera.exe",
        "safari.exe",
        "seamonkey.exe",
        "vivaldi.exe",
        "whale.exe"
      ],
      "raw_values": [
        "*\\\\brave.exe",
        "*\\\\maxthon.exe",
        "C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*",
        "*\\\\WindowsApps\\\\MicrosoftEdge.exe",
        "*\\\\opera.exe",
        "*\\\\safari.exe",
        "*\\\\seamonkey.exe",
        "*\\\\vivaldi.exe",
        "*\\\\whale.exe"
      ]
    }
  ],
  "raw_query": "any where destination.domain:\"*api.telegram.org*\" and (not (process.executable:\"*\\\\brave.exe\" or (process.executable like~ (\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\", \"C:\\\\Program Files (x86)\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\")) or (process.executable like~ (\"C:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\", \"C:\\\\Program Files (x86)\\\\Mozilla Firefox\\\\firefox.exe\")) or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\Internet Explorer\\\\iexplore.exe\", \"C:\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\")) or process.executable:\"*\\\\maxthon.exe\" or (process.executable:\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\" or process.executable:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\" or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\", \"C:\\\\Program Files\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\"))) or ((process.executable like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeCore\\\\*\", \"C:\\\\Program Files\\\\Microsoft\\\\EdgeCore\\\\*\")) and (process.executable like~ (\"*\\\\msedge.exe\", \"*\\\\msedgewebview2.exe\"))) or process.executable:\"*\\\\opera.exe\" or process.executable:\"*\\\\safari.exe\" or process.executable:\"*\\\\seamonkey.exe\" or process.executable:\"*\\\\vivaldi.exe\" or process.executable:\"*\\\\whale.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/network_connection/net_connection_win_domain_telegram_api_non_browser_access.eql",
  "metadata": {}
}