{
  "id": "44ebf220-86a7-501b-bba9-c171a548bdbf",
  "catalog": "sigma",
  "name": "proc_creation_win_lolbin_replace",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1105"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "replace.exe"
      ],
      "raw_values": [
        "*\\\\replace.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\replace.exe\" and process.command_line like~ (\"*-a*\", \"*/a*\", \"*–a*\", \"*—a*\", \"*―a*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_lolbin_replace.eql",
  "metadata": {}
}