{
  "id": "4515af48-8a48-5421-83ca-1bdfa56a8def",
  "catalog": "sigma",
  "name": "win_security_invoke_obfuscation_via_var_services_security",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1027",
    "attack.t1059.001"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.servicefilename",
      "raw_field": "winlog.event_data.ServiceFileName",
      "operator": "like~",
      "values": [
        "{0}",
        "{1}",
        "{2}",
        "{3}",
        "{4}",
        "{5}"
      ],
      "raw_values": [
        "*{0}*",
        "*{1}*",
        "*{2}*",
        "*{3}*",
        "*{4}*",
        "*{5}*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4697"
      ],
      "raw_values": [
        "4697"
      ]
    },
    {
      "field": "winlog.event_data.servicefilename",
      "raw_field": "winlog.event_data.ServiceFileName",
      "operator": ":",
      "values": [
        "&&set",
        "cmd"
      ],
      "raw_values": [
        "*&&set*",
        "*cmd*",
        "*/c*",
        "*-f*"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4697\" and (winlog.event_data.ServiceFileName:\"*&&set*\" and winlog.event_data.ServiceFileName:\"*cmd*\" and winlog.event_data.ServiceFileName:\"*/c*\" and winlog.event_data.ServiceFileName:\"*-f*\") and (winlog.event_data.ServiceFileName like~ (\"*{0}*\", \"*{1}*\", \"*{2}*\", \"*{3}*\", \"*{4}*\", \"*{5}*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_invoke_obfuscation_via_var_services_security.eql",
  "metadata": {}
}