{
  "id": "45a3abb0-c84b-5311-9121-bbd2b9130dae",
  "catalog": "sigma",
  "name": "proc_creation_win_pua_csexec",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1587.001",
    "attack.t1569.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "csexec.exe"
      ],
      "raw_values": [
        "*\\\\csexec.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "csexec"
      ],
      "raw_values": [
        "csexec"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\csexec.exe\" or process.pe.description:\"csexec\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_pua_csexec.eql",
  "metadata": {}
}