{
  "id": "461c5789-69c4-5c5a-90ae-dbb287f4698e",
  "catalog": "sigma",
  "name": "proc_creation_win_sysinternals_psexesvc",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "psexesvc.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\PSEXESVC.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "psexesvc.exe"
      ],
      "raw_values": [
        "psexesvc.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"C:\\\\Windows\\\\PSEXESVC.exe\" or process.pe.original_file_name:\"psexesvc.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_sysinternals_psexesvc.eql",
  "metadata": {}
}