{
  "id": "47570e1b-7ce3-5930-902e-479b86d05e1f",
  "catalog": "sigma",
  "name": "proc_creation_win_fsi_fsharp_code_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "fsi.exe",
        "fsianycpu.exe"
      ],
      "raw_values": [
        "*\\\\fsi.exe",
        "*\\\\fsianycpu.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "fsi.exe",
        "fsianycpu.exe"
      ],
      "raw_values": [
        "fsi.exe",
        "fsianycpu.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\fsi.exe\", \"*\\\\fsianycpu.exe\")) or (process.pe.original_file_name like~ (\"fsi.exe\", \"fsianycpu.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_fsi_fsharp_code_execution.eql",
  "metadata": {}
}