{
  "id": "482f9f0a-1f4f-5888-a3bc-8c1119840213",
  "catalog": "sigma",
  "name": "proc_creation_win_uac_bypass_consent_comctl32",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1548.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.integritylevel",
      "raw_field": "winlog.event_data.IntegrityLevel",
      "operator": "like~",
      "values": [
        "high",
        "system",
        "s-1-16-16384",
        "s-1-16-12288"
      ],
      "raw_values": [
        "High",
        "System",
        "S-1-16-16384",
        "S-1-16-12288"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "consent.exe"
      ],
      "raw_values": [
        "*\\\\consent.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "werfault.exe"
      ],
      "raw_values": [
        "*\\\\werfault.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\consent.exe\" and process.executable:\"*\\\\werfault.exe\" and (winlog.event_data.IntegrityLevel like~ (\"High\", \"System\", \"S-1-16-16384\", \"S-1-16-12288\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_uac_bypass_consent_comctl32.eql",
  "metadata": {}
}