{
  "id": "48d7bb8c-fc84-588e-bd06-de01c50d2259",
  "catalog": "sigma",
  "name": "file_delete_win_exploit_cve_2021_1675_print_nightmare",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1574"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "spoolsv.exe"
      ],
      "raw_values": [
        "*\\\\spoolsv.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\spoolsv.exe\" and file.path:\"*C:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2021/Exploits/CVE-2021-1675/file_delete_win_exploit_cve_2021_1675_print_nightmare.eql",
  "metadata": {}
}