{
  "id": "497d9189-8095-5755-860c-81b78fca544c",
  "catalog": "sigma",
  "name": "proc_creation_win_remote_access_tools_meshagent_exec",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1219.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "meshagent.exe"
      ],
      "raw_values": [
        "*\\\\meshagent.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\meshagent.exe\" and (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_remote_access_tools_meshagent_exec.eql",
  "metadata": {}
}