{
  "id": "49a767ae-64cb-5a84-9ab8-33d2ba896dde",
  "catalog": "sigma",
  "name": "proc_creation_win_wscript_cscript_script_exec",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "wscript.exe",
        "cscript.exe"
      ],
      "raw_values": [
        "wscript.exe",
        "cscript.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "wscript.exe",
        "cscript.exe"
      ],
      "raw_values": [
        "*\\\\wscript.exe",
        "*\\\\cscript.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".js",
        ".jse",
        ".vba",
        ".vbe",
        ".vbs",
        ".wsf"
      ],
      "raw_values": [
        "*.js*",
        "*.jse*",
        "*.vba*",
        "*.vbe*",
        "*.vbs*",
        "*.wsf*"
      ]
    }
  ],
  "raw_query": "any where ((process.pe.original_file_name like~ (\"wscript.exe\", \"cscript.exe\")) or (process.executable like~ (\"*\\\\wscript.exe\", \"*\\\\cscript.exe\"))) and (process.command_line like~ (\"*.js*\", \"*.jse*\", \"*.vba*\", \"*.vbe*\", \"*.vbs*\", \"*.wsf*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_wscript_cscript_script_exec.eql",
  "metadata": {}
}