{
  "id": "4aa2b57c-35e9-59b4-ad3a-5c8505c9237e",
  "catalog": "sigma",
  "name": "create_remote_thread_win_powershell_susp_targets",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": "like~",
      "values": [
        "\\\\rundll32.exe",
        "\\\\regsvr32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe",
        "*\\\\regsvr32.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and (winlog.event_data.TargetImage like~ (\"*\\\\rundll32.exe\", \"*\\\\regsvr32.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/create_remote_thread/create_remote_thread_win_powershell_susp_targets.eql",
  "metadata": {}
}