{
  "id": "4b179a6b-0606-56ee-9bed-74013a969c59",
  "catalog": "sigma",
  "name": "proc_creation_win_netsh_fw_disable",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1562.004"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "netsh.exe"
      ],
      "raw_values": [
        "*\\\\netsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "netsh.exe"
      ],
      "raw_values": [
        "netsh.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "firewall",
        "set",
        "opmode",
        "disable",
        "advfirewall",
        "state",
        "off"
      ],
      "raw_values": [
        "*firewall*",
        "*set*",
        "*opmode*",
        "*disable*",
        "*advfirewall*",
        "*state*",
        "*off*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\netsh.exe\" or process.pe.original_file_name:\"netsh.exe\") and ((process.command_line:\"*firewall*\" and process.command_line:\"*set*\" and process.command_line:\"*opmode*\" and process.command_line:\"*disable*\") or (process.command_line:\"*advfirewall*\" and process.command_line:\"*set*\" and process.command_line:\"*state*\" and process.command_line:\"*off*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_netsh_fw_disable.eql",
  "metadata": {}
}