{
  "id": "4b267007-755f-5595-a1b5-1035680d22c5",
  "catalog": "sigma",
  "name": "win_security_wfp_endpoint_agent_blocked",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1562"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "amsvc.exe",
        "cb.exe",
        "cetasvc.exe",
        "cntaosmgr.exe",
        "cramtray.exe",
        "crssvc.exe",
        "csfalconcontainer.exe",
        "csfalconservice.exe",
        "cybereasonav.exe",
        "cylancesvc.exe",
        "cyserver.exe",
        "cyveraservice.exe",
        "cyvrfsflt.exe",
        "eiconnector.exe",
        "elastic-agent.exe",
        "elastic-endpoint.exe",
        "endpointbasecamp.exe",
        "executionpreventionsvc.exe",
        "filebeat.exe",
        "fortiedr.exe",
        "hmpalert.exe",
        "hurukai.exe",
        "logprocessorservice.exe",
        "mcsagent.exe",
        "mcsclient.exe",
        "msmpeng.exe",
        "mssense.exe",
        "ntrtscan.exe",
        "pccntmon.exe",
        "qualysagent.exe",
        "repmgr.exe",
        "reputils.exe",
        "repux.exe",
        "repwav.exe",
        "repwsc.exe",
        "sedservice.exe",
        "sensecncproxy.exe",
        "senseir.exe",
        "sensendr.exe",
        "sensesampleuploader.exe",
        "sentinelagent.exe",
        "sentinelagentworker.exe",
        "sentinelbrowsernativehost.exe",
        "sentinelhelperservice.exe",
        "sentinelservicehost.exe",
        "sentinelstaticengine.exe",
        "sentinelstaticenginescanner.exe",
        "sfc.exe",
        "sophos ui.exe",
        "sophosfilescanner.exe",
        "sophosfs.exe",
        "sophoshealth.exe",
        "sophosips.exe",
        "sophoslivequeryservice.exe",
        "sophosnetfilter.exe",
        "sophosntpservice.exe",
        "sophososquery.exe",
        "sspservice.exe",
        "taniumclient.exe",
        "taniumcx.exe",
        "taniumdetectengine.exe",
        "tmbmsrv.exe",
        "tmccsf.exe",
        "tmlisten.exe",
        "tmwscsvc.exe",
        "traps.exe",
        "winlogbeat.exe",
        "wscommunicator.exe",
        "xagt.exe"
      ],
      "raw_values": [
        "*\\\\AmSvc.exe",
        "*\\\\cb.exe",
        "*\\\\CETASvc.exe",
        "*\\\\CNTAoSMgr.exe",
        "*\\\\CrAmTray.exe",
        "*\\\\CrsSvc.exe",
        "*\\\\CSFalconContainer.exe",
        "*\\\\CSFalconService.exe",
        "*\\\\CybereasonAV.exe",
        "*\\\\CylanceSvc.exe",
        "*\\\\cyserver.exe",
        "*\\\\CyveraService.exe",
        "*\\\\CyvrFsFlt.exe",
        "*\\\\EIConnector.exe",
        "*\\\\elastic-agent.exe",
        "*\\\\elastic-endpoint.exe",
        "*\\\\EndpointBasecamp.exe",
        "*\\\\ExecutionPreventionSvc.exe",
        "*\\\\filebeat.exe",
        "*\\\\fortiedr.exe",
        "*\\\\hmpalert.exe",
        "*\\\\hurukai.exe",
        "*\\\\LogProcessorService.exe",
        "*\\\\mcsagent.exe",
        "*\\\\mcsclient.exe",
        "*\\\\MsMpEng.exe",
        "*\\\\MsSense.exe",
        "*\\\\Ntrtscan.exe",
        "*\\\\PccNTMon.exe",
        "*\\\\QualysAgent.exe",
        "*\\\\RepMgr.exe",
        "*\\\\RepUtils.exe",
        "*\\\\RepUx.exe",
        "*\\\\RepWAV.exe",
        "*\\\\RepWSC.exe",
        "*\\\\sedservice.exe",
        "*\\\\SenseCncProxy.exe",
        "*\\\\SenseIR.exe",
        "*\\\\SenseNdr.exe",
        "*\\\\SenseSampleUploader.exe",
        "*\\\\SentinelAgent.exe",
        "*\\\\SentinelAgentWorker.exe",
        "*\\\\SentinelBrowserNativeHost.exe",
        "*\\\\SentinelHelperService.exe",
        "*\\\\SentinelServiceHost.exe",
        "*\\\\SentinelStaticEngine.exe",
        "*\\\\SentinelStaticEngineScanner.exe",
        "*\\\\sfc.exe",
        "*\\\\sophos ui.exe",
        "*\\\\sophosfilescanner.exe",
        "*\\\\sophosfs.exe",
        "*\\\\sophoshealth.exe",
        "*\\\\sophosips.exe",
        "*\\\\sophosLivequeryservice.exe",
        "*\\\\sophosnetfilter.exe",
        "*\\\\sophosntpservice.exe",
        "*\\\\sophososquery.exe",
        "*\\\\sspservice.exe",
        "*\\\\TaniumClient.exe",
        "*\\\\TaniumCX.exe",
        "*\\\\TaniumDetectEngine.exe",
        "*\\\\TMBMSRV.exe",
        "*\\\\TmCCSF.exe",
        "*\\\\TmListen.exe",
        "*\\\\TmWSCSvc.exe",
        "*\\\\Traps.exe",
        "*\\\\winlogbeat.exe",
        "*\\\\WSCommunicator.exe",
        "*\\\\xagt.exe"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "5157"
      ],
      "raw_values": [
        "5157"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"5157\" and (process.executable like~ (\"*\\\\AmSvc.exe\", \"*\\\\cb.exe\", \"*\\\\CETASvc.exe\", \"*\\\\CNTAoSMgr.exe\", \"*\\\\CrAmTray.exe\", \"*\\\\CrsSvc.exe\", \"*\\\\CSFalconContainer.exe\", \"*\\\\CSFalconService.exe\", \"*\\\\CybereasonAV.exe\", \"*\\\\CylanceSvc.exe\", \"*\\\\cyserver.exe\", \"*\\\\CyveraService.exe\", \"*\\\\CyvrFsFlt.exe\", \"*\\\\EIConnector.exe\", \"*\\\\elastic-agent.exe\", \"*\\\\elastic-endpoint.exe\", \"*\\\\EndpointBasecamp.exe\", \"*\\\\ExecutionPreventionSvc.exe\", \"*\\\\filebeat.exe\", \"*\\\\fortiedr.exe\", \"*\\\\hmpalert.exe\", \"*\\\\hurukai.exe\", \"*\\\\LogProcessorService.exe\", \"*\\\\mcsagent.exe\", \"*\\\\mcsclient.exe\", \"*\\\\MsMpEng.exe\", \"*\\\\MsSense.exe\", \"*\\\\Ntrtscan.exe\", \"*\\\\PccNTMon.exe\", \"*\\\\QualysAgent.exe\", \"*\\\\RepMgr.exe\", \"*\\\\RepUtils.exe\", \"*\\\\RepUx.exe\", \"*\\\\RepWAV.exe\", \"*\\\\RepWSC.exe\", \"*\\\\sedservice.exe\", \"*\\\\SenseCncProxy.exe\", \"*\\\\SenseIR.exe\", \"*\\\\SenseNdr.exe\", \"*\\\\SenseSampleUploader.exe\", \"*\\\\SentinelAgent.exe\", \"*\\\\SentinelAgentWorker.exe\", \"*\\\\SentinelBrowserNativeHost.exe\", \"*\\\\SentinelHelperService.exe\", \"*\\\\SentinelServiceHost.exe\", \"*\\\\SentinelStaticEngine.exe\", \"*\\\\SentinelStaticEngineScanner.exe\", \"*\\\\sfc.exe\", \"*\\\\sophos ui.exe\", \"*\\\\sophosfilescanner.exe\", \"*\\\\sophosfs.exe\", \"*\\\\sophoshealth.exe\", \"*\\\\sophosips.exe\", \"*\\\\sophosLivequeryservice.exe\", \"*\\\\sophosnetfilter.exe\", \"*\\\\sophosntpservice.exe\", \"*\\\\sophososquery.exe\", \"*\\\\sspservice.exe\", \"*\\\\TaniumClient.exe\", \"*\\\\TaniumCX.exe\", \"*\\\\TaniumDetectEngine.exe\", \"*\\\\TMBMSRV.exe\", \"*\\\\TmCCSF.exe\", \"*\\\\TmListen.exe\", \"*\\\\TmWSCSvc.exe\", \"*\\\\Traps.exe\", \"*\\\\winlogbeat.exe\", \"*\\\\WSCommunicator.exe\", \"*\\\\xagt.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/object_access/win_security_wfp_endpoint_agent_blocked.eql",
  "metadata": {}
}