{
  "id": "4b41cbfb-573a-5851-a9ca-477816c0386d",
  "catalog": "sigma",
  "name": "proc_creation_win_cmd_redirect",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1082"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "Cmd.Exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe"
      ]
    }
  ],
  "raw_query": "any where ((process.pe.original_file_name:\"Cmd.Exe\" or process.executable:\"*\\\\cmd.exe\") and process.command_line:\"*>*\") and (not (process.command_line like~ (\"*C:\\\\Program Files (x86)\\\\Internet Download Manager\\\\IDMMsgHost.exe*\", \"*chrome-extension://*\", \"*\\\\.\\\\pipe\\\\chrome.nativeMessaging*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_cmd_redirect.eql",
  "metadata": {}
}