{
  "id": "4d14b62e-6b0e-5e22-9cc9-1550fc55cb4b",
  "catalog": "sigma",
  "name": "proc_creation_win_hktl_cobaltstrike_load_by_rundll32",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.011"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "rundll32.exe",
        "rundll32",
        "startw",
        ",startw"
      ],
      "raw_values": [
        "*rundll32.exe*",
        "*rundll32 *",
        "* StartW",
        "*,StartW"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "RUNDLL32.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        ".dll"
      ],
      "raw_values": [
        "*.dll*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\rundll32.exe\" or process.pe.original_file_name:\"RUNDLL32.EXE\" or (process.command_line like~ (\"*rundll32.exe*\", \"*rundll32 *\"))) and (process.command_line:\"*.dll*\" and (process.command_line like~ (\"* StartW\", \"*,StartW\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_load_by_rundll32.eql",
  "metadata": {}
}