{
  "id": "4e9dc2f7-853a-5c20-be0f-12896af11769",
  "catalog": "sigma",
  "name": "proc_creation_win_net_use_mount_internet_share",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1021.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "*\\\\net.exe",
        "*\\\\net1.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "net.exe",
        "net1.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "use",
        "http"
      ],
      "raw_values": [
        "* use *",
        "* http*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\net.exe\", \"*\\\\net1.exe\")) or (process.pe.original_file_name like~ (\"net.exe\", \"net1.exe\"))) and (process.command_line:\"* use *\" and process.command_line:\"* http*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_net_use_mount_internet_share.eql",
  "metadata": {}
}