{
  "id": "4f857e1a-ce6a-5db4-ba56-81e111499b97",
  "catalog": "sigma",
  "name": "win_security_exploit_cve_2019_0708_scanner_poc",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4625"
      ],
      "raw_values": [
        "4625"
      ]
    },
    {
      "field": "winlog.event_data.targetusername",
      "raw_field": "winlog.event_data.TargetUserName",
      "operator": ":",
      "values": [
        "aaaaaaa"
      ],
      "raw_values": [
        "AAAAAAA"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4625\" and winlog.event_data.TargetUserName:\"AAAAAAA\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2019/Exploits/CVE-2019-0708/win_security_exploit_cve_2019_0708_scanner_poc.eql",
  "metadata": {}
}