{
  "id": "516b14e2-7fb2-5100-8349-6e87638ae390",
  "catalog": "sigma",
  "name": "proc_creation_win_reg_enumeration_for_credentials_in_registry",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1552.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "query",
        "reg_sz",
        "hklm",
        "hkcu",
        "sessions"
      ],
      "raw_values": [
        "* query *",
        "*/t *",
        "*REG_SZ*",
        "*/s*",
        "*/f *",
        "*HKLM*",
        "*HKCU*",
        "*HKCU\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\reg.exe\" and (process.command_line:\"* query *\" and process.command_line:\"*/t *\" and process.command_line:\"*REG_SZ*\" and process.command_line:\"*/s*\")) and ((process.command_line:\"*/f *\" and process.command_line:\"*HKLM*\") or (process.command_line:\"*/f *\" and process.command_line:\"*HKCU*\") or process.command_line:\"*HKCU\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_reg_enumeration_for_credentials_in_registry.eql",
  "metadata": {}
}