{
  "id": "5356e377-c6f3-5142-ae5a-f1eaa427780d",
  "catalog": "sigma",
  "name": "proc_creation_win_lolbin_susp_driver_installed_by_pnputil",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1547"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "install",
        "add-driver",
        ".inf"
      ],
      "raw_values": [
        "*-i*",
        "*/install*",
        "*-a*",
        "*/add-driver*",
        "*.inf*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "pnputil.exe"
      ],
      "raw_values": [
        "*\\\\pnputil.exe"
      ]
    }
  ],
  "raw_query": "any where (process.command_line like~ (\"*-i*\", \"*/install*\", \"*-a*\", \"*/add-driver*\", \"*.inf*\")) and process.executable:\"*\\\\pnputil.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_lolbin_susp_driver_installed_by_pnputil.eql",
  "metadata": {}
}