{
  "id": "55c92380-b535-52dc-abaa-0044b68b7dd5",
  "catalog": "sigma",
  "name": "proc_creation_win_dotnetdump_memory_dump",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dotnet-dump.exe"
      ],
      "raw_values": [
        "*\\\\dotnet-dump.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "dotnet-dump.dll"
      ],
      "raw_values": [
        "dotnet-dump.dll"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "collect"
      ],
      "raw_values": [
        "*collect*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\dotnet-dump.exe\" or process.pe.original_file_name:\"dotnet-dump.dll\") and process.command_line:\"*collect*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_dotnetdump_memory_dump.eql",
  "metadata": {}
}