{
  "id": "58534bab-89c2-5fbe-93ac-c1de0dc626c0",
  "catalog": "sigma",
  "name": "win_system_powershell_script_installed_as_service",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": "like~",
      "values": [
        "powershell",
        "pwsh"
      ],
      "raw_values": [
        "*powershell*",
        "*pwsh*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and (winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\" and (winlog.event_data.ImagePath like~ (\"*powershell*\", \"*pwsh*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/system/service_control_manager/win_system_powershell_script_installed_as_service.eql",
  "metadata": {}
}