{
  "id": "5afd2521-28c6-5d65-94d5-442fd88da955",
  "catalog": "sigma",
  "name": "proc_creation_win_renamed_boinc",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1553"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "boinc.exe"
      ],
      "raw_values": [
        "BOINC.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "boinc.exe"
      ],
      "raw_values": [
        "*\\\\BOINC.exe"
      ]
    }
  ],
  "raw_query": "any where process.pe.original_file_name:\"BOINC.exe\" and (not process.executable:\"*\\\\BOINC.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_renamed_boinc.eql",
  "metadata": {}
}