{
  "id": "5c31d3a3-fe0b-56e7-9bf8-943b0a0518f0",
  "catalog": "sigma",
  "name": "win_security_overpass_the_hash",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1550.002"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4624"
      ],
      "raw_values": [
        "4624"
      ]
    },
    {
      "field": "winlog.event_data.logonprocessname",
      "raw_field": "winlog.event_data.LogonProcessName",
      "operator": ":",
      "values": [
        "seclogo"
      ],
      "raw_values": [
        "seclogo"
      ]
    },
    {
      "field": "winlog.event_data.authenticationpackagename",
      "raw_field": "winlog.event_data.AuthenticationPackageName",
      "operator": ":",
      "values": [
        "negotiate"
      ],
      "raw_values": [
        "Negotiate"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4624\" and winlog.event_data.LogonType:\"9\" and winlog.event_data.LogonProcessName:\"seclogo\" and winlog.event_data.AuthenticationPackageName:\"Negotiate\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/account_management/win_security_overpass_the_hash.eql",
  "metadata": {}
}