{
  "id": "5ca2ca5b-831c-5d5e-9086-bbc1b043c774",
  "catalog": "sigma",
  "name": "win_system_kdcsvc_cert_use_no_strong_mapping",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": "like~",
      "values": [
        "kerberos-key-distribution-center",
        "microsoft-windows-kerberos-key-distribution-center"
      ],
      "raw_values": [
        "Kerberos-Key-Distribution-Center",
        "Microsoft-Windows-Kerberos-Key-Distribution-Center"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and ((winlog.provider_name like~ (\"Kerberos-Key-Distribution-Center\", \"Microsoft-Windows-Kerberos-Key-Distribution-Center\")) and (event.code like~ (\"39\", \"41\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/system/microsoft_windows_kerberos_key_distribution_center/win_system_kdcsvc_cert_use_no_strong_mapping.eql",
  "metadata": {}
}