{
  "id": "5ce6fdd3-ec2f-53c3-b3a7-b44ac241d8b0",
  "catalog": "sigma",
  "name": "Scheduled Task Creation via Schtasks",
  "description": "Detects creation of scheduled tasks via schtasks.exe",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1053.005"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "Image",
      "operator": "==",
      "values": [
        "schtasks.exe"
      ],
      "raw_values": [
        "schtasks.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "CommandLine",
      "operator": "like~",
      "values": [
        "*/create*"
      ],
      "raw_values": [
        "*/create*"
      ]
    }
  ],
  "raw_query": "process where process.name == \"schtasks.exe\" and process.command_line like~ \"*/create*\"",
  "language": "sigma",
  "translated_query": "process where process.name == \"schtasks.exe\" and process.command_line like~ \"*/create*\"",
  "source_path": "demo",
  "metadata": {}
}