{
  "id": "5f7a5917-9522-5a91-82c8-965b0d55e91f",
  "catalog": "sigma",
  "name": "proc_access_win_susp_direct_ntopenprocess_call",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1106"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.calltrace",
      "raw_field": "winlog.event_data.CallTrace",
      "operator": ":",
      "values": [
        "unknown"
      ],
      "raw_values": [
        "UNKNOWN*"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": ":",
      "values": [
        "vcredist_x64.exe",
        ":\\\\windows\\\\system32\\\\systeminfo.exe",
        ":\\\\program files\\\\cylance\\\\desktop\\\\cylanceui.exe",
        "amazonssmagentsetup.exe",
        "\\\\appdata\\\\local\\\\programs\\\\microsoft vs code\\\\code.exe",
        "\\\\appdata\\\\local\\\\microsoft\\\\teams\\\\current\\\\teams.exe",
        "\\\\appdata\\\\local\\\\discord\\\\",
        "\\\\discord.exe",
        "\\\\appdata\\\\local\\\\yammerdesktop\\\\app-",
        "\\\\yammer.exe",
        "\\\\evernote\\\\evernote.exe",
        ":\\\\program files\\\\adobe\\\\acrobat dc\\\\acrobat\\\\",
        "\\\\acrocef.exe"
      ],
      "raw_values": [
        "*vcredist_x64.exe",
        "*:\\\\Windows\\\\system32\\\\systeminfo.exe",
        "*:\\\\Program Files\\\\Cylance\\\\Desktop\\\\CylanceUI.exe",
        "*AmazonSSMAgentSetup.exe",
        "*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe",
        "*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe",
        "*\\\\AppData\\\\Local\\\\Discord\\\\*",
        "*\\\\Discord.exe",
        "*\\\\AppData\\\\Local\\\\yammerdesktop\\\\app-*",
        "*\\\\Yammer.exe",
        "*\\\\Evernote\\\\Evernote.exe",
        "*:\\\\Program Files\\\\Adobe\\\\Acrobat DC\\\\Acrobat\\\\*",
        "*\\\\AcroCEF.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vcredist_x64.exe",
        "setup64.exe",
        "explorer.exe",
        "amazonssmagentsetup.exe",
        "code.exe",
        "teams.exe",
        "app-",
        "yammer.exe",
        "acrocef.exe"
      ],
      "raw_values": [
        "*vcredist_x64.exe",
        "*setup64.exe",
        "*:\\\\Windows\\\\Explorer.EXE",
        "*AmazonSSMAgentSetup.exe",
        "*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe",
        "*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe",
        "*\\\\AppData\\\\Local\\\\yammerdesktop\\\\app-*",
        "*\\\\Yammer.exe",
        "*:\\\\Program Files\\\\Adobe\\\\Acrobat DC\\\\Acrobat\\\\*",
        "*\\\\AcroCEF.exe"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "microsoft-windows-kernel-audit-api-calls"
      ],
      "raw_values": [
        "Microsoft-Windows-Kernel-Audit-API-Calls"
      ]
    },
    {
      "field": "winlog.event_data.grantedaccess",
      "raw_field": "winlog.event_data.GrantedAccess",
      "operator": ":",
      "values": [
        "0x1000"
      ],
      "raw_values": [
        "0x1000"
      ]
    }
  ],
  "raw_query": "any where winlog.event_data.CallTrace:\"UNKNOWN*\" and (not ((winlog.event_data.TargetImage:\"*vcredist_x64.exe\" and process.executable:\"*vcredist_x64.exe\") or ((process.executable like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\", \"*:\\\\Windows\\\\WinSxS\\\\*\")) and (winlog.event_data.TargetImage like~ (\"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\System32\\\\*\", \"*:\\\\Windows\\\\SysWOW64\\\\*\", \"*:\\\\Windows\\\\WinSxS\\\\*\"))) or winlog.provider_name:\"Microsoft-Windows-Kernel-Audit-API-Calls\")) and (not ((winlog.event_data.TargetImage:\"*:\\\\Windows\\\\system32\\\\systeminfo.exe\" and process.executable:\"*setup64.exe\") or (process.executable:\"*:\\\\Windows\\\\Explorer.EXE\" and winlog.event_data.TargetImage:\"*:\\\\Program Files\\\\Cylance\\\\Desktop\\\\CylanceUI.exe\") or (process.executable:\"*AmazonSSMAgentSetup.exe\" and winlog.event_data.TargetImage:\"*AmazonSSMAgentSetup.exe\") or (process.executable:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\" and winlog.event_data.TargetImage:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\") or (winlog.event_data.TargetImage:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and process.executable:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\") or (winlog.event_data.TargetImage:\"*\\\\AppData\\\\Local\\\\Discord\\\\*\" and winlog.event_data.TargetImage:\"*\\\\Discord.exe\") or (process.executable:\"*\\\\AppData\\\\Local\\\\yammerdesktop\\\\app-*\" and process.executable:\"*\\\\Yammer.exe\" and winlog.event_data.TargetImage:\"*\\\\AppData\\\\Local\\\\yammerdesktop\\\\app-*\" and winlog.event_data.TargetImage:\"*\\\\Yammer.exe\" and winlog.event_data.GrantedAccess:\"0x1000\") or winlog.event_data.TargetImage:\"*\\\\Evernote\\\\Evernote.exe\" or (process.executable:\"*:\\\\Program Files\\\\Adobe\\\\Acrobat DC\\\\Acrobat\\\\*\" and process.executable:\"*\\\\AcroCEF.exe\" and winlog.event_data.TargetImage:\"*:\\\\Program Files\\\\Adobe\\\\Acrobat DC\\\\Acrobat\\\\*\" and winlog.event_data.TargetImage:\"*\\\\AcroCEF.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_access/proc_access_win_susp_direct_ntopenprocess_call.eql",
  "metadata": {}
}