{
  "id": "60309785-5b70-57f5-ad4b-e154f7ea84ee",
  "catalog": "sigma",
  "name": "proc_creation_win_hktl_hashcat",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1110.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "hashcat.exe"
      ],
      "raw_values": [
        "*\\\\hashcat.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "-m 1000"
      ],
      "raw_values": [
        "*-a *",
        "*-m 1000 *",
        "*-r *"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\hashcat.exe\" or (process.command_line:\"*-a *\" and process.command_line:\"*-m 1000 *\" and process.command_line:\"*-r *\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hktl_hashcat.eql",
  "metadata": {}
}