{
  "id": "61498dc4-324a-5ea3-a165-23b255ba7c1a",
  "catalog": "sigma",
  "name": "proc_creation_win_lsass_process_clone",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1003",
    "attack.t1003.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "lsass.exe"
      ],
      "raw_values": [
        "*\\\\Windows\\\\System32\\\\lsass.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "lsass.exe"
      ],
      "raw_values": [
        "*\\\\Windows\\\\System32\\\\lsass.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\Windows\\\\System32\\\\lsass.exe\" and process.executable:\"*\\\\Windows\\\\System32\\\\lsass.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_lsass_process_clone.eql",
  "metadata": {}
}