{
  "id": "631cf39f-bf6f-5287-8c3a-17f318a410a5",
  "catalog": "sigma",
  "name": "proc_creation_win_powershell_webclient_casing",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.dll"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "tgblafqalgb3aeuaqg",
        "4azqbuac4adwbfaeia",
        "oaguavaauahcarqbca",
        "bgbfahqalgb3aguayg",
        "4arqb0ac4adwblagia",
        "uaeuadaauahcazqbia",
        "tgbfahqalgb3aguayg",
        "oaeuadaauahcazqbia",
        "bgblafqalgb3aguayg",
        "4azqbuac4adwblagia",
        "uaguavaauahcazqbia",
        "tgblafqalgb3aguayg",
        "oaguavaauahcazqbia",
        "bgbfafqalgb3aguayg",
        "4arqbuac4adwblagia",
        "uaeuavaauahcazqbia",
        "bgblahqalgbxaguayg",
        "4azqb0ac4avwblagia",
        "uaguadaauafcazqbia",
        "bgbfahqalgbxaguayg",
        "4arqb0ac4avwblagia",
        "uaeuadaauafcazqbia",
        "tgbfahqalgbxaguayg",
        "oaeuadaauafcazqbia",
        "bgblafqalgbxaguayg",
        "4azqbuac4avwblagia",
        "uaguavaauafcazqbia",
        "tgblafqalgbxaguayg",
        "oaguavaauafcazqbia",
        "bgbfafqalgbxaguayg",
        "4arqbuac4avwblagia",
        "uaeuavaauafcazqbia",
        "bgblahqalgb3aeuayg",
        "4azqb0ac4adwbfagia",
        "uaguadaauahcarqbia",
        "tgblahqalgb3aeuayg",
        "oaguadaauahcarqbia",
        "bgbfahqalgb3aeuayg",
        "4arqb0ac4adwbfagia",
        "uaeuadaauahcarqbia",
        "tgbfahqalgb3aeuayg",
        "oaeuadaauahcarqbia",
        "bgblafqalgb3aeuayg",
        "4azqbuac4adwbfagia",
        "uaguavaauahcarqbia",
        "tgblafqalgb3aeuayg",
        "oaguavaauahcarqbia",
        "bgbfafqalgb3aeuayg",
        "4arqbuac4adwbfagia",
        "uaeuavaauahcarqbia",
        "tgbfafqalgb3aeuayg",
        "oaeuavaauahcarqbia",
        "bgblahqalgbxaeuayg",
        "4azqb0ac4avwbfagia",
        "uaguadaauafcarqbia",
        "tgblahqalgbxaeuayg",
        "oaguadaauafcarqbia",
        "bgbfahqalgbxaeuayg",
        "4arqb0ac4avwbfagia",
        "uaeuadaauafcarqbia",
        "tgbfahqalgbxaeuayg",
        "oaeuadaauafcarqbia",
        "bgblafqalgbxaeuayg",
        "4azqbuac4avwbfagia",
        "uaguavaauafcarqbia",
        "tgblafqalgbxaeuayg",
        "oaguavaauafcarqbia",
        "bgbfafqalgbxaeuayg",
        "4arqbuac4avwbfagia",
        "uaeuavaauafcarqbia",
        "tgbfafqalgbxaeuayg",
        "oaeuavaauafcarqbia",
        "bgblahqalgb3aguaqg",
        "4azqb0ac4adwblaeia",
        "uaguadaauahcazqbca",
        "tgblahqalgb3aguaqg",
        "oaguadaauahcazqbca",
        "bgbfahqalgb3aguaqg",
        "4arqb0ac4adwblaeia",
        "uaeuadaauahcazqbca",
        "tgbfahqalgb3aguaqg",
        "oaeuadaauahcazqbca",
        "bgblafqalgb3aguaqg",
        "4azqbuac4adwblaeia",
        "uaguavaauahcazqbca",
        "tgblafqalgb3aguaqg",
        "oaguavaauahcazqbca",
        "bgbfafqalgb3aguaqg",
        "4arqbuac4adwblaeia",
        "uaeuavaauahcazqbca",
        "tgbfafqalgb3aguaqg",
        "oaeuavaauahcazqbca",
        "bgblahqalgbxaguaqg",
        "4azqb0ac4avwblaeia",
        "uaguadaauafcazqbca",
        "tgblahqalgbxaguaqg",
        "oaguadaauafcazqbca",
        "bgbfahqalgbxaguaqg",
        "4arqb0ac4avwblaeia",
        "uaeuadaauafcazqbca",
        "tgbfahqalgbxaguaqg",
        "oaeuadaauafcazqbca",
        "bgblafqalgbxaguaqg",
        "4azqbuac4avwblaeia",
        "uaguavaauafcazqbca",
        "tgblafqalgbxaguaqg",
        "oaguavaauafcazqbca",
        "bgbfafqalgbxaguaqg",
        "4arqbuac4avwblaeia",
        "uaeuavaauafcazqbca",
        "tgbfafqalgbxaguaqg",
        "oaeuavaauafcazqbca",
        "bgblahqalgb3aeuaqg",
        "4azqb0ac4adwbfaeia",
        "uaguadaauahcarqbca",
        "tgblahqalgb3aeuaqg",
        "oaguadaauahcarqbca",
        "bgbfahqalgb3aeuaqg",
        "4arqb0ac4adwbfaeia",
        "uaeuadaauahcarqbca",
        "tgbfahqalgb3aeuaqg",
        "oaeuadaauahcarqbca",
        "bgblafqalgb3aeuaqg",
        "uaguavaauahcarqbca",
        "bgbfafqalgb3aeuaqg",
        "4arqbuac4adwbfaeia",
        "uaeuavaauahcarqbca",
        "tgbfafqalgb3aeuaqg",
        "oaeuavaauahcarqbca",
        "tgblahqalgbxaeuaqg",
        "4azqb0ac4avwbfaeia",
        "oaguadaauafcarqbca",
        "bgbfahqalgbxaeuaqg",
        "4arqb0ac4avwbfaeia",
        "uaeuadaauafcarqbca",
        "tgbfahqalgbxaeuaqg",
        "oaeuadaauafcarqbca",
        "bgblafqalgbxaeuaqg",
        "4azqbuac4avwbfaeia",
        "uaguavaauafcarqbca",
        "tgblafqalgbxaeuaqg",
        "oaguavaauafcarqbca",
        "bgbfafqalgbxaeuaqg",
        "4arqbuac4avwbfaeia",
        "uaeuavaauafcarqbca"
      ],
      "raw_values": [
        "*TgBlAFQALgB3AEUAQg*",
        "*4AZQBUAC4AdwBFAEIA*",
        "*OAGUAVAAuAHcARQBCA*",
        "*bgBFAHQALgB3AGUAYg*",
        "*4ARQB0AC4AdwBlAGIA*",
        "*uAEUAdAAuAHcAZQBiA*",
        "*TgBFAHQALgB3AGUAYg*",
        "*OAEUAdAAuAHcAZQBiA*",
        "*bgBlAFQALgB3AGUAYg*",
        "*4AZQBUAC4AdwBlAGIA*",
        "*uAGUAVAAuAHcAZQBiA*",
        "*TgBlAFQALgB3AGUAYg*",
        "*OAGUAVAAuAHcAZQBiA*",
        "*bgBFAFQALgB3AGUAYg*",
        "*4ARQBUAC4AdwBlAGIA*",
        "*uAEUAVAAuAHcAZQBiA*",
        "*bgBlAHQALgBXAGUAYg*",
        "*4AZQB0AC4AVwBlAGIA*",
        "*uAGUAdAAuAFcAZQBiA*",
        "*bgBFAHQALgBXAGUAYg*",
        "*4ARQB0AC4AVwBlAGIA*",
        "*uAEUAdAAuAFcAZQBiA*",
        "*TgBFAHQALgBXAGUAYg*",
        "*OAEUAdAAuAFcAZQBiA*",
        "*bgBlAFQALgBXAGUAYg*",
        "*4AZQBUAC4AVwBlAGIA*",
        "*uAGUAVAAuAFcAZQBiA*",
        "*TgBlAFQALgBXAGUAYg*",
        "*OAGUAVAAuAFcAZQBiA*",
        "*bgBFAFQALgBXAGUAYg*",
        "*4ARQBUAC4AVwBlAGIA*",
        "*uAEUAVAAuAFcAZQBiA*",
        "*bgBlAHQALgB3AEUAYg*",
        "*4AZQB0AC4AdwBFAGIA*",
        "*uAGUAdAAuAHcARQBiA*",
        "*TgBlAHQALgB3AEUAYg*",
        "*OAGUAdAAuAHcARQBiA*",
        "*bgBFAHQALgB3AEUAYg*",
        "*4ARQB0AC4AdwBFAGIA*",
        "*uAEUAdAAuAHcARQBiA*",
        "*TgBFAHQALgB3AEUAYg*",
        "*OAEUAdAAuAHcARQBiA*",
        "*bgBlAFQALgB3AEUAYg*",
        "*4AZQBUAC4AdwBFAGIA*",
        "*uAGUAVAAuAHcARQBiA*",
        "*TgBlAFQALgB3AEUAYg*",
        "*OAGUAVAAuAHcARQBiA*",
        "*bgBFAFQALgB3AEUAYg*",
        "*4ARQBUAC4AdwBFAGIA*",
        "*uAEUAVAAuAHcARQBiA*",
        "*TgBFAFQALgB3AEUAYg*",
        "*OAEUAVAAuAHcARQBiA*",
        "*bgBlAHQALgBXAEUAYg*",
        "*4AZQB0AC4AVwBFAGIA*",
        "*uAGUAdAAuAFcARQBiA*",
        "*TgBlAHQALgBXAEUAYg*",
        "*OAGUAdAAuAFcARQBiA*",
        "*bgBFAHQALgBXAEUAYg*",
        "*4ARQB0AC4AVwBFAGIA*",
        "*uAEUAdAAuAFcARQBiA*",
        "*TgBFAHQALgBXAEUAYg*",
        "*OAEUAdAAuAFcARQBiA*",
        "*bgBlAFQALgBXAEUAYg*",
        "*4AZQBUAC4AVwBFAGIA*",
        "*uAGUAVAAuAFcARQBiA*",
        "*TgBlAFQALgBXAEUAYg*",
        "*OAGUAVAAuAFcARQBiA*",
        "*bgBFAFQALgBXAEUAYg*",
        "*4ARQBUAC4AVwBFAGIA*",
        "*uAEUAVAAuAFcARQBiA*",
        "*TgBFAFQALgBXAEUAYg*",
        "*OAEUAVAAuAFcARQBiA*",
        "*bgBlAHQALgB3AGUAQg*",
        "*4AZQB0AC4AdwBlAEIA*",
        "*uAGUAdAAuAHcAZQBCA*",
        "*TgBlAHQALgB3AGUAQg*",
        "*OAGUAdAAuAHcAZQBCA*",
        "*bgBFAHQALgB3AGUAQg*",
        "*4ARQB0AC4AdwBlAEIA*",
        "*uAEUAdAAuAHcAZQBCA*",
        "*TgBFAHQALgB3AGUAQg*",
        "*OAEUAdAAuAHcAZQBCA*",
        "*bgBlAFQALgB3AGUAQg*",
        "*4AZQBUAC4AdwBlAEIA*",
        "*uAGUAVAAuAHcAZQBCA*",
        "*TgBlAFQALgB3AGUAQg*",
        "*OAGUAVAAuAHcAZQBCA*",
        "*bgBFAFQALgB3AGUAQg*",
        "*4ARQBUAC4AdwBlAEIA*",
        "*uAEUAVAAuAHcAZQBCA*",
        "*TgBFAFQALgB3AGUAQg*",
        "*OAEUAVAAuAHcAZQBCA*",
        "*bgBlAHQALgBXAGUAQg*",
        "*4AZQB0AC4AVwBlAEIA*",
        "*uAGUAdAAuAFcAZQBCA*",
        "*TgBlAHQALgBXAGUAQg*",
        "*OAGUAdAAuAFcAZQBCA*",
        "*bgBFAHQALgBXAGUAQg*",
        "*4ARQB0AC4AVwBlAEIA*",
        "*uAEUAdAAuAFcAZQBCA*",
        "*TgBFAHQALgBXAGUAQg*",
        "*OAEUAdAAuAFcAZQBCA*",
        "*bgBlAFQALgBXAGUAQg*",
        "*4AZQBUAC4AVwBlAEIA*",
        "*uAGUAVAAuAFcAZQBCA*",
        "*TgBlAFQALgBXAGUAQg*",
        "*OAGUAVAAuAFcAZQBCA*",
        "*bgBFAFQALgBXAGUAQg*",
        "*4ARQBUAC4AVwBlAEIA*",
        "*uAEUAVAAuAFcAZQBCA*",
        "*TgBFAFQALgBXAGUAQg*",
        "*OAEUAVAAuAFcAZQBCA*",
        "*bgBlAHQALgB3AEUAQg*",
        "*4AZQB0AC4AdwBFAEIA*",
        "*uAGUAdAAuAHcARQBCA*",
        "*TgBlAHQALgB3AEUAQg*",
        "*OAGUAdAAuAHcARQBCA*",
        "*bgBFAHQALgB3AEUAQg*",
        "*4ARQB0AC4AdwBFAEIA*",
        "*uAEUAdAAuAHcARQBCA*",
        "*TgBFAHQALgB3AEUAQg*",
        "*OAEUAdAAuAHcARQBCA*",
        "*bgBlAFQALgB3AEUAQg*",
        "*uAGUAVAAuAHcARQBCA*",
        "*bgBFAFQALgB3AEUAQg*",
        "*4ARQBUAC4AdwBFAEIA*",
        "*uAEUAVAAuAHcARQBCA*",
        "*TgBFAFQALgB3AEUAQg*",
        "*OAEUAVAAuAHcARQBCA*",
        "*TgBlAHQALgBXAEUAQg*",
        "*4AZQB0AC4AVwBFAEIA*",
        "*OAGUAdAAuAFcARQBCA*",
        "*bgBFAHQALgBXAEUAQg*",
        "*4ARQB0AC4AVwBFAEIA*",
        "*uAEUAdAAuAFcARQBCA*",
        "*TgBFAHQALgBXAEUAQg*",
        "*OAEUAdAAuAFcARQBCA*",
        "*bgBlAFQALgBXAEUAQg*",
        "*4AZQBUAC4AVwBFAEIA*",
        "*uAGUAVAAuAFcARQBCA*",
        "*TgBlAFQALgBXAEUAQg*",
        "*OAGUAVAAuAFcARQBCA*",
        "*bgBFAFQALgBXAEUAQg*",
        "*4ARQBUAC4AVwBFAEIA*",
        "*uAEUAVAAuAFcARQBCA*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) or (process.pe.original_file_name like~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (process.command_line like~ (\"*TgBlAFQALgB3AEUAQg*\", \"*4AZQBUAC4AdwBFAEIA*\", \"*OAGUAVAAuAHcARQBCA*\", \"*bgBFAHQALgB3AGUAYg*\", \"*4ARQB0AC4AdwBlAGIA*\", \"*uAEUAdAAuAHcAZQBiA*\", \"*TgBFAHQALgB3AGUAYg*\", \"*OAEUAdAAuAHcAZQBiA*\", \"*bgBlAFQALgB3AGUAYg*\", \"*4AZQBUAC4AdwBlAGIA*\", \"*uAGUAVAAuAHcAZQBiA*\", \"*TgBlAFQALgB3AGUAYg*\", \"*OAGUAVAAuAHcAZQBiA*\", \"*bgBFAFQALgB3AGUAYg*\", \"*4ARQBUAC4AdwBlAGIA*\", \"*uAEUAVAAuAHcAZQBiA*\", \"*bgBlAHQALgBXAGUAYg*\", \"*4AZQB0AC4AVwBlAGIA*\", \"*uAGUAdAAuAFcAZQBiA*\", \"*bgBFAHQALgBXAGUAYg*\", \"*4ARQB0AC4AVwBlAGIA*\", \"*uAEUAdAAuAFcAZQBiA*\", \"*TgBFAHQALgBXAGUAYg*\", \"*OAEUAdAAuAFcAZQBiA*\", \"*bgBlAFQALgBXAGUAYg*\", \"*4AZQBUAC4AVwBlAGIA*\", \"*uAGUAVAAuAFcAZQBiA*\", \"*TgBlAFQALgBXAGUAYg*\", \"*OAGUAVAAuAFcAZQBiA*\", \"*bgBFAFQALgBXAGUAYg*\", \"*4ARQBUAC4AVwBlAGIA*\", \"*uAEUAVAAuAFcAZQBiA*\", \"*bgBlAHQALgB3AEUAYg*\", \"*4AZQB0AC4AdwBFAGIA*\", \"*uAGUAdAAuAHcARQBiA*\", \"*TgBlAHQALgB3AEUAYg*\", \"*OAGUAdAAuAHcARQBiA*\", \"*bgBFAHQALgB3AEUAYg*\", \"*4ARQB0AC4AdwBFAGIA*\", \"*uAEUAdAAuAHcARQBiA*\", \"*TgBFAHQALgB3AEUAYg*\", \"*OAEUAdAAuAHcARQBiA*\", \"*bgBlAFQALgB3AEUAYg*\", \"*4AZQBUAC4AdwBFAGIA*\", \"*uAGUAVAAuAHcARQBiA*\", \"*TgBlAFQALgB3AEUAYg*\", \"*OAGUAVAAuAHcARQBiA*\", \"*bgBFAFQALgB3AEUAYg*\", \"*4ARQBUAC4AdwBFAGIA*\", \"*uAEUAVAAuAHcARQBiA*\", \"*TgBFAFQALgB3AEUAYg*\", \"*OAEUAVAAuAHcARQBiA*\", \"*bgBlAHQALgBXAEUAYg*\", \"*4AZQB0AC4AVwBFAGIA*\", \"*uAGUAdAAuAFcARQBiA*\", \"*TgBlAHQALgBXAEUAYg*\", \"*OAGUAdAAuAFcARQBiA*\", \"*bgBFAHQALgBXAEUAYg*\", \"*4ARQB0AC4AVwBFAGIA*\", \"*uAEUAdAAuAFcARQBiA*\", \"*TgBFAHQALgBXAEUAYg*\", \"*OAEUAdAAuAFcARQBiA*\", \"*bgBlAFQALgBXAEUAYg*\", \"*4AZQBUAC4AVwBFAGIA*\", \"*uAGUAVAAuAFcARQBiA*\", \"*TgBlAFQALgBXAEUAYg*\", \"*OAGUAVAAuAFcARQBiA*\", \"*bgBFAFQALgBXAEUAYg*\", \"*4ARQBUAC4AVwBFAGIA*\", \"*uAEUAVAAuAFcARQBiA*\", \"*TgBFAFQALgBXAEUAYg*\", \"*OAEUAVAAuAFcARQBiA*\", \"*bgBlAHQALgB3AGUAQg*\", \"*4AZQB0AC4AdwBlAEIA*\", \"*uAGUAdAAuAHcAZQBCA*\", \"*TgBlAHQALgB3AGUAQg*\", \"*OAGUAdAAuAHcAZQBCA*\", \"*bgBFAHQALgB3AGUAQg*\", \"*4ARQB0AC4AdwBlAEIA*\", \"*uAEUAdAAuAHcAZQBCA*\", \"*TgBFAHQALgB3AGUAQg*\", \"*OAEUAdAAuAHcAZQBCA*\", \"*bgBlAFQALgB3AGUAQg*\", \"*4AZQBUAC4AdwBlAEIA*\", \"*uAGUAVAAuAHcAZQBCA*\", \"*TgBlAFQALgB3AGUAQg*\", \"*OAGUAVAAuAHcAZQBCA*\", \"*bgBFAFQALgB3AGUAQg*\", \"*4ARQBUAC4AdwBlAEIA*\", \"*uAEUAVAAuAHcAZQBCA*\", \"*TgBFAFQALgB3AGUAQg*\", \"*OAEUAVAAuAHcAZQBCA*\", \"*bgBlAHQALgBXAGUAQg*\", \"*4AZQB0AC4AVwBlAEIA*\", \"*uAGUAdAAuAFcAZQBCA*\", \"*TgBlAHQALgBXAGUAQg*\", \"*OAGUAdAAuAFcAZQBCA*\", \"*bgBFAHQALgBXAGUAQg*\", \"*4ARQB0AC4AVwBlAEIA*\", \"*uAEUAdAAuAFcAZQBCA*\", \"*TgBFAHQALgBXAGUAQg*\", \"*OAEUAdAAuAFcAZQBCA*\", \"*bgBlAFQALgBXAGUAQg*\", \"*4AZQBUAC4AVwBlAEIA*\", \"*uAGUAVAAuAFcAZQBCA*\", \"*TgBlAFQALgBXAGUAQg*\", \"*OAGUAVAAuAFcAZQBCA*\", \"*bgBFAFQALgBXAGUAQg*\", \"*4ARQBUAC4AVwBlAEIA*\", \"*uAEUAVAAuAFcAZQBCA*\", \"*TgBFAFQALgBXAGUAQg*\", \"*OAEUAVAAuAFcAZQBCA*\", \"*bgBlAHQALgB3AEUAQg*\", \"*4AZQB0AC4AdwBFAEIA*\", \"*uAGUAdAAuAHcARQBCA*\", \"*TgBlAHQALgB3AEUAQg*\", \"*OAGUAdAAuAHcARQBCA*\", \"*bgBFAHQALgB3AEUAQg*\", \"*4ARQB0AC4AdwBFAEIA*\", \"*uAEUAdAAuAHcARQBCA*\", \"*TgBFAHQALgB3AEUAQg*\", \"*OAEUAdAAuAHcARQBCA*\", \"*bgBlAFQALgB3AEUAQg*\", \"*uAGUAVAAuAHcARQBCA*\", \"*bgBFAFQALgB3AEUAQg*\", \"*4ARQBUAC4AdwBFAEIA*\", \"*uAEUAVAAuAHcARQBCA*\", \"*TgBFAFQALgB3AEUAQg*\", \"*OAEUAVAAuAHcARQBCA*\", \"*TgBlAHQALgBXAEUAQg*\", \"*4AZQB0AC4AVwBFAEIA*\", \"*OAGUAdAAuAFcARQBCA*\", \"*bgBFAHQALgBXAEUAQg*\", \"*4ARQB0AC4AVwBFAEIA*\", \"*uAEUAdAAuAFcARQBCA*\", \"*TgBFAHQALgBXAEUAQg*\", \"*OAEUAdAAuAFcARQBCA*\", \"*bgBlAFQALgBXAEUAQg*\", \"*4AZQBUAC4AVwBFAEIA*\", \"*uAGUAVAAuAFcARQBCA*\", \"*TgBlAFQALgBXAEUAQg*\", \"*OAGUAVAAuAFcARQBCA*\", \"*bgBFAFQALgBXAEUAQg*\", \"*4ARQBUAC4AVwBFAEIA*\", \"*uAEUAVAAuAFcARQBCA*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_powershell_webclient_casing.eql",
  "metadata": {}
}