{
  "id": "643d477e-4f6b-5d37-8304-7a1604ba8253",
  "catalog": "sigma",
  "name": "proc_creation_win_pua_wsudo_susp_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-u system",
        "-usystem",
        "-u trustedinstaller",
        "-utrustedinstaller",
        "--ti"
      ],
      "raw_values": [
        "*-u System*",
        "*-uSystem*",
        "*-u TrustedInstaller*",
        "*-uTrustedInstaller*",
        "* --ti *"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wsudo.exe"
      ],
      "raw_values": [
        "*\\\\wsudo.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wsudo.exe"
      ],
      "raw_values": [
        "wsudo.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "windows sudo utility"
      ],
      "raw_values": [
        "Windows sudo utility"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "wsudo-bridge.exe"
      ],
      "raw_values": [
        "*\\\\wsudo-bridge.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\wsudo.exe\" or process.pe.original_file_name:\"wsudo.exe\" or process.pe.description:\"Windows sudo utility\" or process.parent.executable:\"*\\\\wsudo-bridge.exe\") or (process.command_line like~ (\"*-u System*\", \"*-uSystem*\", \"*-u TrustedInstaller*\", \"*-uTrustedInstaller*\", \"* --ti *\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_pua_wsudo_susp_execution.eql",
  "metadata": {}
}