{
  "id": "65cee7b7-8e89-555c-a98b-9ffeb5a91dfe",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_guloader_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "chrome.exe",
        "firefox.exe",
        "msedge.exe"
      ],
      "raw_values": [
        "*\\\\chrome.exe",
        "*\\\\firefox.exe",
        "*\\\\msedge.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable like~ (\"*\\\\chrome.exe\", \"*\\\\firefox.exe\", \"*\\\\msedge.exe\")) and process.executable:\"*\\\\rundll32.exe\" and process.command_line:\"*\\\\rundll32.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Malware/GuLoader/proc_creation_win_malware_guloader_execution.eql",
  "metadata": {}
}