{
  "id": "67bb4fc1-707e-5c7c-b670-4dad99162335",
  "catalog": "sigma",
  "name": "proc_creation_win_format_uncommon_filesystem_load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "fs:exfat",
        "fs:fat",
        "fs:ntfs",
        "fs:refs",
        "fs:udf"
      ],
      "raw_values": [
        "*/fs:exFAT*",
        "*/fs:FAT*",
        "*/fs:NTFS*",
        "*/fs:ReFS*",
        "*/fs:UDF*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "format.com"
      ],
      "raw_values": [
        "*\\\\format.com"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "fs:"
      ],
      "raw_values": [
        "*/fs:*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\format.com\" and process.command_line:\"*/fs:*\") and (not (process.command_line like~ (\"*/fs:exFAT*\", \"*/fs:FAT*\", \"*/fs:NTFS*\", \"*/fs:ReFS*\", \"*/fs:UDF*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_format_uncommon_filesystem_load.eql",
  "metadata": {}
}