{
  "id": "68597ef0-22c8-5d24-b971-7968d6af91c6",
  "catalog": "sigma",
  "name": "proc_creation_win_regsvr32_uncommon_extension",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".ax",
        ".cpl",
        ".dll",
        ".ocx",
        ".ppl",
        ".bav"
      ],
      "raw_values": [
        "*.ax*",
        "*.cpl*",
        "*.dll*",
        "*.ocx*",
        "*.ppl*",
        "*.bav*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "regsvr32.exe"
      ],
      "raw_values": [
        "*\\\\regsvr32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "regsvr32.exe"
      ],
      "raw_values": [
        "REGSVR32.EXE"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\regsvr32.exe\" or process.pe.original_file_name:\"REGSVR32.EXE\") and (not ((process.command_line like~ (\"*.ax*\", \"*.cpl*\", \"*.dll*\", \"*.ocx*\")) or (?process.command_line == null) or process.command_line==\"\")) and (not (process.command_line like~ (\"*.ppl*\", \"*.bav*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_regsvr32_uncommon_extension.eql",
  "metadata": {}
}