{
  "id": "68ce10c1-23ab-5826-b7f2-8b5cb1fdfdc2",
  "catalog": "sigma",
  "name": "proc_creation_win_odbcconf_driver_install",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.008"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "odbcconf.exe"
      ],
      "raw_values": [
        "*\\\\odbcconf.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "odbcconf.exe"
      ],
      "raw_values": [
        "odbcconf.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "installdriver",
        ".dll"
      ],
      "raw_values": [
        "*INSTALLDRIVER *",
        "*.dll*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\odbcconf.exe\" or process.pe.original_file_name:\"odbcconf.exe\") and (process.command_line:\"*INSTALLDRIVER *\" and process.command_line:\"*.dll*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_odbcconf_driver_install.eql",
  "metadata": {}
}