{
  "id": "695cb68f-9eb9-5aa3-8fd2-0d236ab268c3",
  "catalog": "sigma",
  "name": "proc_creation_win_device_credential_deployment",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "devicecredentialdeployment.exe"
      ],
      "raw_values": [
        "*\\\\DeviceCredentialDeployment.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\DeviceCredentialDeployment.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_device_credential_deployment.eql",
  "metadata": {}
}