{
  "id": "69eaf53c-4239-5855-92a9-aa51b8cd9654",
  "catalog": "sigma",
  "name": "image_load_dll_vss_ps_susp_load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "clussvc.exe",
        "dismhost.exe",
        "dllhost.exe",
        "appcmd.exe",
        "iissetup.exe",
        "msiexec.exe",
        "rundll32.exe",
        "searchindexer.exe",
        "srtasks.exe",
        "svchost.exe",
        "systempropertiesadvanced.exe",
        "taskhostw.exe",
        "thor.exe",
        "thor64.exe",
        "tiworker.exe",
        "vssvc.exe",
        "vssadmin.exe",
        "wmiprvse.exe",
        "wsmprovhost.exe"
      ],
      "raw_values": [
        "*\\\\clussvc.exe",
        "*\\\\dismhost.exe",
        "*\\\\dllhost.exe",
        "*\\\\inetsrv\\\\appcmd.exe",
        "*\\\\inetsrv\\\\iissetup.exe",
        "*\\\\msiexec.exe",
        "*\\\\rundll32.exe",
        "*\\\\searchindexer.exe",
        "*\\\\srtasks.exe",
        "*\\\\svchost.exe",
        "*\\\\System32\\\\SystemPropertiesAdvanced.exe",
        "*\\\\taskhostw.exe",
        "*\\\\thor.exe",
        "*\\\\thor64.exe",
        "*\\\\tiworker.exe",
        "*\\\\vssvc.exe",
        "*\\\\vssadmin.exe",
        "*\\\\WmiPrvSE.exe",
        "*\\\\wsmprovhost.exe",
        "C:\\\\Program Files\\\\*"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "vss_ps.dll"
      ],
      "raw_values": [
        "*\\\\vss_ps.dll"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "winlog.event_data.CommandLine",
      "operator": ":",
      "values": [
        "dismhost.exe {"
      ],
      "raw_values": [
        "C:\\\\$WinREAgent\\\\Scratch\\\\*",
        "*\\\\dismhost.exe {*"
      ]
    }
  ],
  "raw_query": "any where file.path:\"*\\\\vss_ps.dll\" and (not ((process.executable:\"C:\\\\Windows\\\\*\" and (process.executable like~ (\"*\\\\clussvc.exe\", \"*\\\\dismhost.exe\", \"*\\\\dllhost.exe\", \"*\\\\inetsrv\\\\appcmd.exe\", \"*\\\\inetsrv\\\\iissetup.exe\", \"*\\\\msiexec.exe\", \"*\\\\rundll32.exe\", \"*\\\\searchindexer.exe\", \"*\\\\srtasks.exe\", \"*\\\\svchost.exe\", \"*\\\\System32\\\\SystemPropertiesAdvanced.exe\", \"*\\\\taskhostw.exe\", \"*\\\\thor.exe\", \"*\\\\thor64.exe\", \"*\\\\tiworker.exe\", \"*\\\\vssvc.exe\", \"*\\\\vssadmin.exe\", \"*\\\\WmiPrvSE.exe\", \"*\\\\wsmprovhost.exe\"))) or (winlog.event_data.CommandLine:\"C:\\\\$WinREAgent\\\\Scratch\\\\*\" and winlog.event_data.CommandLine:\"*\\\\dismhost.exe {*\") or (?process.executable == null))) and (not (process.executable like~ (\"C:\\\\Program Files\\\\*\", \"C:\\\\Program Files (x86)\\\\*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/image_load/image_load_dll_vss_ps_susp_load.eql",
  "metadata": {}
}