{
  "id": "6db4afa5-fd40-5cc0-8675-e5cab78f0db0",
  "catalog": "sigma",
  "name": "proc_creation_win_hh_susp_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".application"
      ],
      "raw_values": [
        "*.application*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*\\\\Content.Outlook\\\\*",
        "*\\\\Downloads\\\\*",
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\Windows\\\\Temp\\\\*"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "hh.exe"
      ],
      "raw_values": [
        "HH.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "hh.exe"
      ],
      "raw_values": [
        "*\\\\hh.exe"
      ]
    }
  ],
  "raw_query": "any where (process.pe.original_file_name:\"HH.exe\" or process.executable:\"*\\\\hh.exe\") and (process.command_line like~ (\"*.application*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\Content.Outlook\\\\*\", \"*\\\\Downloads\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\Windows\\\\Temp\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hh_susp_execution.eql",
  "metadata": {}
}