{
  "id": "6f26526f-a875-555f-bb91-1140e173c51d",
  "catalog": "sigma",
  "name": "proc_creation_win_whoami_parent_anomaly",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1033"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell_ise.exe",
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell_ise.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "",
        "-"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "whoami.exe"
      ],
      "raw_values": [
        "*\\\\whoami.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "whoami.exe"
      ],
      "raw_values": [
        "whoami.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "monitoringhost.exe"
      ],
      "raw_values": [
        "*:\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\MonitoringHost.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\whoami.exe\" or process.pe.original_file_name:\"whoami.exe\") and (not ((process.parent.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell_ise.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) or (?process.parent.executable == null) or (process.parent.executable like~ (\"\", \"-\")))) and (not process.parent.executable:\"*:\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\MonitoringHost.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_whoami_parent_anomaly.eql",
  "metadata": {}
}