{
  "id": "70fe4803-aecb-599c-a515-2a2d2d79a006",
  "catalog": "sigma",
  "name": "win_system_apt_turla_service_png",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    },
    {
      "field": "winlog.event_data.servicename",
      "raw_field": "winlog.event_data.ServiceName",
      "operator": ":",
      "values": [
        "werfaultsvc"
      ],
      "raw_values": [
        "WerFaultSvc"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and (winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\" and winlog.event_data.ServiceName:\"WerFaultSvc\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2017/TA/Turla/win_system_apt_turla_service_png.eql",
  "metadata": {}
}