{
  "id": "7194a908-9550-55ef-96e6-831298fb9b52",
  "catalog": "sigma",
  "name": "file_change_win_unusual_modification_by_dns_exe",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dns.exe"
      ],
      "raw_values": [
        "*\\\\dns.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "dns.log"
      ],
      "raw_values": [
        "*\\\\dns.log"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\dns.exe\" and (not file.path:\"*\\\\dns.log\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/file/file_change/file_change_win_unusual_modification_by_dns_exe.eql",
  "metadata": {}
}