{
  "id": "75853f00-714f-5009-91bc-af4ae62cda5c",
  "catalog": "sigma",
  "name": "proc_creation_win_renamed_megasync",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "megasync.exe"
      ],
      "raw_values": [
        "megasync.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "megasync.exe"
      ],
      "raw_values": [
        "*\\\\megasync.exe"
      ]
    }
  ],
  "raw_query": "any where process.pe.original_file_name:\"megasync.exe\" and (not process.executable:\"*\\\\megasync.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_renamed_megasync.eql",
  "metadata": {}
}