{
  "id": "78a5f5f6-2081-59f1-8da2-daefbc1e1aaa",
  "catalog": "sigma",
  "name": "proc_creation_win_rundll32_webdav_client_susp_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "10.",
        "192.168.",
        "172.16.",
        "172.17.",
        "172.18.",
        "172.19.",
        "172.20.",
        "172.21.",
        "172.22.",
        "172.23.",
        "172.24.",
        "172.25.",
        "172.26.",
        "172.27.",
        "172.28.",
        "172.29.",
        "172.30.",
        "172.31.",
        "127.",
        "169.254."
      ],
      "raw_values": [
        "*://10.*",
        "*://192.168.*",
        "*://172.16.*",
        "*://172.17.*",
        "*://172.18.*",
        "*://172.19.*",
        "*://172.20.*",
        "*://172.21.*",
        "*://172.22.*",
        "*://172.23.*",
        "*://172.24.*",
        "*://172.25.*",
        "*://172.26.*",
        "*://172.27.*",
        "*://172.28.*",
        "*://172.29.*",
        "*://172.30.*",
        "*://172.31.*",
        "*://127.*",
        "*://169.254.*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "*\\\\svchost.exe"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": ":",
      "values": [
        "-s webclient"
      ],
      "raw_values": [
        "*-s WebClient*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "davclnt.dll,davsetcookie",
        "d{1,3}']), flags=set())"
      ],
      "raw_values": [
        "*C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie*",
        "SigmaRegularExpression(regexp=SigmaString(['://\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}']), flags=set())"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable:\"*\\\\svchost.exe\" and process.parent.command_line:\"*-s WebClient*\" and process.executable:\"*\\\\rundll32.exe\" and process.command_line:\"*C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie*\" and process.command_line:\"SigmaRegularExpression(regexp=SigmaString(['://\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}']), flags=set())\") and (not (process.command_line like~ (\"*://10.*\", \"*://192.168.*\", \"*://172.16.*\", \"*://172.17.*\", \"*://172.18.*\", \"*://172.19.*\", \"*://172.20.*\", \"*://172.21.*\", \"*://172.22.*\", \"*://172.23.*\", \"*://172.24.*\", \"*://172.25.*\", \"*://172.26.*\", \"*://172.27.*\", \"*://172.28.*\", \"*://172.29.*\", \"*://172.30.*\", \"*://172.31.*\", \"*://127.*\", \"*://169.254.*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_rundll32_webdav_client_susp_execution.eql",
  "metadata": {}
}