{
  "id": "7b809d1b-6323-541c-9005-cad4805108ff",
  "catalog": "sigma",
  "name": "proc_creation_win_wmic_recon_process",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1047"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "*\\\\WMIC.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "wmic.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "process",
        "call",
        "create"
      ],
      "raw_values": [
        "*process*",
        "*call*",
        "*create*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\WMIC.exe\" or process.pe.original_file_name:\"wmic.exe\") and process.command_line:\"*process*\") and (not (process.command_line:\"*call*\" and process.command_line:\"*create*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_wmic_recon_process.eql",
  "metadata": {}
}