{
  "id": "7c7cdb71-51f1-5429-82d8-5ce8637a2192",
  "catalog": "sigma",
  "name": "proc_creation_win_uac_bypass_sdclt",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.integritylevel",
      "raw_field": "winlog.event_data.IntegrityLevel",
      "operator": "like~",
      "values": [
        "high",
        "s-1-16-12288"
      ],
      "raw_values": [
        "High",
        "S-1-16-12288"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "sdclt.exe"
      ],
      "raw_values": [
        "*sdclt.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*sdclt.exe\" and (winlog.event_data.IntegrityLevel like~ (\"High\", \"S-1-16-12288\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_uac_bypass_sdclt.eql",
  "metadata": {}
}