{
  "id": "7d725e74-fab3-53ca-a283-2b4e19abb06c",
  "catalog": "sigma",
  "name": "proc_creation_win_wbadmin_delete_all_backups",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wbadmin.exe"
      ],
      "raw_values": [
        "*\\\\wbadmin.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wbadmin.exe"
      ],
      "raw_values": [
        "WBADMIN.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "delete",
        "backup",
        "keepversions:0"
      ],
      "raw_values": [
        "*delete*",
        "*backup*",
        "*keepVersions:0*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\wbadmin.exe\" or process.pe.original_file_name:\"WBADMIN.EXE\") and ((process.command_line:\"*delete*\" and process.command_line:\"*backup*\") and process.command_line:\"*keepVersions:0*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_wbadmin_delete_all_backups.eql",
  "metadata": {}
}