{
  "id": "80a56259-e10d-5777-8503-3779f9bd7f1a",
  "catalog": "sigma",
  "name": "proc_creation_win_susp_progname",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cve-202",
        "cve202",
        "poc.exe",
        "artifact.exe",
        "artifact64.exe",
        "artifact_protected.exe",
        "artifact32.exe",
        "artifact32big.exe",
        "obfuscated.exe",
        "obfusc.exe",
        "meterpreter"
      ],
      "raw_values": [
        "*\\\\CVE-202*",
        "*\\\\CVE202*",
        "*\\\\poc.exe",
        "*\\\\artifact.exe",
        "*\\\\artifact64.exe",
        "*\\\\artifact_protected.exe",
        "*\\\\artifact32.exe",
        "*\\\\artifact32big.exe",
        "*obfuscated.exe",
        "*obfusc.exe",
        "*\\\\meterpreter"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "inject.ps1",
        "invoke-cve",
        "pupy.ps1",
        "payload.ps1",
        "beacon.ps1",
        "powerview.ps1",
        "bypass.ps1",
        "obfuscated.ps1",
        "obfusc.ps1",
        "obfus.ps1",
        "obfs.ps1",
        "evil.ps1",
        "minidogz.ps1",
        "_enc.ps1",
        "shell.ps1",
        "rshell.ps1",
        "revshell.ps1",
        "av.ps1",
        "av_test.ps1",
        "adrecon.ps1",
        "mimikatz.ps1",
        "powerup_",
        "powerup.ps1",
        "a.ps1",
        "p.ps1",
        "1.ps1",
        "hound.ps1",
        "encode.ps1",
        "powercat.ps1"
      ],
      "raw_values": [
        "*inject.ps1*",
        "*Invoke-CVE*",
        "*pupy.ps1*",
        "*payload.ps1*",
        "*beacon.ps1*",
        "*PowerView.ps1*",
        "*bypass.ps1*",
        "*obfuscated.ps1*",
        "*obfusc.ps1*",
        "*obfus.ps1*",
        "*obfs.ps1*",
        "*evil.ps1*",
        "*MiniDogz.ps1*",
        "*_enc.ps1*",
        "*\\\\shell.ps1*",
        "*\\\\rshell.ps1*",
        "*revshell.ps1*",
        "*\\\\av.ps1*",
        "*\\\\av_test.ps1*",
        "*adrecon.ps1*",
        "*mimikatz.ps1*",
        "*\\\\PowerUp_*",
        "*powerup.ps1*",
        "*\\\\Temp\\\\a.ps1*",
        "*\\\\Temp\\\\p.ps1*",
        "*\\\\Temp\\\\1.ps1*",
        "*Hound.ps1*",
        "*encode.ps1*",
        "*powercat.ps1*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\CVE-202*\", \"*\\\\CVE202*\")) or (process.executable like~ (\"*\\\\poc.exe\", \"*\\\\artifact.exe\", \"*\\\\artifact64.exe\", \"*\\\\artifact_protected.exe\", \"*\\\\artifact32.exe\", \"*\\\\artifact32big.exe\", \"*obfuscated.exe\", \"*obfusc.exe\", \"*\\\\meterpreter\"))) or (process.command_line like~ (\"*inject.ps1*\", \"*Invoke-CVE*\", \"*pupy.ps1*\", \"*payload.ps1*\", \"*beacon.ps1*\", \"*PowerView.ps1*\", \"*bypass.ps1*\", \"*obfuscated.ps1*\", \"*obfusc.ps1*\", \"*obfus.ps1*\", \"*obfs.ps1*\", \"*evil.ps1*\", \"*MiniDogz.ps1*\", \"*_enc.ps1*\", \"*\\\\shell.ps1*\", \"*\\\\rshell.ps1*\", \"*revshell.ps1*\", \"*\\\\av.ps1*\", \"*\\\\av_test.ps1*\", \"*adrecon.ps1*\", \"*mimikatz.ps1*\", \"*\\\\PowerUp_*\", \"*powerup.ps1*\", \"*\\\\Temp\\\\a.ps1*\", \"*\\\\Temp\\\\p.ps1*\", \"*\\\\Temp\\\\1.ps1*\", \"*Hound.ps1*\", \"*encode.ps1*\", \"*powercat.ps1*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_susp_progname.eql",
  "metadata": {}
}