{
  "id": "81200e87-6968-5ac6-aac7-3b1d5732b8f9",
  "catalog": "sigma",
  "name": "proc_creation_win_winrm_execution_via_scripting_api_winrm_vbs",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1216"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cscript.exe"
      ],
      "raw_values": [
        "*\\\\cscript.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cscript.exe"
      ],
      "raw_values": [
        "cscript.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "winrm",
        "win32_",
        "-r:http"
      ],
      "raw_values": [
        "*winrm*",
        "*invoke Create wmicimv2/Win32_*",
        "*-r:http*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\cscript.exe\" or process.pe.original_file_name:\"cscript.exe\") and (process.command_line:\"*winrm*\" and process.command_line:\"*invoke Create wmicimv2/Win32_*\" and process.command_line:\"*-r:http*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_winrm_execution_via_scripting_api_winrm_vbs.eql",
  "metadata": {}
}