{
  "id": "81652372-1de9-5217-80f2-0838568ce1a5",
  "catalog": "sigma",
  "name": "proc_creation_win_powershell_run_script_from_ads",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1564.004"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "get-content",
        "-stream"
      ],
      "raw_values": [
        "*Get-Content*",
        "*-Stream*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and (process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and (process.command_line:\"*Get-Content*\" and process.command_line:\"*-Stream*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_powershell_run_script_from_ads.eql",
  "metadata": {}
}