{
  "id": "81e67463-7d1a-5fc7-a428-256ed4f4ac3e",
  "catalog": "sigma",
  "name": "proc_creation_win_hktl_powertool",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1562.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powertool.exe",
        "powertool64.exe"
      ],
      "raw_values": [
        "*\\\\PowerTool.exe",
        "*\\\\PowerTool64.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "powertool.exe"
      ],
      "raw_values": [
        "PowerTool.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\PowerTool.exe\", \"*\\\\PowerTool64.exe\")) or process.pe.original_file_name:\"PowerTool.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hktl_powertool.eql",
  "metadata": {}
}