{
  "id": "81faf2c3-2b70-5dea-9a25-4bfc410c25d3",
  "catalog": "sigma",
  "name": "proc_creation_win_deviceenroller_dll_sideloading",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "deviceenroller.exe"
      ],
      "raw_values": [
        "*\\\\deviceenroller.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "deviceenroller.exe"
      ],
      "raw_values": [
        "deviceenroller.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "phonedeeplink"
      ],
      "raw_values": [
        "*/PhoneDeepLink*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\deviceenroller.exe\" or process.pe.original_file_name:\"deviceenroller.exe\") and process.command_line:\"*/PhoneDeepLink*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_deviceenroller_dll_sideloading.eql",
  "metadata": {}
}