{
  "id": "83bd1767-aab0-5915-875f-a3f78d172dc9",
  "catalog": "sigma",
  "name": "win_security_diagtrack_eop_default_login_username",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4624"
      ],
      "raw_values": [
        "4624"
      ]
    },
    {
      "field": "winlog.event_data.targetoutboundusername",
      "raw_field": "winlog.event_data.TargetOutboundUserName",
      "operator": ":",
      "values": [
        "thisisnotvaliduser"
      ],
      "raw_values": [
        "thisisnotvaliduser"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4624\" and winlog.event_data.LogonType:\"9\" and winlog.event_data.TargetOutboundUserName:\"thisisnotvaliduser\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/account_management/win_security_diagtrack_eop_default_login_username.eql",
  "metadata": {}
}