{
  "id": "8559088e-fccd-5618-bf97-df144c5becef",
  "catalog": "sigma",
  "name": "proc_creation_win_conhost_headless_powershell",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059.001",
    "attack.t1059.003",
    "attack.t1564.003"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "conhost.exe"
      ],
      "raw_values": [
        "*\\\\conhost.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "conhost.exe"
      ],
      "raw_values": [
        "CONHOST.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "--headless",
        "powershell"
      ],
      "raw_values": [
        "*--headless*",
        "*powershell*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\conhost.exe\" or process.pe.original_file_name:\"CONHOST.EXE\") and (process.command_line:\"*--headless*\" and process.command_line:\"*powershell*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_conhost_headless_powershell.eql",
  "metadata": {}
}