{
  "id": "8858bda7-3106-50bf-9bec-a41a5ef77a7c",
  "catalog": "sigma",
  "name": "file_event_win_malware_devil_bait_script_drop",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "schtasks.exe",
        "wscript.exe",
        "mshta.exe"
      ],
      "raw_values": [
        "*\\\\schtasks.exe",
        "*\\\\wscript.exe",
        "*\\\\mshta.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".txt",
        ".xml"
      ],
      "raw_values": [
        "*.txt",
        "*.xml"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\schtasks.exe\", \"*\\\\wscript.exe\", \"*\\\\mshta.exe\")) and file.path:\"*\\\\AppData\\\\Roaming\\\\Microsoft\\\\*\" and (file.path like~ (\"*.txt\", \"*.xml\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2021/Malware/Devil-Bait/file_event_win_malware_devil_bait_script_drop.eql",
  "metadata": {}
}