{
  "id": "890ff828-b83f-5306-a0d1-879d29c75eb7",
  "catalog": "sigma",
  "name": "win_system_invoke_obfuscation_var_services",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    },
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": ":",
      "values": [
        "cmd"
      ],
      "raw_values": [
        "*cmd*",
        "*\\",
        "*-f*"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and (winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\" and (winlog.event_data.ImagePath:\"*cmd*\" and winlog.event_data.ImagePath:\"*\\\"set*\" and winlog.event_data.ImagePath:\"*-f*\") and (winlog.event_data.ImagePath like~ (\"*/c*\", \"*/r*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/system/service_control_manager/win_system_invoke_obfuscation_var_services.eql",
  "metadata": {}
}