{
  "id": "89372eab-f5a4-5441-bbd6-af518d62966d",
  "catalog": "sigma",
  "name": "registry_set_asep_reg_keys_modification_wow6432node",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1547.001"
  ],
  "event_categories": [
    "registry"
  ],
  "conditions": [
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": "like~",
      "values": [
        "\\\\shellserviceobjectdelayload",
        "\\\\run\\\\",
        "\\\\runonce\\\\",
        "\\\\runonceex\\\\",
        "\\\\runservices\\\\",
        "\\\\runservicesonce\\\\",
        "\\\\explorer\\\\shellserviceobjects",
        "\\\\explorer\\\\shelliconoverlayidentifiers",
        "\\\\explorer\\\\shellexecutehooks",
        "\\\\explorer\\\\sharedtaskscheduler",
        "\\\\explorer\\\\browser helper objects",
        "\\\\wow6432node\\\\microsoft\\\\windows\\\\currentversion\\\\runonce\\\\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}",
        "\\\\wow6432node\\\\microsoft\\\\windows\\\\currentversion\\\\runonce\\\\{7037b699-7382-448c-89a7-4765961d2537}"
      ],
      "raw_values": [
        "*\\\\ShellServiceObjectDelayLoad*",
        "*\\\\Run\\\\*",
        "*\\\\RunOnce\\\\*",
        "*\\\\RunOnceEx\\\\*",
        "*\\\\RunServices\\\\*",
        "*\\\\RunServicesOnce\\\\*",
        "*\\\\Explorer\\\\ShellServiceObjects*",
        "*\\\\Explorer\\\\ShellIconOverlayIdentifiers*",
        "*\\\\Explorer\\\\ShellExecuteHooks*",
        "*\\\\Explorer\\\\SharedTaskScheduler*",
        "*\\\\Explorer\\\\Browser Helper Objects*",
        "*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}",
        "*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\{7037b699-7382-448c-89a7-4765961d2537}"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "package cache",
        "winsdksetup.exe",
        "windowsdesktop-runtime-",
        "aspnetcoresharedframeworkbundle-",
        "integrator.exe"
      ],
      "raw_values": [
        "C:\\\\ProgramData\\\\Package Cache*",
        "C:\\\\Windows\\\\Temp\\\\*",
        "*\\\\winsdksetup.exe*",
        "*\\\\windowsdesktop-runtime-*",
        "*\\\\AspNetCoreSharedFrameworkBundle-*",
        "C:\\\\Program Files\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe",
        "C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\*",
        "C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\Updates\\\\*"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": "like~",
      "values": [
        "{472083b1-c522-11cf-8763-00608cc02f24}",
        "{472083b0-c522-11cf-8763-00608cc02f24}"
      ],
      "raw_values": [
        "{472083B1-C522-11CF-8763-00608CC02F24}",
        "{472083B0-C522-11CF-8763-00608CC02F24}"
      ]
    },
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": ":",
      "values": [
        "\\\\software\\\\wow6432node\\\\microsoft\\\\windows\\\\currentversion",
        "\\\\explorer\\\\browser helper objects",
        "\\\\software\\\\wow6432node\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\",
        "\\\\office\\\\clicktorun\\\\registry\\\\machine\\\\software\\\\wow6432node\\\\",
        "\\\\explorer\\\\browser helper objects\\\\{31d09ba0-12f5-4cce-be8a-2923e76605da}\\\\",
        "\\\\explorer\\\\browser helper objects\\\\{92ef2ead-a7ce-4424-b0db-499cf856608e}\\\\noexplorer",
        "\\\\software\\\\wow6432node\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\discord",
        "\\\\software\\\\wow6432node\\\\microsoft\\\\windows\\\\currentversion\\\\runonce\\\\avrepair"
      ],
      "raw_values": [
        "*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion*",
        "*\\\\Explorer\\\\Browser Helper Objects*",
        "*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*",
        "*\\\\Office\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Wow6432Node\\\\*",
        "*\\\\Explorer\\\\Browser Helper Objects\\\\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}\\\\*",
        "*\\\\Explorer\\\\Browser Helper Objects\\\\{92EF2EAD-A7CE-4424-B0DB-499CF856608E}\\\\NoExplorer",
        "*\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Discord",
        "*\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\AvRepair"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": ":",
      "values": [
        "(empty)",
        "}\\\\vc_redist.x64.exe\\",
        "/burn.runonce",
        "-a251-47b7-93e1-cdd82e34af8b}",
        "grpconv -o",
        "c:\\\\program files",
        "\\\\dropbox\\\\client\\\\dropbox.exe",
        "/systemstartup",
        ".exe\\",
        "discord.exe --checkinstall",
        "\\\\avira.oe.setup.bundle.exe\\",
        "instup.exe\\"
      ],
      "raw_values": [
        "(Empty)",
        "\\",
        "*}\\\\VC_redist.x64.exe\\",
        "* /burn.runonce",
        "*-A251-47B7-93E1-CDD82E34AF8B}",
        "grpconv -o",
        "*C:\\\\Program Files*",
        "*\\\\Dropbox\\\\Client\\\\Dropbox.exe*",
        "* /systemstartup*",
        "*.exe\\",
        "*Discord.exe --checkInstall",
        "*\\\\Avira.OE.Setup.Bundle.exe\\",
        "*instup.exe\\"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vc_redist.x64.exe",
        "msi",
        "msiexec.exe",
        "setup.exe",
        "officeclicktorun.exe",
        "windowsdesktop-runtime-",
        "avira.oe.setup.bundle.exe",
        "instup.exe"
      ],
      "raw_values": [
        "*\\\\VC_redist.x64.exe",
        "C:\\\\Windows\\\\Installer\\\\MSI*",
        "C:\\\\WINDOWS\\\\system32\\\\msiexec.exe",
        "*C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\{*",
        "*\\\\setup.exe*",
        "C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\OfficeClickToRun.exe",
        "*\\\\windowsdesktop-runtime-*",
        "*\\\\OfficeClickToRun.exe",
        "*\\\\Avira.OE.Setup.Bundle.exe",
        "*\\\\instup.exe"
      ]
    }
  ],
  "raw_query": "any where (registry.path:\"*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion*\" and (registry.path like~ (\"*\\\\ShellServiceObjectDelayLoad*\", \"*\\\\Run\\\\*\", \"*\\\\RunOnce\\\\*\", \"*\\\\RunOnceEx\\\\*\", \"*\\\\RunServices\\\\*\", \"*\\\\RunServicesOnce\\\\*\", \"*\\\\Explorer\\\\ShellServiceObjects*\", \"*\\\\Explorer\\\\ShellIconOverlayIdentifiers*\", \"*\\\\Explorer\\\\ShellExecuteHooks*\", \"*\\\\Explorer\\\\SharedTaskScheduler*\", \"*\\\\Explorer\\\\Browser Helper Objects*\"))) and (not (winlog.event_data.Details:\"(Empty)\" or (?winlog.event_data.Details == null) or winlog.event_data.Details:\"\\\"C:\\\\ProgramData\\\\Package Cache\\\\{d21a4f20-968a-4b0c-bf04-a38da5f06e41}\\\\windowsdesktop-runtime-*\" or (process.executable:\"*\\\\VC_redist.x64.exe\" and winlog.event_data.Details:\"*}\\\\VC_redist.x64.exe\\\" /burn.runonce\") or ((process.executable like~ (\"C:\\\\ProgramData\\\\Package Cache*\", \"C:\\\\Windows\\\\Temp\\\\*\")) and (process.executable like~ (\"*\\\\winsdksetup.exe*\", \"*\\\\windowsdesktop-runtime-*\", \"*\\\\AspNetCoreSharedFrameworkBundle-*\")) and winlog.event_data.Details:\"* /burn.runonce\") or (process.executable:\"C:\\\\Windows\\\\Installer\\\\MSI*\" and registry.path:\"*\\\\Explorer\\\\Browser Helper Objects*\") or (process.executable:\"C:\\\\WINDOWS\\\\system32\\\\msiexec.exe\" and registry.path:\"*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*\") or (process.executable:\"*C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\{*\" and process.executable:\"*\\\\setup.exe*\"))) and (not ((process.executable:\"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\OfficeClickToRun.exe\" and registry.path:\"*\\\\Office\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Wow6432Node\\\\*\") or ((process.executable like~ (\"C:\\\\Program Files\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\", \"C:\\\\Program Files (x86)\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\")) and registry.path:\"*\\\\Explorer\\\\Browser Helper Objects\\\\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}\\\\*\") or (winlog.event_data.Details:\"*-A251-47B7-93E1-CDD82E34AF8B}\" or winlog.event_data.Details:\"grpconv -o\" or (winlog.event_data.Details:\"*C:\\\\Program Files*\" and winlog.event_data.Details:\"*\\\\Dropbox\\\\Client\\\\Dropbox.exe*\" and winlog.event_data.Details:\"* /systemstartup*\")) or registry.path:\"*\\\\Explorer\\\\Browser Helper Objects\\\\{92EF2EAD-A7CE-4424-B0DB-499CF856608E}\\\\NoExplorer\" or (process.executable:\"*\\\\windowsdesktop-runtime-*\" and (registry.path like~ (\"*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}\", \"*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\{7037b699-7382-448c-89a7-4765961d2537}\")) and winlog.event_data.Details:\"\\\"C:\\\\ProgramData\\\\Package Cache\\\\*\" and winlog.event_data.Details:\"*.exe\\\" /burn.runonce\") or ((process.executable like~ (\"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\*\", \"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\Updates\\\\*\")) and process.executable:\"*\\\\OfficeClickToRun.exe\") or (registry.path:\"*\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Discord\" and winlog.event_data.Details:\"*Discord.exe --checkInstall\") or (winlog.event_data.Details:\"*\\\\Avira.OE.Setup.Bundle.exe\\\" /burn.runonce\" and process.executable:\"*\\\\Avira.OE.Setup.Bundle.exe\") or (process.executable:\"*\\\\instup.exe\" and registry.path:\"*\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\AvRepair\" and winlog.event_data.Details:\"*instup.exe\\\" /instop:repair /wait\") or (process.executable:\"*\\\\instup.exe\" and (registry.path like~ (\"*\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\ShellIconOverlayIdentifiers\\\\00avg\\\\(Default)\", \"*\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\ShellIconOverlayIdentifiers\\\\00asw\\\\(Default)\")) and (winlog.event_data.Details like~ (\"{472083B1-C522-11CF-8763-00608CC02F24}\", \"{472083B0-C522-11CF-8763-00608CC02F24}\")))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/registry/registry_set/registry_set_asep_reg_keys_modification_wow6432node.eql",
  "metadata": {}
}