{
  "id": "89fc3373-0a94-58e6-8eb7-4415e5d43f43",
  "catalog": "sigma",
  "name": "win_security_audit_log_cleared",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "517",
        "1102"
      ],
      "raw_values": [
        "517",
        "1102"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "security",
        "microsoft-windows-eventlog"
      ],
      "raw_values": [
        "Security",
        "Microsoft-Windows-Eventlog"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and ((event.code:\"517\" and winlog.provider_name:\"Security\") or (event.code:\"1102\" and winlog.provider_name:\"Microsoft-Windows-Eventlog\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_audit_log_cleared.eql",
  "metadata": {}
}