{
  "id": "8b65448a-f3b5-5ed4-adf7-0b65f7d844c4",
  "catalog": "sigma",
  "name": "proc_creation_win_gpresult_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "gpresult.exe"
      ],
      "raw_values": [
        "*\\\\gpresult.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\gpresult.exe\" and (process.command_line like~ (\"*/z*\", \"*/v*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_gpresult_execution.eql",
  "metadata": {}
}