{
  "id": "8e452308-62b7-5742-a9bd-7d364c42ce41",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_trickbot_wermgr",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wermgr.exe"
      ],
      "raw_values": [
        "*\\\\wermgr.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": ":",
      "values": [
        "dllregisterserver"
      ],
      "raw_values": [
        "*DllRegisterServer*"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\wermgr.exe\" and process.parent.executable:\"*\\\\rundll32.exe\" and process.parent.command_line:\"*DllRegisterServer*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2020/Malware/Trickbot/proc_creation_win_malware_trickbot_wermgr.eql",
  "metadata": {}
}