{
  "id": "8f38038c-c4e0-53ae-a416-64b73953a9af",
  "catalog": "sigma",
  "name": "proc_creation_win_sysinternals_procdump",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1036",
    "attack.t1003.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "procdump.exe",
        "procdump64.exe"
      ],
      "raw_values": [
        "*\\\\procdump.exe",
        "*\\\\procdump64.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable like~ (\"*\\\\procdump.exe\", \"*\\\\procdump64.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_sysinternals_procdump.eql",
  "metadata": {}
}