{
  "id": "8f9d8bc9-2b50-559d-8bbb-1840349fd0a7",
  "catalog": "sigma",
  "name": "file_access_win_browsers_credential",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1003"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "cookies.sqlite",
        "places.sqlite",
        "key3.db",
        "key4.db",
        "logins.json",
        "login data",
        "local state"
      ],
      "raw_values": [
        "*\\\\cookies.sqlite",
        "*\\\\places.sqlite",
        "*release\\\\key3.db",
        "*release\\\\key4.db",
        "*release\\\\logins.json",
        "*\\\\User Data\\\\Default\\\\Login Data*",
        "*\\\\User Data\\\\Local State*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "mpcopyaccelerator.exe",
        "msmpeng.exe",
        "thor.exe",
        "thor64.exe"
      ],
      "raw_values": [
        "*\\\\MpCopyAccelerator.exe",
        "*\\\\MsMpEng.exe",
        "*\\\\thor.exe",
        "*\\\\thor64.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "webcachev01.dat"
      ],
      "raw_values": [
        "*\\\\Appdata\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache\\\\WebCacheV01.dat"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System",
        "C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*"
      ]
    }
  ],
  "raw_query": "any where (file.path:\"*\\\\Appdata\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache\\\\WebCacheV01.dat\" or (file.path like~ (\"*\\\\cookies.sqlite\", \"*\\\\places.sqlite\", \"*release\\\\key3.db\", \"*release\\\\key4.db\", \"*release\\\\logins.json\")) or (file.path like~ (\"*\\\\User Data\\\\Default\\\\Login Data*\", \"*\\\\User Data\\\\Local State*\"))) and (not (process.executable:\"System\" or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\", \"C:\\\\Windows\\\\system32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\")))) and (not ((process.executable:\"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*\" and (process.executable like~ (\"*\\\\MpCopyAccelerator.exe\", \"*\\\\MsMpEng.exe\"))) or (process.executable like~ (\"*\\\\thor.exe\", \"*\\\\thor64.exe\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/file/file_access/file_access_win_browsers_credential.eql",
  "metadata": {}
}