{
  "id": "90e1ac6a-2343-5679-9efc-4683500a31f8",
  "catalog": "sigma",
  "name": "proc_creation_win_papercut_print_management_exploitation_pc_app",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "bash.exe",
        "calc.exe",
        "certutil.exe",
        "cmd.exe",
        "csc.exe",
        "cscript.exe",
        "dllhost.exe",
        "mshta.exe",
        "msiexec.exe",
        "powershell.exe",
        "pwsh.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "scriptrunner.exe",
        "wmic.exe",
        "wscript.exe",
        "wsl.exe"
      ],
      "raw_values": [
        "*\\\\bash.exe",
        "*\\\\calc.exe",
        "*\\\\certutil.exe",
        "*\\\\cmd.exe",
        "*\\\\csc.exe",
        "*\\\\cscript.exe",
        "*\\\\dllhost.exe",
        "*\\\\mshta.exe",
        "*\\\\msiexec.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\scriptrunner.exe",
        "*\\\\wmic.exe",
        "*\\\\wscript.exe",
        "*\\\\wsl.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "pc-app.exe"
      ],
      "raw_values": [
        "*\\\\pc-app.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\pc-app.exe\" and (process.executable like~ (\"*\\\\bash.exe\", \"*\\\\calc.exe\", \"*\\\\certutil.exe\", \"*\\\\cmd.exe\", \"*\\\\csc.exe\", \"*\\\\cscript.exe\", \"*\\\\dllhost.exe\", \"*\\\\mshta.exe\", \"*\\\\msiexec.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regsvr32.exe\", \"*\\\\rundll32.exe\", \"*\\\\scriptrunner.exe\", \"*\\\\wmic.exe\", \"*\\\\wscript.exe\", \"*\\\\wsl.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/TA/PaperCut-Print-Management-Exploitation/proc_creation_win_papercut_print_management_exploitation_pc_app.eql",
  "metadata": {}
}