{
  "id": "95280d28-2725-5d0f-be6a-56e7b20aa3fe",
  "catalog": "sigma",
  "name": "net_connection_win_eqnedt",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1203"
  ],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "eqnedt32.exe"
      ],
      "raw_values": [
        "*\\\\eqnedt32.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\eqnedt32.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/network_connection/net_connection_win_eqnedt.eql",
  "metadata": {}
}