{
  "id": "9633638a-ed33-5bd8-98c8-f76ff8f38faa",
  "catalog": "sigma",
  "name": "win_security_sam_registry_hive_handle_request",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4656"
      ],
      "raw_values": [
        "4656"
      ]
    },
    {
      "field": "winlog.event_data.objecttype",
      "raw_field": "winlog.event_data.ObjectType",
      "operator": ":",
      "values": [
        "key"
      ],
      "raw_values": [
        "Key"
      ]
    },
    {
      "field": "winlog.event_data.objectname",
      "raw_field": "winlog.event_data.ObjectName",
      "operator": ":",
      "values": [
        "\\\\sam"
      ],
      "raw_values": [
        "*\\\\SAM"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4656\" and winlog.event_data.ObjectType:\"Key\" and winlog.event_data.ObjectName:\"*\\\\SAM\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_sam_registry_hive_handle_request.eql",
  "metadata": {}
}