{
  "id": "96a16b80-c94f-534f-8750-c6f59da9c661",
  "catalog": "sigma",
  "name": "proc_creation_win_wbadmin_delete_backups",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1490"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wbadmin.exe"
      ],
      "raw_values": [
        "*\\\\wbadmin.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wbadmin.exe"
      ],
      "raw_values": [
        "WBADMIN.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "delete",
        "backup",
        "keepversions:0"
      ],
      "raw_values": [
        "*delete *",
        "*backup*",
        "*keepVersions:0*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\wbadmin.exe\" or process.pe.original_file_name:\"WBADMIN.EXE\") and (process.command_line:\"*delete *\" and process.command_line:\"*backup*\")) and (not process.command_line:\"*keepVersions:0*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_wbadmin_delete_backups.eql",
  "metadata": {}
}