{
  "id": "99463cfb-2c0e-5ef9-9541-81dd1b21dd42",
  "catalog": "sigma",
  "name": "win_codeintegrity_revoked_driver_blocked",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-codeintegrity/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-CodeIntegrity/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "3023"
      ],
      "raw_values": [
        "3023"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-CodeIntegrity/Operational\" and event.code:\"3023\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/code_integrity/win_codeintegrity_revoked_driver_blocked.eql",
  "metadata": {}
}