{
  "id": "9957b595-b5df-5685-9656-c1326488fb2f",
  "catalog": "sigma",
  "name": "proc_creation_win_regini_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1112"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "regini.exe"
      ],
      "raw_values": [
        "*\\\\regini.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "regini.exe"
      ],
      "raw_values": [
        "REGINI.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "]']), flags=set())"
      ],
      "raw_values": [
        "SigmaRegularExpression(regexp=SigmaString([':[^ \\\\\\\\]']), flags=set())"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\regini.exe\" or process.pe.original_file_name:\"REGINI.EXE\") and (not process.command_line:\"SigmaRegularExpression(regexp=SigmaString([':[^ \\\\\\\\]']), flags=set())\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_regini_execution.eql",
  "metadata": {}
}