{
  "id": "9b3b7cf1-4f1c-589e-a709-5e4a8b8729b9",
  "catalog": "sigma",
  "name": "proc_creation_win_schtasks_system",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1053.005"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "change",
        "create",
        "nt aut",
        "system"
      ],
      "raw_values": [
        "* /change *",
        "* /create *",
        "*NT AUT*",
        "* SYSTEM *",
        "*/Create /F /RU System /SC WEEKLY /TN AviraSystemSpeedupVerify /TR *"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "schtasks.exe"
      ],
      "raw_values": [
        "*\\\\schtasks.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "tn tvinstallrestore",
        "teamviewer_.exe",
        "subscription heartbeat",
        "heartbeatconfig.xml",
        "office"
      ],
      "raw_values": [
        "*/ru *",
        "*/TN TVInstallRestore*",
        "*\\\\TeamViewer_.exe*",
        "*Subscription Heartbeat*",
        "*\\\\HeartbeatConfig.xml*",
        "*\\\\Microsoft Shared\\\\OFFICE*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\schtasks.exe\" and (process.command_line like~ (\"* /change *\", \"* /create *\"))) and process.command_line:\"*/ru *\" and (process.command_line like~ (\"*NT AUT*\", \"* SYSTEM *\"))) and (not ((process.executable:\"*\\\\schtasks.exe\" and (process.command_line:\"*/TN TVInstallRestore*\" and process.command_line:\"*\\\\TeamViewer_.exe*\")) or (process.command_line:\"*Subscription Heartbeat*\" and process.command_line:\"*\\\\HeartbeatConfig.xml*\" and process.command_line:\"*\\\\Microsoft Shared\\\\OFFICE*\") or (process.command_line like~ (\"*/Create /F /RU System /SC WEEKLY /TN AviraSystemSpeedupVerify /TR *\", \"*:\\\\Program Files (x86)\\\\Avira\\\\System Speedup\\\\setup\\\\avira_speedup_setup.exe*\", \"*/VERIFY /VERYSILENT /NOSTART /NODOTNET /NORESTART\\\" /RL HIGHEST*\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_schtasks_system.eql",
  "metadata": {}
}