{
  "id": "9c9eaef1-8fea-5b2e-8ed5-1e68c664c47b",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_hermetic_wiper_activity",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "sys.tmp",
        "__16"
      ],
      "raw_values": [
        "*CSIDL_SYSTEM_DRIVE\\\\temp\\\\sys.tmp*",
        "* 1> \\\\\\\\127.0.0.1\\\\ADMIN$\\\\__16*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "postgresql.exe"
      ],
      "raw_values": [
        "*\\\\policydefinitions\\\\postgresql.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "powershell -c",
        "comsvcs.dll minidump",
        "winupd.log full"
      ],
      "raw_values": [
        "*powershell -c *",
        "*\\\\comsvcs.dll MiniDump *",
        "*\\\\winupd.log full*"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\policydefinitions\\\\postgresql.exe\" or ((process.command_line like~ (\"*CSIDL_SYSTEM_DRIVE\\\\temp\\\\sys.tmp*\", \"* 1> \\\\\\\\127.0.0.1\\\\ADMIN$\\\\__16*\")) or (process.command_line:\"*powershell -c *\" and process.command_line:\"*\\\\comsvcs.dll MiniDump *\" and process.command_line:\"*\\\\winupd.log full*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2022/Malware/Hermetic-Wiper/proc_creation_win_malware_hermetic_wiper_activity.eql",
  "metadata": {}
}