{
  "id": "9cd0a49c-339b-5b18-96fe-84c10c51ec4c",
  "catalog": "sigma",
  "name": "proc_creation_win_sysinternals_psexec_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1569",
    "attack.t1021"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "psexec.exe"
      ],
      "raw_values": [
        "*\\\\psexec.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "psexec.c"
      ],
      "raw_values": [
        "psexec.c"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\psexec.exe\" or process.pe.original_file_name:\"psexec.c\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_sysinternals_psexec_execution.eql",
  "metadata": {}
}