{
  "id": "9d6e5ecd-79f2-5fb7-ba78-e576da1b5171",
  "catalog": "sigma",
  "name": "proc_creation_win_rundll32_spawn_explorer",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.011"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "explorer.exe"
      ],
      "raw_values": [
        "*\\\\explorer.exe"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": ":",
      "values": [
        "shell32.dll,control_rundll"
      ],
      "raw_values": [
        "*\\\\shell32.dll,Control_RunDLL*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable:\"*\\\\rundll32.exe\" and process.executable:\"*\\\\explorer.exe\") and (not process.parent.command_line:\"*\\\\shell32.dll,Control_RunDLL*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_rundll32_spawn_explorer.eql",
  "metadata": {}
}