{
  "id": "9fdbcf17-aeb8-5c01-bd41-6eb24c63169d",
  "catalog": "sigma",
  "name": "file_event_win_malware_darkgate_autoit3_binary_creation",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1105",
    "attack.t1059"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "autoit3.exe",
        "curl.exe",
        "extexport.exe",
        "keyscramblerlogon.exe",
        "wmprph.exe"
      ],
      "raw_values": [
        "*\\\\Autoit3.exe",
        "*\\\\curl.exe",
        "*\\\\ExtExport.exe",
        "*\\\\KeyScramblerLogon.exe",
        "*\\\\wmprph.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "autoit3.exe"
      ],
      "raw_values": [
        "*\\\\Autoit3.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\Autoit3.exe\", \"*\\\\curl.exe\", \"*\\\\ExtExport.exe\", \"*\\\\KeyScramblerLogon.exe\", \"*\\\\wmprph.exe\")) and file.path:\"*\\\\Autoit3.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Malware/DarkGate/file_event_win_malware_darkgate_autoit3_binary_creation.eql",
  "metadata": {}
}