{
  "id": "a05bb137-82c3-5b33-88b6-b9405792688f",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_darkgate_autoit3_from_susp_parent_and_location",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "keyscramblerlogon.exe",
        "msiexec.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\KeyScramblerLogon.exe",
        "*\\\\msiexec.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "autoit3.exe"
      ],
      "raw_values": [
        "*\\\\Autoit3.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "autoit3.exe"
      ],
      "raw_values": [
        "AutoIt3.exe"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\Autoit3.exe\" or process.pe.original_file_name:\"AutoIt3.exe\") and (process.parent.executable like~ (\"*\\\\cmd.exe\", \"*\\\\KeyScramblerLogon.exe\", \"*\\\\msiexec.exe\"))) and (not (process.executable like~ (\"*:\\\\Program Files (x86)\\\\AutoIt3\\\\AutoIt3.exe\", \"*:\\\\Program Files\\\\AutoIt3\\\\AutoIt3.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Malware/DarkGate/proc_creation_win_malware_darkgate_autoit3_from_susp_parent_and_location.eql",
  "metadata": {}
}