{
  "id": "a09cf633-b147-5633-92e7-9fcba3a05e10",
  "catalog": "sigma",
  "name": "win_system_service_install_uncommon",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": "like~",
      "values": [
        "\\\\\\\\.\\\\pipe",
        "\\\\users\\\\public\\\\",
        "\\\\windows\\\\temp\\\\",
        "aqblahga",
        "awv4i",
        "iab",
        "jab",
        "paa",
        "sqbfafga",
        "suvyi"
      ],
      "raw_values": [
        "*\\\\\\\\.\\\\pipe*",
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\Windows\\\\Temp\\\\*",
        "* aQBlAHgA*",
        "* aWV4I*",
        "* IAB*",
        "* JAB*",
        "* PAA*",
        "* SQBFAFgA*",
        "* SUVYI*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    },
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": ":",
      "values": [
        "c:\\\\programdata\\\\microsoft\\\\windows defender\\\\definition updates\\\\",
        "c:\\\\windows\\\\temp\\\\thor10-remote\\\\thor64.exe"
      ],
      "raw_values": [
        "* -e*",
        "C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Definition Updates\\\\*",
        "C:\\\\WINDOWS\\\\TEMP\\\\thor10-remote\\\\thor64.exe*"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and ((winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\") and ((winlog.event_data.ImagePath like~ (\"*\\\\\\\\.\\\\pipe*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\Windows\\\\Temp\\\\*\")) or (winlog.event_data.ImagePath:\"* -e*\" and (winlog.event_data.ImagePath like~ (\"* aQBlAHgA*\", \"* aWV4I*\", \"* IAB*\", \"* JAB*\", \"* PAA*\", \"* SQBFAFgA*\", \"* SUVYI*\")))) and (not winlog.event_data.ImagePath:\"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Definition Updates\\\\*\") and (not winlog.event_data.ImagePath:\"C:\\\\WINDOWS\\\\TEMP\\\\thor10-remote\\\\thor64.exe*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/system/service_control_manager/win_system_service_install_uncommon.eql",
  "metadata": {}
}