{
  "id": "a13bf0c3-705d-59f4-94d6-149a11f2d9a6",
  "catalog": "sigma",
  "name": "proc_creation_win_net_user_default_accounts_manipulation",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "*\\\\net.exe",
        "*\\\\net1.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "net.exe",
        "net1.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "järjestelmänvalvoja",
        "rendszergazda",
        "администратор",
        "administrateur",
        "administrador",
        "administratör",
        "administrator",
        "guest",
        "defaultaccount",
        "'järjestelmänvalvoja'",
        "'rendszergazda'",
        "'администратор'",
        "'administrateur'",
        "'administrador'",
        "'administratör'",
        "'administrator'",
        "'guest'",
        "'defaultaccount'"
      ],
      "raw_values": [
        "* Järjestelmänvalvoja *",
        "* Rendszergazda *",
        "* Администратор *",
        "* Administrateur *",
        "* Administrador *",
        "* Administratör *",
        "* Administrator *",
        "* guest *",
        "* DefaultAccount *",
        "* \\",
        " *",
        "* 'Järjestelmänvalvoja' *",
        "* 'Rendszergazda' *",
        "* 'Администратор' *",
        "* 'Administrateur' *",
        "* 'Administrador' *",
        "* 'Administratör' *",
        "* 'Administrator' *",
        "* 'guest' *",
        "* 'DefaultAccount' *"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "user",
        "guest",
        "active no"
      ],
      "raw_values": [
        "* user *",
        "*guest*",
        "*/active no*"
      ]
    }
  ],
  "raw_query": "any where (((process.executable like~ (\"*\\\\net.exe\", \"*\\\\net1.exe\")) or (process.pe.original_file_name like~ (\"net.exe\", \"net1.exe\"))) and process.command_line:\"* user *\" and (process.command_line like~ (\"* Järjestelmänvalvoja *\", \"* Rendszergazda *\", \"* Администратор *\", \"* Administrateur *\", \"* Administrador *\", \"* Administratör *\", \"* Administrator *\", \"* guest *\", \"* DefaultAccount *\", \"* \\\"Järjestelmänvalvoja\\\" *\", \"* \\\"Rendszergazda\\\" *\", \"* \\\"Администратор\\\" *\", \"* \\\"Administrateur\\\" *\", \"* \\\"Administrador\\\" *\", \"* \\\"Administratör\\\" *\", \"* \\\"Administrator\\\" *\", \"* \\\"guest\\\" *\", \"* \\\"DefaultAccount\\\" *\", \"* 'Järjestelmänvalvoja' *\", \"* 'Rendszergazda' *\", \"* 'Администратор' *\", \"* 'Administrateur' *\", \"* 'Administrador' *\", \"* 'Administratör' *\", \"* 'Administrator' *\", \"* 'guest' *\", \"* 'DefaultAccount' *\"))) and (not (process.command_line:\"*guest*\" and process.command_line:\"*/active no*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_net_user_default_accounts_manipulation.eql",
  "metadata": {}
}