{
  "id": "a2f546a2-89e1-57fc-bda1-5fd063b4399a",
  "catalog": "sigma",
  "name": "image_load_susp_python_image_load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "file.pe.description",
      "raw_field": "file.pe.description",
      "operator": ":",
      "values": [
        "python core"
      ],
      "raw_values": [
        "Python Core"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "python"
      ],
      "raw_values": [
        "*Python*"
      ]
    }
  ],
  "raw_query": "any where file.pe.description:\"Python Core\" and (not (process.executable:\"*Python*\" or (process.executable like~ (\"C:\\\\Program Files\\\\*\", \"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\ProgramData\\\\Anaconda3\\\\*\")))) and ?process.executable != null",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/image_load/image_load_susp_python_image_load.eql",
  "metadata": {}
}