{
  "id": "a459b72b-6597-59db-a51e-e6129fda4c55",
  "catalog": "sigma",
  "name": "image_load_wmic_remote_xsl_scripting_dlls",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1220"
  ],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "jscript.dll",
        "vbscript.dll"
      ],
      "raw_values": [
        "*\\\\jscript.dll",
        "*\\\\vbscript.dll"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "*\\\\wmic.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\wmic.exe\" and (file.path like~ (\"*\\\\jscript.dll\", \"*\\\\vbscript.dll\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/image_load/image_load_wmic_remote_xsl_scripting_dlls.eql",
  "metadata": {}
}