{
  "id": "a68ba869-e6bd-5a09-bee2-c3aec8e5e5b8",
  "catalog": "sigma",
  "name": "proc_creation_win_shutdown_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1529"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "shutdown.exe"
      ],
      "raw_values": [
        "*\\\\shutdown.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\shutdown.exe\" and (process.command_line like~ (\"*/r *\", \"*/s *\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_shutdown_execution.eql",
  "metadata": {}
}