{
  "id": "a7424298-90d4-5710-9db3-40945981bb0f",
  "catalog": "sigma",
  "name": "win_dns_client_tor_onion",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": "like~",
      "values": [
        ".hiddenservice.net",
        ".onion.ca",
        ".onion.cab",
        ".onion.casa",
        ".onion.city",
        ".onion.direct",
        ".onion.dog",
        ".onion.glass",
        ".onion.gq",
        ".onion.guide",
        ".onion.in.net",
        ".onion.ink",
        ".onion.it",
        ".onion.link",
        ".onion.lt",
        ".onion.lu",
        ".onion.ly",
        ".onion.mn",
        ".onion.network",
        ".onion.nu",
        ".onion.pet",
        ".onion.plus",
        ".onion.pt",
        ".onion.pw",
        ".onion.rip",
        ".onion.sh",
        ".onion.si",
        ".onion.to",
        ".onion.top",
        ".onion.ws",
        ".onion",
        ".s1.tor-gateways.de",
        ".s2.tor-gateways.de",
        ".s3.tor-gateways.de",
        ".s4.tor-gateways.de",
        ".s5.tor-gateways.de",
        ".t2w.pw",
        ".tor2web.ae.org",
        ".tor2web.blutmagie.de",
        ".tor2web.com",
        ".tor2web.fi",
        ".tor2web.io",
        ".tor2web.org",
        ".tor2web.xyz",
        ".torlink.co"
      ],
      "raw_values": [
        "*.hiddenservice.net",
        "*.onion.ca",
        "*.onion.cab",
        "*.onion.casa",
        "*.onion.city",
        "*.onion.direct",
        "*.onion.dog",
        "*.onion.glass",
        "*.onion.gq",
        "*.onion.guide",
        "*.onion.in.net",
        "*.onion.ink",
        "*.onion.it",
        "*.onion.link",
        "*.onion.lt",
        "*.onion.lu",
        "*.onion.ly",
        "*.onion.mn",
        "*.onion.network",
        "*.onion.nu",
        "*.onion.pet",
        "*.onion.plus",
        "*.onion.pt",
        "*.onion.pw",
        "*.onion.rip",
        "*.onion.sh",
        "*.onion.si",
        "*.onion.to",
        "*.onion.top",
        "*.onion.ws",
        "*.onion",
        "*.s1.tor-gateways.de",
        "*.s2.tor-gateways.de",
        "*.s3.tor-gateways.de",
        "*.s4.tor-gateways.de",
        "*.s5.tor-gateways.de",
        "*.t2w.pw",
        "*.tor2web.ae.org",
        "*.tor2web.blutmagie.de",
        "*.tor2web.com",
        "*.tor2web.fi",
        "*.tor2web.io",
        "*.tor2web.org",
        "*.tor2web.xyz",
        "*.torlink.co"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-dns client events/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-DNS Client Events/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "3008"
      ],
      "raw_values": [
        "3008"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-DNS Client Events/Operational\" and (event.code:\"3008\" and (dns.question.name like~ (\"*.hiddenservice.net\", \"*.onion.ca\", \"*.onion.cab\", \"*.onion.casa\", \"*.onion.city\", \"*.onion.direct\", \"*.onion.dog\", \"*.onion.glass\", \"*.onion.gq\", \"*.onion.guide\", \"*.onion.in.net\", \"*.onion.ink\", \"*.onion.it\", \"*.onion.link\", \"*.onion.lt\", \"*.onion.lu\", \"*.onion.ly\", \"*.onion.mn\", \"*.onion.network\", \"*.onion.nu\", \"*.onion.pet\", \"*.onion.plus\", \"*.onion.pt\", \"*.onion.pw\", \"*.onion.rip\", \"*.onion.sh\", \"*.onion.si\", \"*.onion.to\", \"*.onion.top\", \"*.onion.ws\", \"*.onion\", \"*.s1.tor-gateways.de\", \"*.s2.tor-gateways.de\", \"*.s3.tor-gateways.de\", \"*.s4.tor-gateways.de\", \"*.s5.tor-gateways.de\", \"*.t2w.pw\", \"*.tor2web.ae.org\", \"*.tor2web.blutmagie.de\", \"*.tor2web.com\", \"*.tor2web.fi\", \"*.tor2web.io\", \"*.tor2web.org\", \"*.tor2web.xyz\", \"*.torlink.co\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/dns_client/win_dns_client_tor_onion.eql",
  "metadata": {}
}