{
  "id": "a7e7efeb-389c-5ab1-abd6-a51276b245b7",
  "catalog": "sigma",
  "name": "win_security_pass_the_hash_2",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4624"
      ],
      "raw_values": [
        "4624"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": ":",
      "values": [
        "s-1-0-0"
      ],
      "raw_values": [
        "S-1-0-0"
      ]
    },
    {
      "field": "winlog.event_data.logonprocessname",
      "raw_field": "winlog.event_data.LogonProcessName",
      "operator": ":",
      "values": [
        "ntlmssp",
        "seclogo"
      ],
      "raw_values": [
        "NtLmSsp",
        "seclogo"
      ]
    },
    {
      "field": "winlog.event_data.targetusername",
      "raw_field": "winlog.event_data.TargetUserName",
      "operator": ":",
      "values": [
        "anonymous logon"
      ],
      "raw_values": [
        "ANONYMOUS LOGON"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (((event.code:\"4624\" and user.id:\"S-1-0-0\" and winlog.event_data.LogonType:\"3\" and winlog.event_data.LogonProcessName:\"NtLmSsp\" and winlog.event_data.KeyLength:\"0\") or (event.code:\"4624\" and winlog.event_data.LogonType:\"9\" and winlog.event_data.LogonProcessName:\"seclogo\")) and (not winlog.event_data.TargetUserName:\"ANONYMOUS LOGON\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/account_management/win_security_pass_the_hash_2.eql",
  "metadata": {}
}