{
  "id": "a94506cf-e67a-5e9a-85af-fde4f4d8d667",
  "catalog": "sigma",
  "name": "proc_creation_win_office_onenote_embedded_script_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "onenote.exe"
      ],
      "raw_values": [
        "*\\\\onenote.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\onenote.exe\" and (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\wscript.exe\")) and (process.command_line like~ (\"*\\\\exported\\\\*\", \"*\\\\onenoteofflinecache_files\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_office_onenote_embedded_script_execution.eql",
  "metadata": {}
}