{
  "id": "a985ee44-34c3-5ec8-991b-a57dd5ed18b2",
  "catalog": "sigma",
  "name": "proc_creation_win_curl_local_file_read",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "curl.exe"
      ],
      "raw_values": [
        "*\\\\curl.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "curl.exe"
      ],
      "raw_values": [
        "curl.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\curl.exe\" or process.pe.original_file_name:\"curl.exe\") and process.command_line:\"*file:///*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_curl_local_file_read.eql",
  "metadata": {}
}