{
  "id": "a9e503b2-7b20-5c8e-92c0-2c08650da751",
  "catalog": "sigma",
  "name": "proc_creation_win_rundll32_keymgr",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1555.004"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "RUNDLL32.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "keymgr",
        "krshowkeymgr"
      ],
      "raw_values": [
        "*keymgr*",
        "*KRShowKeyMgr*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\rundll32.exe\" or process.pe.original_file_name:\"RUNDLL32.EXE\") and (process.command_line:\"*keymgr*\" and process.command_line:\"*KRShowKeyMgr*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_rundll32_keymgr.eql",
  "metadata": {}
}