{
  "id": "aa16aa84-b15f-5e1c-9cd9-bfb8a2ffdcd9",
  "catalog": "sigma",
  "name": "proc_creation_win_regsvr32_susp_extensions",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".bin",
        ".bmp",
        ".cr2",
        ".dat",
        ".eps",
        ".gif",
        ".ico",
        ".jpeg",
        ".jpg",
        ".log",
        ".nef",
        ".orf",
        ".png",
        ".raw",
        ".rtf",
        ".sr2",
        ".temp",
        ".tif",
        ".tiff",
        ".tmp",
        ".txt"
      ],
      "raw_values": [
        "*.bin",
        "*.bmp",
        "*.cr2",
        "*.dat",
        "*.eps",
        "*.gif",
        "*.ico",
        "*.jpeg",
        "*.jpg",
        "*.log",
        "*.nef",
        "*.orf",
        "*.png",
        "*.raw",
        "*.rtf",
        "*.sr2",
        "*.temp",
        "*.tif",
        "*.tiff",
        "*.tmp",
        "*.txt"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "regsvr32.exe"
      ],
      "raw_values": [
        "*\\\\regsvr32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "regsvr32.exe"
      ],
      "raw_values": [
        "REGSVR32.EXE"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\regsvr32.exe\" or process.pe.original_file_name:\"REGSVR32.EXE\") and (process.command_line like~ (\"*.bin\", \"*.bmp\", \"*.cr2\", \"*.dat\", \"*.eps\", \"*.gif\", \"*.ico\", \"*.jpeg\", \"*.jpg\", \"*.log\", \"*.nef\", \"*.orf\", \"*.png\", \"*.raw\", \"*.rtf\", \"*.sr2\", \"*.temp\", \"*.tif\", \"*.tiff\", \"*.tmp\", \"*.txt\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_regsvr32_susp_extensions.eql",
  "metadata": {}
}