{
  "id": "aa6a5774-1ae2-57e8-b34f-014c31513e16",
  "catalog": "sigma",
  "name": "proc_creation_win_renamed_gpg4win",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "gpg.exe",
        "gpg2.exe"
      ],
      "raw_values": [
        "*\\\\gpg.exe",
        "*\\\\gpg2.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "gpg.exe"
      ],
      "raw_values": [
        "gpg.exe"
      ]
    }
  ],
  "raw_query": "any where process.pe.original_file_name:\"gpg.exe\" and (not (process.executable like~ (\"*\\\\gpg.exe\", \"*\\\\gpg2.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_renamed_gpg4win.eql",
  "metadata": {}
}