{
  "id": "ac07c578-108f-5138-86af-01ca33aef068",
  "catalog": "sigma",
  "name": "proc_creation_win_explorer_child_of_shell_process",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "explorer.exe"
      ],
      "raw_values": [
        "*\\\\explorer.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "explorer.exe"
      ],
      "raw_values": [
        "*explorer.exe*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and process.executable:\"*\\\\explorer.exe\" and process.command_line:\"*explorer.exe*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_explorer_child_of_shell_process.eql",
  "metadata": {}
}