{
  "id": "ac2d94f5-5dcb-5878-aea5-920006cfed68",
  "catalog": "sigma",
  "name": "proc_creation_win_findstr_gpp_passwords",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1552.006"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "find.exe",
        "findstr.exe"
      ],
      "raw_values": [
        "*\\\\find.exe",
        "*\\\\findstr.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "find.exe",
        "findstr.exe"
      ],
      "raw_values": [
        "FIND.EXE",
        "FINDSTR.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "cpassword",
        ".xml"
      ],
      "raw_values": [
        "*cpassword*",
        "*\\\\sysvol\\\\*",
        "*.xml*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\find.exe\", \"*\\\\findstr.exe\")) or (process.pe.original_file_name like~ (\"FIND.EXE\", \"FINDSTR.EXE\"))) and (process.command_line:\"*cpassword*\" and process.command_line:\"*\\\\sysvol\\\\*\" and process.command_line:\"*.xml*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_findstr_gpp_passwords.eql",
  "metadata": {}
}