{
  "id": "aedd7441-66ca-52c9-8b69-eea9ff698d48",
  "catalog": "sigma",
  "name": "proc_creation_win_virtualbox_vboxdrvinst_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vboxdrvinst.exe"
      ],
      "raw_values": [
        "*\\\\VBoxDrvInst.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "driver",
        "executeinf"
      ],
      "raw_values": [
        "*driver*",
        "*executeinf*"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\VBoxDrvInst.exe\" and (process.command_line:\"*driver*\" and process.command_line:\"*executeinf*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_virtualbox_vboxdrvinst_execution.eql",
  "metadata": {}
}