{
  "id": "af474b59-9d85-53d2-92ee-b6fe8a016b7b",
  "catalog": "sigma",
  "name": "proc_creation_win_susp_double_extension",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        ".exe",
        "______.exe",
        ".doc.exe",
        ".doc.js",
        ".docx.exe",
        ".docx.js",
        ".gif.exe",
        ".jpeg.exe",
        ".jpg.exe",
        ".mkv.exe",
        ".mov.exe",
        ".mp3.exe",
        ".mp4.exe",
        ".pdf.exe",
        ".pdf.js",
        ".png.exe",
        ".ppt.exe",
        ".ppt.js",
        ".pptx.exe",
        ".pptx.js",
        ".rtf.exe",
        ".rtf.js",
        ".svg.exe",
        ".txt.exe",
        ".txt.js",
        ".xls.exe",
        ".xls.js",
        ".xlsx.exe",
        ".xlsx.js",
        "⠀⠀⠀⠀⠀⠀.exe"
      ],
      "raw_values": [
        "*      .exe",
        "*______.exe",
        "*.doc.exe",
        "*.doc.js",
        "*.docx.exe",
        "*.docx.js",
        "*.gif.exe",
        "*.jpeg.exe",
        "*.jpg.exe",
        "*.mkv.exe",
        "*.mov.exe",
        "*.mp3.exe",
        "*.mp4.exe",
        "*.pdf.exe",
        "*.pdf.js",
        "*.png.exe",
        "*.ppt.exe",
        "*.ppt.js",
        "*.pptx.exe",
        "*.pptx.js",
        "*.rtf.exe",
        "*.rtf.js",
        "*.svg.exe",
        "*.txt.exe",
        "*.txt.js",
        "*.xls.exe",
        "*.xls.js",
        "*.xlsx.exe",
        "*.xlsx.js",
        "*⠀⠀⠀⠀⠀⠀.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".exe",
        "______.exe",
        ".doc.exe",
        ".doc.js",
        ".docx.exe",
        ".docx.js",
        ".gif.exe",
        ".jpeg.exe",
        ".jpg.exe",
        ".mkv.exe",
        ".mov.exe",
        ".mp3.exe",
        ".mp4.exe",
        ".pdf.exe",
        ".pdf.js",
        ".png.exe",
        ".ppt.exe",
        ".ppt.js",
        ".pptx.exe",
        ".pptx.js",
        ".rtf.exe",
        ".rtf.js",
        ".svg.exe",
        ".txt.exe",
        ".txt.js",
        ".xls.exe",
        ".xls.js",
        ".xlsx.exe",
        ".xlsx.js",
        "⠀⠀⠀⠀⠀⠀.exe"
      ],
      "raw_values": [
        "*      .exe*",
        "*______.exe*",
        "*.doc.exe*",
        "*.doc.js*",
        "*.docx.exe*",
        "*.docx.js*",
        "*.gif.exe*",
        "*.jpeg.exe*",
        "*.jpg.exe*",
        "*.mkv.exe*",
        "*.mov.exe*",
        "*.mp3.exe*",
        "*.mp4.exe*",
        "*.pdf.exe*",
        "*.pdf.js*",
        "*.png.exe*",
        "*.ppt.exe*",
        "*.ppt.js*",
        "*.pptx.exe*",
        "*.pptx.js*",
        "*.rtf.exe*",
        "*.rtf.js*",
        "*.svg.exe*",
        "*.txt.exe*",
        "*.txt.js*",
        "*.xls.exe*",
        "*.xls.js*",
        "*.xlsx.exe*",
        "*.xlsx.js*",
        "*⠀⠀⠀⠀⠀⠀.exe*"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*      .exe\", \"*______.exe\", \"*.doc.exe\", \"*.doc.js\", \"*.docx.exe\", \"*.docx.js\", \"*.gif.exe\", \"*.jpeg.exe\", \"*.jpg.exe\", \"*.mkv.exe\", \"*.mov.exe\", \"*.mp3.exe\", \"*.mp4.exe\", \"*.pdf.exe\", \"*.pdf.js\", \"*.png.exe\", \"*.ppt.exe\", \"*.ppt.js\", \"*.pptx.exe\", \"*.pptx.js\", \"*.rtf.exe\", \"*.rtf.js\", \"*.svg.exe\", \"*.txt.exe\", \"*.txt.js\", \"*.xls.exe\", \"*.xls.js\", \"*.xlsx.exe\", \"*.xlsx.js\", \"*⠀⠀⠀⠀⠀⠀.exe\")) and (process.command_line like~ (\"*      .exe*\", \"*______.exe*\", \"*.doc.exe*\", \"*.doc.js*\", \"*.docx.exe*\", \"*.docx.js*\", \"*.gif.exe*\", \"*.jpeg.exe*\", \"*.jpg.exe*\", \"*.mkv.exe*\", \"*.mov.exe*\", \"*.mp3.exe*\", \"*.mp4.exe*\", \"*.pdf.exe*\", \"*.pdf.js*\", \"*.png.exe*\", \"*.ppt.exe*\", \"*.ppt.js*\", \"*.pptx.exe*\", \"*.pptx.js*\", \"*.rtf.exe*\", \"*.rtf.js*\", \"*.svg.exe*\", \"*.txt.exe*\", \"*.txt.js*\", \"*.xls.exe*\", \"*.xls.js*\", \"*.xlsx.exe*\", \"*.xlsx.js*\", \"*⠀⠀⠀⠀⠀⠀.exe*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_susp_double_extension.eql",
  "metadata": {}
}