{
  "id": "b005b9ac-c5d8-546e-be9c-2ba2d54c116d",
  "catalog": "sigma",
  "name": "proc_creation_win_findstr_lsass",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "find.exe",
        "findstr.exe"
      ],
      "raw_values": [
        "*\\\\find.exe",
        "*\\\\findstr.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "find.exe",
        "findstr.exe"
      ],
      "raw_values": [
        "FIND.EXE",
        "FINDSTR.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "lsass",
        "-i lsass.exe",
        "i lsass.exe",
        "–i lsass.exe",
        "—i lsass.exe",
        "―i lsass.exe",
        "findstr lsass",
        "findstr.exe lsass"
      ],
      "raw_values": [
        "* -i \\",
        ", ",
        "lsass*",
        "* –i \\",
        "* ―i \\",
        "* -i lsass.exe*",
        "* /i lsass.exe*",
        "* –i lsass.exe*",
        "* —i lsass.exe*",
        "* ―i lsass.exe*",
        "*findstr \\",
        "*findstr lsass*",
        "*findstr.exe \\",
        "*findstr.exe lsass*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "lsass"
      ],
      "raw_values": [
        "*lsass*"
      ]
    }
  ],
  "raw_query": "any where (((process.executable like~ (\"*\\\\find.exe\", \"*\\\\findstr.exe\")) or (process.pe.original_file_name like~ (\"FIND.EXE\", \"FINDSTR.EXE\"))) and process.command_line:\"*lsass*\") or (process.command_line like~ (\"* -i \\\"lsass*\", \"* /i \\\"lsass*\", \"* –i \\\"lsass*\", \"* —i \\\"lsass*\", \"* ―i \\\"lsass*\") or process.command_line like~ (\"* -i lsass.exe*\", \"* /i lsass.exe*\", \"* –i lsass.exe*\", \"* —i lsass.exe*\", \"* ―i lsass.exe*\") or process.command_line like~ (\"*findstr \\\"lsass*\") or process.command_line like~ (\"*findstr lsass*\") or process.command_line like~ (\"*findstr.exe \\\"lsass*\") or process.command_line like~ (\"*findstr.exe lsass*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_findstr_lsass.eql",
  "metadata": {}
}