{
  "id": "b48251e8-01e2-5634-bd00-4581307ad243",
  "catalog": "sigma",
  "name": "dns_query_win_teamviewer_domain_query_by_uncommon_app",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1219.002"
  ],
  "event_categories": [
    "dns"
  ],
  "conditions": [
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": "like~",
      "values": [
        "taf.teamviewer.com",
        "udp.ping.teamviewer.com"
      ],
      "raw_values": [
        "taf.teamviewer.com",
        "udp.ping.teamviewer.com"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "teamviewer"
      ],
      "raw_values": [
        "*TeamViewer*"
      ]
    }
  ],
  "raw_query": "any where (dns.question.name like~ (\"taf.teamviewer.com\", \"udp.ping.teamviewer.com\")) and (not process.executable:\"*TeamViewer*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/dns_query/dns_query_win_teamviewer_domain_query_by_uncommon_app.eql",
  "metadata": {}
}