{
  "id": "b48b44aa-054f-5620-88ca-08abbc085835",
  "catalog": "sigma",
  "name": "proc_creation_win_bitsadmin_potential_persistence",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "%comspec%",
        "cmd.exe",
        "regsvr32.exe",
        "http:",
        "https:",
        "ftp:",
        "ftps:"
      ],
      "raw_values": [
        "*%COMSPEC%*",
        "*cmd.exe*",
        "*regsvr32.exe*",
        "*http:*",
        "*https:*",
        "*ftp:*",
        "*ftps:*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "bitsadmin.exe"
      ],
      "raw_values": [
        "*\\\\bitsadmin.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "bitsadmin.exe"
      ],
      "raw_values": [
        "bitsadmin.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "setnotifycmdline",
        "addfile"
      ],
      "raw_values": [
        "*/SetNotifyCmdLine*",
        "*/Addfile*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\bitsadmin.exe\" or process.pe.original_file_name:\"bitsadmin.exe\") and ((process.command_line:\"*/SetNotifyCmdLine*\" and (process.command_line like~ (\"*%COMSPEC%*\", \"*cmd.exe*\", \"*regsvr32.exe*\"))) or (process.command_line:\"*/Addfile*\" and (process.command_line like~ (\"*http:*\", \"*https:*\", \"*ftp:*\", \"*ftps:*\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_bitsadmin_potential_persistence.eql",
  "metadata": {}
}