{
  "id": "b7728a0d-c84c-5e57-8fe9-c20d434d61ad",
  "catalog": "sigma",
  "name": "proc_creation_win_tar_compression",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "tar.exe"
      ],
      "raw_values": [
        "*\\\\tar.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "bsdtar"
      ],
      "raw_values": [
        "bsdtar"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\tar.exe\" or process.pe.original_file_name:\"bsdtar\") and (process.command_line like~ (\"*-c*\", \"*-r*\", \"*-u*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_tar_compression.eql",
  "metadata": {}
}