{
  "id": "b79884b1-5bb6-5222-93a1-7d2110f90244",
  "catalog": "sigma",
  "name": "proc_creation_win_hktl_certipy",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1649"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "account",
        "auth",
        "cert",
        "find",
        "forge",
        "ptt",
        "relay",
        "req",
        "shadow",
        "template",
        "-bloodhound",
        "-ca-pfx",
        "-dc-ip",
        "-kirbi",
        "-old-bloodhound",
        "-pfx",
        "-target",
        "-template",
        "-username",
        "-vulnerable",
        "auth -pfx",
        "shadow auto",
        "shadow list"
      ],
      "raw_values": [
        "* account *",
        "* auth *",
        "* cert *",
        "* find *",
        "* forge *",
        "* ptt *",
        "* relay *",
        "* req *",
        "* shadow *",
        "* template *",
        "* -bloodhound*",
        "* -ca-pfx *",
        "* -dc-ip *",
        "* -kirbi*",
        "* -old-bloodhound*",
        "* -pfx *",
        "* -target*",
        "* -template*",
        "* -username *",
        "* -vulnerable*",
        "*auth -pfx*",
        "*shadow auto*",
        "*shadow list*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certipy.exe"
      ],
      "raw_values": [
        "*\\\\Certipy.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certipy.exe"
      ],
      "raw_values": [
        "Certipy.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "certipy"
      ],
      "raw_values": [
        "*Certipy*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\Certipy.exe\" or process.pe.original_file_name:\"Certipy.exe\" or process.pe.description:\"*Certipy*\") or ((process.command_line like~ (\"* account *\", \"* auth *\", \"* cert *\", \"* find *\", \"* forge *\", \"* ptt *\", \"* relay *\", \"* req *\", \"* shadow *\", \"* template *\")) and (process.command_line like~ (\"* -bloodhound*\", \"* -ca-pfx *\", \"* -dc-ip *\", \"* -kirbi*\", \"* -old-bloodhound*\", \"* -pfx *\", \"* -target*\", \"* -template*\", \"* -username *\", \"* -vulnerable*\", \"*auth -pfx*\", \"*shadow auto*\", \"*shadow list*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hktl_certipy.eql",
  "metadata": {}
}