{
  "id": "b9a65ad6-7c25-5bce-898f-f337dfab4f22",
  "catalog": "sigma",
  "name": "proc_creation_win_apt_zxshell",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "zxfunction",
        "remotediskxxxxx"
      ],
      "raw_values": [
        "*zxFunction*",
        "*RemoteDiskXXXXX*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\rundll32.exe\" and (process.command_line like~ (\"*zxFunction*\", \"*RemoteDiskXXXXX*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2014/TA/Axiom/proc_creation_win_apt_zxshell.eql",
  "metadata": {}
}