{
  "id": "b9bb7560-69d2-5bde-b6dd-5b8c84d353e4",
  "catalog": "sigma",
  "name": "file_access_win_office_outlook_mail_credential",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "data",
        "store.vol"
      ],
      "raw_values": [
        "*\\\\AppData\\\\Local\\\\Comms\\\\Unistore\\\\data*",
        "*\\\\AppData\\\\Local\\\\Comms\\\\UnistoreDB\\\\store.vol"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "mpcopyaccelerator.exe",
        "msmpeng.exe",
        "thor64.exe",
        "thor.exe"
      ],
      "raw_values": [
        "*\\\\MpCopyAccelerator.exe",
        "*\\\\MsMpEng.exe",
        "*\\\\thor64.exe",
        "*\\\\thor.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System",
        "C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*"
      ]
    }
  ],
  "raw_query": "any where (file.path like~ (\"*\\\\AppData\\\\Local\\\\Comms\\\\Unistore\\\\data*\", \"*\\\\AppData\\\\Local\\\\Comms\\\\UnistoreDB\\\\store.vol\")) and (not (process.executable:\"System\" or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\", \"C:\\\\Windows\\\\system32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\")))) and (not ((process.executable:\"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*\" and (process.executable like~ (\"*\\\\MpCopyAccelerator.exe\", \"*\\\\MsMpEng.exe\"))) or (process.executable like~ (\"*\\\\thor64.exe\", \"*\\\\thor.exe\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/file/file_access/file_access_win_office_outlook_mail_credential.eql",
  "metadata": {}
}