{
  "id": "b9e2f597-4eed-5a0f-99e7-b08c3972bddc",
  "catalog": "sigma",
  "name": "win_security_password_policy_enumerated",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4661"
      ],
      "raw_values": [
        "4661"
      ]
    },
    {
      "field": "winlog.event_data.accesslist",
      "raw_field": "winlog.event_data.AccessList",
      "operator": ":",
      "values": [
        "%%5392"
      ],
      "raw_values": [
        "*%%5392*"
      ]
    },
    {
      "field": "winlog.event_data.objectserver",
      "raw_field": "winlog.event_data.ObjectServer",
      "operator": ":",
      "values": [
        "security account manager"
      ],
      "raw_values": [
        "Security Account Manager"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4661\" and winlog.event_data.AccessList:\"*%%5392*\" and winlog.event_data.ObjectServer:\"Security Account Manager\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_password_policy_enumerated.eql",
  "metadata": {}
}