{
  "id": "bb1dd7ec-022d-5ba0-85ec-2d26237aa575",
  "catalog": "sigma",
  "name": "win_system_apt_carbonpaper_turla",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1543.003"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.servicename",
      "raw_field": "winlog.event_data.ServiceName",
      "operator": "like~",
      "values": [
        "srservice",
        "ipvpn",
        "hkmsvc"
      ],
      "raw_values": [
        "srservice",
        "ipvpn",
        "hkmsvc"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and (winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\" and (winlog.event_data.ServiceName like~ (\"srservice\", \"ipvpn\", \"hkmsvc\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2017/TA/Turla/win_system_apt_carbonpaper_turla.eql",
  "metadata": {}
}