{
  "id": "bc490f9e-af40-5319-845d-32eb7cb3458e",
  "catalog": "sigma",
  "name": "proc_creation_win_gpg4win_decryption",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "gpg.exe",
        "gpg2.exe"
      ],
      "raw_values": [
        "*\\\\gpg.exe",
        "*\\\\gpg2.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "gnupg’s openpgp tool"
      ],
      "raw_values": [
        "GnuPG’s OpenPGP tool"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "passphrase"
      ],
      "raw_values": [
        "* -d *",
        "*passphrase*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\gpg.exe\", \"*\\\\gpg2.exe\")) or process.pe.description:\"GnuPG’s OpenPGP tool\") and (process.command_line:\"* -d *\" and process.command_line:\"*passphrase*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_gpg4win_decryption.eql",
  "metadata": {}
}