{
  "id": "bcb9e538-3786-50dc-97c5-61d5ff95f0a6",
  "catalog": "sigma",
  "name": "proc_creation_win_aspnet_compiler_susp_paths",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1127"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "aspnet_compiler.exe"
      ],
      "raw_values": [
        "*\\\\aspnet_compiler.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\*\", \"*:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\*\", \"*:\\\\Windows\\\\Microsoft.NET\\\\FrameworkArm\\\\*\", \"*:\\\\Windows\\\\Microsoft.NET\\\\FrameworkArm64\\\\*\")) and process.executable:\"*\\\\aspnet_compiler.exe\" and (process.command_line like~ (\"*\\\\Users\\\\Public\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\AppData\\\\Local\\\\Roaming\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*:\\\\Windows\\\\System32\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Tasks\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_aspnet_compiler_susp_paths.eql",
  "metadata": {}
}