{
  "id": "bcfb8675-9f9d-578c-ad69-3dffcd949bb0",
  "catalog": "sigma",
  "name": "proc_creation_win_netsh_fw_allow_program_in_susp_location",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "%temp%",
        "%tmp%"
      ],
      "raw_values": [
        "*:\\\\$Recycle.bin\\\\*",
        "*:\\\\RECYCLER.BIN\\\\*",
        "*:\\\\RECYCLERS.BIN\\\\*",
        "*:\\\\SystemVolumeInformation\\\\*",
        "*:\\\\Temp\\\\*",
        "*:\\\\Users\\\\Default\\\\*",
        "*:\\\\Users\\\\Desktop\\\\*",
        "*:\\\\Users\\\\Public\\\\*",
        "*:\\\\Windows\\\\addins\\\\*",
        "*:\\\\Windows\\\\cursors\\\\*",
        "*:\\\\Windows\\\\debug\\\\*",
        "*:\\\\Windows\\\\drivers\\\\*",
        "*:\\\\Windows\\\\fonts\\\\*",
        "*:\\\\Windows\\\\help\\\\*",
        "*:\\\\Windows\\\\system32\\\\tasks\\\\*",
        "*:\\\\Windows\\\\Tasks\\\\*",
        "*:\\\\Windows\\\\Temp\\\\*",
        "*\\\\Downloads\\\\*",
        "*\\\\Local Settings\\\\Temporary Internet Files\\\\*",
        "*\\\\Temporary Internet Files\\\\Content.Outlook\\\\*",
        "*%Public%\\\\*",
        "*%TEMP%*",
        "*%TMP%*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "netsh.exe"
      ],
      "raw_values": [
        "*\\\\netsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "netsh.exe"
      ],
      "raw_values": [
        "netsh.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "firewall",
        "add",
        "allowedprogram",
        "advfirewall",
        "rule",
        "action=allow",
        "program="
      ],
      "raw_values": [
        "*firewall*",
        "*add*",
        "*allowedprogram*",
        "*advfirewall*",
        "*rule*",
        "*action=allow*",
        "*program=*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\netsh.exe\" or process.pe.original_file_name:\"netsh.exe\") and ((process.command_line:\"*firewall*\" and process.command_line:\"*add*\" and process.command_line:\"*allowedprogram*\") or (process.command_line:\"*advfirewall*\" and process.command_line:\"*firewall*\" and process.command_line:\"*add*\" and process.command_line:\"*rule*\" and process.command_line:\"*action=allow*\" and process.command_line:\"*program=*\")) and (process.command_line like~ (\"*:\\\\$Recycle.bin\\\\*\", \"*:\\\\RECYCLER.BIN\\\\*\", \"*:\\\\RECYCLERS.BIN\\\\*\", \"*:\\\\SystemVolumeInformation\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Users\\\\Default\\\\*\", \"*:\\\\Users\\\\Desktop\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\addins\\\\*\", \"*:\\\\Windows\\\\cursors\\\\*\", \"*:\\\\Windows\\\\debug\\\\*\", \"*:\\\\Windows\\\\drivers\\\\*\", \"*:\\\\Windows\\\\fonts\\\\*\", \"*:\\\\Windows\\\\help\\\\*\", \"*:\\\\Windows\\\\system32\\\\tasks\\\\*\", \"*:\\\\Windows\\\\Tasks\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*\\\\Downloads\\\\*\", \"*\\\\Local Settings\\\\Temporary Internet Files\\\\*\", \"*\\\\Temporary Internet Files\\\\Content.Outlook\\\\*\", \"*%Public%\\\\*\", \"*%TEMP%*\", \"*%TMP%*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_netsh_fw_allow_program_in_susp_location.eql",
  "metadata": {}
}