{
  "id": "bf940531-6caa-5428-90be-625c198aa95a",
  "catalog": "sigma",
  "name": "proc_creation_win_remote_time_discovery",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe"
      ],
      "raw_values": [
        "*\\\\net.exe",
        "*\\\\net1.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "time"
      ],
      "raw_values": [
        "*time*",
        "*tz*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "w32tm.exe"
      ],
      "raw_values": [
        "*\\\\w32tm.exe"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\net.exe\", \"*\\\\net1.exe\")) and process.command_line:\"*time*\") or (process.executable:\"*\\\\w32tm.exe\" and process.command_line:\"*tz*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_remote_time_discovery.eql",
  "metadata": {}
}