{
  "id": "bfb29e68-33dc-5214-b189-b06a3aec6114",
  "catalog": "sigma",
  "name": "RunDLL32 Suspicious Execution",
  "description": "Detects rundll32 executing DLLs from uncommon paths",
  "severity": "high",
  "mitre_techniques": [
    "attack.t1218.011"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "Image",
      "operator": "==",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "rundll32.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "CommandLine",
      "operator": "like~",
      "values": [
        "*\\\\Temp\\\\*"
      ],
      "raw_values": [
        "*\\\\Temp\\\\*"
      ]
    }
  ],
  "raw_query": "process where process.name == \"rundll32.exe\" and process.command_line like~ \"*\\\\Temp\\\\*\"",
  "language": "sigma",
  "translated_query": "process where process.name == \"rundll32.exe\" and process.command_line like~ \"*\\\\Temp\\\\*\"",
  "source_path": "demo",
  "metadata": {}
}