{
  "id": "c074dd98-806b-5bb6-aa84-54e44ccbc3cd",
  "catalog": "sigma",
  "name": "win_security_file_access_browser_credential",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1555.003"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.objectname",
      "raw_field": "winlog.event_data.ObjectName",
      "operator": "like~",
      "values": [
        "\\\\user data\\\\default\\\\login data",
        "\\\\user data\\\\local state",
        "\\\\user data\\\\default\\\\network\\\\cookies"
      ],
      "raw_values": [
        "*\\\\User Data\\\\Default\\\\Login Data*",
        "*\\\\User Data\\\\Local State*",
        "*\\\\User Data\\\\Default\\\\Network\\\\Cookies*"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "cookies.sqlite",
        "places.sqlite",
        "key3.db",
        "key4.db",
        "logins.json"
      ],
      "raw_values": [
        "*\\\\cookies.sqlite",
        "*\\\\places.sqlite",
        "*release\\\\key3.db",
        "*release\\\\key4.db",
        "*release\\\\logins.json"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "mpcopyaccelerator.exe",
        "msmpeng.exe"
      ],
      "raw_values": [
        "*\\\\MpCopyAccelerator.exe",
        "*\\\\MsMpEng.exe"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4663"
      ],
      "raw_values": [
        "4663"
      ]
    },
    {
      "field": "winlog.event_data.objecttype",
      "raw_field": "winlog.event_data.ObjectType",
      "operator": ":",
      "values": [
        "file"
      ],
      "raw_values": [
        "File"
      ]
    },
    {
      "field": "winlog.event_data.accessmask",
      "raw_field": "winlog.event_data.AccessMask",
      "operator": ":",
      "values": [
        "0x1"
      ],
      "raw_values": [
        "0x1"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System",
        "C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and ((event.code:\"4663\" and winlog.event_data.ObjectType:\"File\" and winlog.event_data.AccessMask:\"0x1\") and ((winlog.event_data.ObjectName like~ (\"*\\\\User Data\\\\Default\\\\Login Data*\", \"*\\\\User Data\\\\Local State*\", \"*\\\\User Data\\\\Default\\\\Network\\\\Cookies*\")) or (file.path like~ (\"*\\\\cookies.sqlite\", \"*\\\\places.sqlite\", \"*release\\\\key3.db\", \"*release\\\\key4.db\", \"*release\\\\logins.json\"))) and (not (process.executable:\"System\" or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Program Files\\\\*\", \"C:\\\\Windows\\\\system32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\")))) and (not (process.executable:\"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*\" and (process.executable like~ (\"*\\\\MpCopyAccelerator.exe\", \"*\\\\MsMpEng.exe\")))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/builtin/security/win_security_file_access_browser_credential.eql",
  "metadata": {}
}