{
  "id": "c293fd00-c228-5ae6-97be-b674e5c21696",
  "catalog": "sigma",
  "name": "proc_creation_win_plink_susp_tunneling",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1572"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-p 443",
        "-p 22"
      ],
      "raw_values": [
        "* -P 443*",
        "* -P 22*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "plink.exe"
      ],
      "raw_values": [
        "*\\\\plink.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        ":127.0.0.1:3389",
        ":3389"
      ],
      "raw_values": [
        "*:127.0.0.1:3389*",
        "*:3389*"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\plink.exe\" and process.command_line:\"*:127.0.0.1:3389*\") or ((process.executable:\"*\\\\plink.exe\" and process.command_line:\"*:3389*\") and (process.command_line like~ (\"* -P 443*\", \"* -P 22*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_plink_susp_tunneling.eql",
  "metadata": {}
}