{
  "id": "c4ea60aa-fee6-5239-b985-ec18e67a620b",
  "catalog": "sigma",
  "name": "file_event_win_exploit_cve_2021_40444",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "winword.exe"
      ],
      "raw_values": [
        "*\\\\winword.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "inetcache",
        ".cab",
        ".inf",
        "temp",
        "content.inf"
      ],
      "raw_values": [
        "*\\\\Windows\\\\INetCache*",
        "*.cab",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*.inf*",
        "C:\\\\Users\\\\*",
        "*AppData\\\\Local\\\\Temp*",
        "*\\\\Content.inf"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\winword.exe\" and file.path:\"*\\\\Windows\\\\INetCache*\" and file.path:\"*.cab\") or (process.executable:\"*\\\\winword.exe\" and (file.path:\"*\\\\AppData\\\\Local\\\\Temp\\\\*\" and file.path:\"*.inf*\"))) and (not (file.path:\"C:\\\\Users\\\\*\" and file.path:\"*AppData\\\\Local\\\\Temp*\" and file.path:\"*\\\\Content.inf\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2021/Exploits/CVE-2021-40444/file_event_win_exploit_cve_2021_40444.eql",
  "metadata": {}
}