{
  "id": "c6ad4baf-52d8-52a5-b6f8-2b1cff1206e0",
  "catalog": "sigma",
  "name": "file_event_win_creation_system_file",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "atbroker.exe",
        "audiodg.exe",
        "backgroundtaskhost.exe",
        "bcdedit.exe",
        "bitsadmin.exe",
        "cmdl32.exe",
        "cmstp.exe",
        "conhost.exe",
        "csrss.exe",
        "dashost.exe",
        "dfrgui.exe",
        "dllhost.exe",
        "dwm.exe",
        "eventcreate.exe",
        "eventvwr.exe",
        "explorer.exe",
        "extrac32.exe",
        "fontdrvhost.exe",
        "fsquirt.exe",
        "ipconfig.exe",
        "iscsicli.exe",
        "iscsicpl.exe",
        "logman.exe",
        "logonui.exe",
        "lsaiso.exe",
        "lsass.exe",
        "lsm.exe",
        "msiexec.exe",
        "msinfo32.exe",
        "mstsc.exe",
        "nbtstat.exe",
        "odbcconf.exe",
        "powershell.exe",
        "pwsh.exe",
        "regini.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "runtimebroker.exe",
        "schtasks.exe",
        "searchfilterhost.exe",
        "searchindexer.exe",
        "searchprotocolhost.exe",
        "securityhealthservice.exe",
        "securityhealthsystray.exe",
        "services.exe",
        "shellappruntime.exe",
        "sihost.exe",
        "smartscreen.exe",
        "smss.exe",
        "spoolsv.exe",
        "svchost.exe",
        "systemsettingsbroker.exe",
        "taskhost.exe",
        "taskhostw.exe",
        "taskmgr.exe",
        "tiworker.exe",
        "vssadmin.exe",
        "w32tm.exe",
        "werfault.exe",
        "werfaultsecure.exe",
        "wermgr.exe",
        "wevtutil.exe",
        "wininit.exe",
        "winlogon.exe",
        "winrshost.exe",
        "winrtnetmuahostserver.exe",
        "wlanext.exe",
        "wlrmdr.exe",
        "wmiprvse.exe",
        "wslhost.exe",
        "wsreset.exe",
        "wudfhost.exe",
        "wwahost.exe"
      ],
      "raw_values": [
        "*\\\\AtBroker.exe",
        "*\\\\audiodg.exe",
        "*\\\\backgroundTaskHost.exe",
        "*\\\\bcdedit.exe",
        "*\\\\bitsadmin.exe",
        "*\\\\cmdl32.exe",
        "*\\\\cmstp.exe",
        "*\\\\conhost.exe",
        "*\\\\csrss.exe",
        "*\\\\dasHost.exe",
        "*\\\\dfrgui.exe",
        "*\\\\dllhost.exe",
        "*\\\\dwm.exe",
        "*\\\\eventcreate.exe",
        "*\\\\eventvwr.exe",
        "*\\\\explorer.exe",
        "*\\\\extrac32.exe",
        "*\\\\fontdrvhost.exe",
        "*\\\\fsquirt.exe",
        "*\\\\ipconfig.exe",
        "*\\\\iscsicli.exe",
        "*\\\\iscsicpl.exe",
        "*\\\\logman.exe",
        "*\\\\LogonUI.exe",
        "*\\\\LsaIso.exe",
        "*\\\\lsass.exe",
        "*\\\\lsm.exe",
        "*\\\\msiexec.exe",
        "*\\\\msinfo32.exe",
        "*\\\\mstsc.exe",
        "*\\\\nbtstat.exe",
        "*\\\\odbcconf.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regini.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\RuntimeBroker.exe",
        "*\\\\schtasks.exe",
        "*\\\\SearchFilterHost.exe",
        "*\\\\SearchIndexer.exe",
        "*\\\\SearchProtocolHost.exe",
        "*\\\\SecurityHealthService.exe",
        "*\\\\SecurityHealthSystray.exe",
        "*\\\\services.exe",
        "*\\\\ShellAppRuntime.exe",
        "*\\\\sihost.exe",
        "*\\\\smartscreen.exe",
        "*\\\\smss.exe",
        "*\\\\spoolsv.exe",
        "*\\\\svchost.exe",
        "*\\\\SystemSettingsBroker.exe",
        "*\\\\taskhost.exe",
        "*\\\\taskhostw.exe",
        "*\\\\Taskmgr.exe",
        "*\\\\TiWorker.exe",
        "*\\\\vssadmin.exe",
        "*\\\\w32tm.exe",
        "*\\\\WerFault.exe",
        "*\\\\WerFaultSecure.exe",
        "*\\\\wermgr.exe",
        "*\\\\wevtutil.exe",
        "*\\\\wininit.exe",
        "*\\\\winlogon.exe",
        "*\\\\winrshost.exe",
        "*\\\\WinRTNetMUAHostServer.exe",
        "*\\\\wlanext.exe",
        "*\\\\wlrmdr.exe",
        "*\\\\WmiPrvSE.exe",
        "*\\\\wslhost.exe",
        "*\\\\WSReset.exe",
        "*\\\\WUDFHost.exe",
        "*\\\\WWAHost.exe",
        "*C:\\\\$WINDOWS.~BT\\\\*",
        "*C:\\\\$WinREAgent\\\\*",
        "*C:\\\\Windows\\\\SoftwareDistribution\\\\*",
        "*C:\\\\Windows\\\\System32\\\\*",
        "*C:\\\\Windows\\\\SysWOW64\\\\*",
        "*C:\\\\Windows\\\\WinSxS\\\\*",
        "*C:\\\\Windows\\\\uus\\\\*",
        "*C:\\\\Program Files\\\\WindowsApps\\\\*",
        "C:\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe*",
        "C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe*",
        "C:\\\\Program Files\\\\WindowsApps\\\\Microsoft.PowerShellPreview\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "tiworker.exe",
        "wuaucltcore.exe",
        "svchost.exe",
        "wuauclt.exe",
        "msiexec.exe"
      ],
      "raw_values": [
        "*\\\\TiWorker.exe",
        "*\\\\wuaucltcore.exe",
        "*C:\\\\Windows\\\\system32\\\\svchost.exe",
        "*C:\\\\Windows\\\\SysWOW64\\\\svchost.exe",
        "C:\\\\Windows\\\\System32\\\\wuauclt.exe",
        "C:\\\\Windows\\\\SysWOW64\\\\wuauclt.exe",
        "C:\\\\Windows\\\\UUS\\\\arm64\\\\wuaucltcore.exe",
        "*C:\\\\WINDOWS\\\\system32\\\\msiexec.exe",
        "*C:\\\\WINDOWS\\\\SysWOW64\\\\msiexec.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "explorer.exe",
        "securityhealthsystray.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\Temp\\\\*",
        "*C:\\\\Windows\\\\explorer.exe",
        "*C:\\\\Windows\\\\System32\\\\SecurityHealth\\\\*",
        "*\\\\SecurityHealthSystray.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "securityhealthsetup.exe"
      ],
      "raw_values": [
        "*\\\\SecurityHealthSetup.exe"
      ]
    }
  ],
  "raw_query": "any where (file.path like~ (\"*\\\\AtBroker.exe\", \"*\\\\audiodg.exe\", \"*\\\\backgroundTaskHost.exe\", \"*\\\\bcdedit.exe\", \"*\\\\bitsadmin.exe\", \"*\\\\cmdl32.exe\", \"*\\\\cmstp.exe\", \"*\\\\conhost.exe\", \"*\\\\csrss.exe\", \"*\\\\dasHost.exe\", \"*\\\\dfrgui.exe\", \"*\\\\dllhost.exe\", \"*\\\\dwm.exe\", \"*\\\\eventcreate.exe\", \"*\\\\eventvwr.exe\", \"*\\\\explorer.exe\", \"*\\\\extrac32.exe\", \"*\\\\fontdrvhost.exe\", \"*\\\\fsquirt.exe\", \"*\\\\ipconfig.exe\", \"*\\\\iscsicli.exe\", \"*\\\\iscsicpl.exe\", \"*\\\\logman.exe\", \"*\\\\LogonUI.exe\", \"*\\\\LsaIso.exe\", \"*\\\\lsass.exe\", \"*\\\\lsm.exe\", \"*\\\\msiexec.exe\", \"*\\\\msinfo32.exe\", \"*\\\\mstsc.exe\", \"*\\\\nbtstat.exe\", \"*\\\\odbcconf.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regini.exe\", \"*\\\\regsvr32.exe\", \"*\\\\rundll32.exe\", \"*\\\\RuntimeBroker.exe\", \"*\\\\schtasks.exe\", \"*\\\\SearchFilterHost.exe\", \"*\\\\SearchIndexer.exe\", \"*\\\\SearchProtocolHost.exe\", \"*\\\\SecurityHealthService.exe\", \"*\\\\SecurityHealthSystray.exe\", \"*\\\\services.exe\", \"*\\\\ShellAppRuntime.exe\", \"*\\\\sihost.exe\", \"*\\\\smartscreen.exe\", \"*\\\\smss.exe\", \"*\\\\spoolsv.exe\", \"*\\\\svchost.exe\", \"*\\\\SystemSettingsBroker.exe\", \"*\\\\taskhost.exe\", \"*\\\\taskhostw.exe\", \"*\\\\Taskmgr.exe\", \"*\\\\TiWorker.exe\", \"*\\\\vssadmin.exe\", \"*\\\\w32tm.exe\", \"*\\\\WerFault.exe\", \"*\\\\WerFaultSecure.exe\", \"*\\\\wermgr.exe\", \"*\\\\wevtutil.exe\", \"*\\\\wininit.exe\", \"*\\\\winlogon.exe\", \"*\\\\winrshost.exe\", \"*\\\\WinRTNetMUAHostServer.exe\", \"*\\\\wlanext.exe\", \"*\\\\wlrmdr.exe\", \"*\\\\WmiPrvSE.exe\", \"*\\\\wslhost.exe\", \"*\\\\WSReset.exe\", \"*\\\\WUDFHost.exe\", \"*\\\\WWAHost.exe\")) and (not ((file.path like~ (\"*C:\\\\$WINDOWS.~BT\\\\*\", \"*C:\\\\$WinREAgent\\\\*\", \"*C:\\\\Windows\\\\SoftwareDistribution\\\\*\", \"*C:\\\\Windows\\\\System32\\\\*\", \"*C:\\\\Windows\\\\SysWOW64\\\\*\", \"*C:\\\\Windows\\\\WinSxS\\\\*\", \"*C:\\\\Windows\\\\uus\\\\*\")) or ((process.executable like~ (\"*\\\\TiWorker.exe\", \"*\\\\wuaucltcore.exe\")) and file.path:\"C:\\\\Windows\\\\Temp\\\\*\") or ((process.executable like~ (\"*C:\\\\Windows\\\\system32\\\\svchost.exe\", \"*C:\\\\Windows\\\\SysWOW64\\\\svchost.exe\")) and (file.path like~ (\"*C:\\\\Program Files\\\\WindowsApps\\\\*\", \"*C:\\\\Program Files (x86)\\\\WindowsApps\\\\*\", \"*\\\\AppData\\\\Local\\\\Microsoft\\\\WindowsApps\\\\*\"))) or (process.executable like~ (\"C:\\\\Windows\\\\System32\\\\wuauclt.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\wuauclt.exe\", \"C:\\\\Windows\\\\UUS\\\\arm64\\\\wuaucltcore.exe\")) or file.path:\"*C:\\\\Windows\\\\explorer.exe\" or ((process.executable like~ (\"*C:\\\\WINDOWS\\\\system32\\\\msiexec.exe\", \"*C:\\\\WINDOWS\\\\SysWOW64\\\\msiexec.exe\")) and (file.path like~ (\"C:\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe*\", \"C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe*\", \"C:\\\\Program Files\\\\WindowsApps\\\\Microsoft.PowerShellPreview\\\\*\"))) or (file.path:\"*C:\\\\Windows\\\\System32\\\\SecurityHealth\\\\*\" and file.path:\"*\\\\SecurityHealthSystray.exe\" and process.executable:\"*\\\\SecurityHealthSetup.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/file/file_event/file_event_win_creation_system_file.eql",
  "metadata": {}
}