{
  "id": "c70b9f78-fffb-5126-9a3e-ac868280a953",
  "catalog": "sigma",
  "name": "proc_creation_win_offlinescannershell_mpclient_sideloading",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "offlinescannershell.exe"
      ],
      "raw_values": [
        "*\\\\OfflineScannerShell.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "offlinescannershell.exe"
      ],
      "raw_values": [
        "OfflineScannerShell.exe"
      ]
    },
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": ":",
      "values": [
        "c:\\\\program files\\\\windows defender\\\\offline\\\\"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Windows Defender\\\\Offline\\\\"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\OfflineScannerShell.exe\" or process.pe.original_file_name:\"OfflineScannerShell.exe\") and (not (process.working_directory:\"C:\\\\Program Files\\\\Windows Defender\\\\Offline\\\\\" or process.working_directory==\"\" or (?process.working_directory == null)))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_offlinescannershell_mpclient_sideloading.eql",
  "metadata": {}
}