{
  "id": "c9fc34c4-128c-50ba-8c8e-616e165ef1bd",
  "catalog": "sigma",
  "name": "proc_creation_win_winrar_susp_child_process",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1203"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.dll",
        "regsvr32.exe",
        "rundll32.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "Cmd.Exe",
        "cscript.exe",
        "mshta.exe",
        "PowerShell.EXE",
        "pwsh.dll",
        "regsvr32.exe",
        "RUNDLL32.EXE",
        "wscript.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "winrar.exe"
      ],
      "raw_values": [
        "*\\\\WinRAR.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\WinRAR.exe\" and ((process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regsvr32.exe\", \"*\\\\rundll32.exe\", \"*\\\\wscript.exe\")) or (process.pe.original_file_name like~ (\"Cmd.Exe\", \"cscript.exe\", \"mshta.exe\", \"PowerShell.EXE\", \"pwsh.dll\", \"regsvr32.exe\", \"RUNDLL32.EXE\", \"wscript.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_winrar_susp_child_process.eql",
  "metadata": {}
}