{
  "id": "ca2c7946-a7ba-594a-a946-d14ee9a0ba5a",
  "catalog": "sigma",
  "name": "proc_creation_win_susp_download_office_domain",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1105",
    "attack.t1608"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "curl.exe",
        "wget.exe"
      ],
      "raw_values": [
        "*\\\\curl.exe",
        "*\\\\wget.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "invoke-webrequest",
        "iwr",
        "curl",
        "wget",
        "start-bitstransfer",
        ".downloadfile(",
        ".downloadstring("
      ],
      "raw_values": [
        "*Invoke-WebRequest*",
        "*iwr *",
        "*curl *",
        "*wget *",
        "*Start-BitsTransfer*",
        "*.DownloadFile(*",
        "*.DownloadString(*",
        "*https://attachment.outlook.live.net/owa/*",
        "*https://onenoteonlinesync.onenote.com/onenoteonlinesync/*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\curl.exe\", \"*\\\\wget.exe\")) or (process.command_line like~ (\"*Invoke-WebRequest*\", \"*iwr *\", \"*curl *\", \"*wget *\", \"*Start-BitsTransfer*\", \"*.DownloadFile(*\", \"*.DownloadString(*\"))) and (process.command_line like~ (\"*https://attachment.outlook.live.net/owa/*\", \"*https://onenoteonlinesync.onenote.com/onenoteonlinesync/*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_susp_download_office_domain.eql",
  "metadata": {}
}