{
  "id": "ca3b673a-cd8b-55d1-8d66-0537f3e70c1b",
  "catalog": "sigma",
  "name": "proc_creation_win_hktl_sharpview",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1049",
    "attack.t1069.002",
    "attack.t1482",
    "attack.t1135",
    "attack.t1033"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "add-remoteconnection",
        "convert-adname",
        "convertfrom-sid",
        "convertfrom-uacvalue",
        "convert-sidtoname",
        "export-powerviewcsv",
        "find-domainobjectpropertyoutlier",
        "find-domainprocess",
        "find-domainshare",
        "find-domainuserevent",
        "find-domainuserlocation",
        "find-foreigngroup",
        "find-foreignuser",
        "find-gpocomputeradmin",
        "find-gpolocation",
        "find-interesting",
        "find-localadminaccess",
        "find-managedsecuritygroups",
        "get-cachedrdpconnection",
        "get-dfsshare",
        "get-domaincomputer",
        "get-domaincontroller",
        "get-domaindfsshare",
        "get-domaindnsrecord",
        "get-domainfileserver",
        "get-domainforeign",
        "get-domaingpo",
        "get-domaingroup",
        "get-domainguidmap",
        "get-domainmanagedsecuritygroup",
        "get-domainobject",
        "get-domainou",
        "get-domainpolicy",
        "get-domainsid",
        "get-domainsite",
        "get-domainspnticket",
        "get-domainsubnet",
        "get-domaintrust",
        "get-domainuserevent",
        "get-forestdomain",
        "get-forestglobalcatalog",
        "get-foresttrust",
        "get-gpttmpl",
        "get-groupsxml",
        "get-lastloggedon",
        "get-loggedonlocal",
        "get-netcomputer",
        "get-netdomain",
        "get-netfileserver",
        "get-netforest",
        "get-netgpo",
        "get-netgroupmember",
        "get-netlocalgroup",
        "get-netloggedon",
        "get-netou",
        "get-netprocess",
        "get-netrdpsession",
        "get-netsession",
        "get-netshare",
        "get-netsite",
        "get-netsubnet",
        "get-netuser",
        "get-pathacl",
        "get-principalcontext",
        "get-registrymounteddrive",
        "get-regloggedon",
        "get-wmiregcachedrdpconnection",
        "get-wmireglastloggedon",
        "get-wmiregmounteddrive",
        "get-wmiregproxy",
        "invoke-aclscanner",
        "invoke-checklocaladminaccess",
        "invoke-kerberoast",
        "invoke-mapdomaintrust",
        "invoke-reverttoself",
        "invoke-sharefinder",
        "invoke-userimpersonation",
        "remove-domainobjectacl",
        "remove-remoteconnection",
        "request-spnticket",
        "set-domainobject",
        "test-adminaccess"
      ],
      "raw_values": [
        "*Add-RemoteConnection*",
        "*Convert-ADName*",
        "*ConvertFrom-SID*",
        "*ConvertFrom-UACValue*",
        "*Convert-SidToName*",
        "*Export-PowerViewCSV*",
        "*Find-DomainObjectPropertyOutlier*",
        "*Find-DomainProcess*",
        "*Find-DomainShare*",
        "*Find-DomainUserEvent*",
        "*Find-DomainUserLocation*",
        "*Find-ForeignGroup*",
        "*Find-ForeignUser*",
        "*Find-GPOComputerAdmin*",
        "*Find-GPOLocation*",
        "*Find-Interesting*",
        "*Find-LocalAdminAccess*",
        "*Find-ManagedSecurityGroups*",
        "*Get-CachedRDPConnection*",
        "*Get-DFSshare*",
        "*Get-DomainComputer*",
        "*Get-DomainController*",
        "*Get-DomainDFSShare*",
        "*Get-DomainDNSRecord*",
        "*Get-DomainFileServer*",
        "*Get-DomainForeign*",
        "*Get-DomainGPO*",
        "*Get-DomainGroup*",
        "*Get-DomainGUIDMap*",
        "*Get-DomainManagedSecurityGroup*",
        "*Get-DomainObject*",
        "*Get-DomainOU*",
        "*Get-DomainPolicy*",
        "*Get-DomainSID*",
        "*Get-DomainSite*",
        "*Get-DomainSPNTicket*",
        "*Get-DomainSubnet*",
        "*Get-DomainTrust*",
        "*Get-DomainUserEvent*",
        "*Get-ForestDomain*",
        "*Get-ForestGlobalCatalog*",
        "*Get-ForestTrust*",
        "*Get-GptTmpl*",
        "*Get-GroupsXML*",
        "*Get-LastLoggedOn*",
        "*Get-LoggedOnLocal*",
        "*Get-NetComputer*",
        "*Get-NetDomain*",
        "*Get-NetFileServer*",
        "*Get-NetForest*",
        "*Get-NetGPO*",
        "*Get-NetGroupMember*",
        "*Get-NetLocalGroup*",
        "*Get-NetLoggedon*",
        "*Get-NetOU*",
        "*Get-NetProcess*",
        "*Get-NetRDPSession*",
        "*Get-NetSession*",
        "*Get-NetShare*",
        "*Get-NetSite*",
        "*Get-NetSubnet*",
        "*Get-NetUser*",
        "*Get-PathAcl*",
        "*Get-PrincipalContext*",
        "*Get-RegistryMountedDrive*",
        "*Get-RegLoggedOn*",
        "*Get-WMIRegCachedRDPConnection*",
        "*Get-WMIRegLastLoggedOn*",
        "*Get-WMIRegMountedDrive*",
        "*Get-WMIRegProxy*",
        "*Invoke-ACLScanner*",
        "*Invoke-CheckLocalAdminAccess*",
        "*Invoke-Kerberoast*",
        "*Invoke-MapDomainTrust*",
        "*Invoke-RevertToSelf*",
        "*Invoke-Sharefinder*",
        "*Invoke-UserImpersonation*",
        "*Remove-DomainObjectAcl*",
        "*Remove-RemoteConnection*",
        "*Request-SPNTicket*",
        "*Set-DomainObject*",
        "*Test-AdminAccess*"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "sharpview.exe"
      ],
      "raw_values": [
        "SharpView.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "sharpview.exe"
      ],
      "raw_values": [
        "*\\\\SharpView.exe"
      ]
    }
  ],
  "raw_query": "any where process.pe.original_file_name:\"SharpView.exe\" or process.executable:\"*\\\\SharpView.exe\" or (process.command_line like~ (\"*Add-RemoteConnection*\", \"*Convert-ADName*\", \"*ConvertFrom-SID*\", \"*ConvertFrom-UACValue*\", \"*Convert-SidToName*\", \"*Export-PowerViewCSV*\", \"*Find-DomainObjectPropertyOutlier*\", \"*Find-DomainProcess*\", \"*Find-DomainShare*\", \"*Find-DomainUserEvent*\", \"*Find-DomainUserLocation*\", \"*Find-ForeignGroup*\", \"*Find-ForeignUser*\", \"*Find-GPOComputerAdmin*\", \"*Find-GPOLocation*\", \"*Find-Interesting*\", \"*Find-LocalAdminAccess*\", \"*Find-ManagedSecurityGroups*\", \"*Get-CachedRDPConnection*\", \"*Get-DFSshare*\", \"*Get-DomainComputer*\", \"*Get-DomainController*\", \"*Get-DomainDFSShare*\", \"*Get-DomainDNSRecord*\", \"*Get-DomainFileServer*\", \"*Get-DomainForeign*\", \"*Get-DomainGPO*\", \"*Get-DomainGroup*\", \"*Get-DomainGUIDMap*\", \"*Get-DomainManagedSecurityGroup*\", \"*Get-DomainObject*\", \"*Get-DomainOU*\", \"*Get-DomainPolicy*\", \"*Get-DomainSID*\", \"*Get-DomainSite*\", \"*Get-DomainSPNTicket*\", \"*Get-DomainSubnet*\", \"*Get-DomainTrust*\", \"*Get-DomainUserEvent*\", \"*Get-ForestDomain*\", \"*Get-ForestGlobalCatalog*\", \"*Get-ForestTrust*\", \"*Get-GptTmpl*\", \"*Get-GroupsXML*\", \"*Get-LastLoggedOn*\", \"*Get-LoggedOnLocal*\", \"*Get-NetComputer*\", \"*Get-NetDomain*\", \"*Get-NetFileServer*\", \"*Get-NetForest*\", \"*Get-NetGPO*\", \"*Get-NetGroupMember*\", \"*Get-NetLocalGroup*\", \"*Get-NetLoggedon*\", \"*Get-NetOU*\", \"*Get-NetProcess*\", \"*Get-NetRDPSession*\", \"*Get-NetSession*\", \"*Get-NetShare*\", \"*Get-NetSite*\", \"*Get-NetSubnet*\", \"*Get-NetUser*\", \"*Get-PathAcl*\", \"*Get-PrincipalContext*\", \"*Get-RegistryMountedDrive*\", \"*Get-RegLoggedOn*\", \"*Get-WMIRegCachedRDPConnection*\", \"*Get-WMIRegLastLoggedOn*\", \"*Get-WMIRegMountedDrive*\", \"*Get-WMIRegProxy*\", \"*Invoke-ACLScanner*\", \"*Invoke-CheckLocalAdminAccess*\", \"*Invoke-Kerberoast*\", \"*Invoke-MapDomainTrust*\", \"*Invoke-RevertToSelf*\", \"*Invoke-Sharefinder*\", \"*Invoke-UserImpersonation*\", \"*Remove-DomainObjectAcl*\", \"*Remove-RemoteConnection*\", \"*Request-SPNTicket*\", \"*Set-DomainObject*\", \"*Test-AdminAccess*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_hktl_sharpview.eql",
  "metadata": {}
}