{
  "id": "cb2f31d5-ef5e-5916-847a-5755c1bbb819",
  "catalog": "sigma",
  "name": "proc_creation_win_wmic_recon_product",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "uninstall",
        "install"
      ],
      "raw_values": [
        "* uninstall*",
        "* install*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "*\\\\wmic.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "wmic.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "product"
      ],
      "raw_values": [
        "*Product*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\wmic.exe\" or process.pe.original_file_name:\"wmic.exe\") and process.command_line:\"*Product*\") and (not (process.command_line like~ (\"* uninstall*\", \"* install*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_wmic_recon_product.eql",
  "metadata": {}
}