{
  "id": "ccca5669-03b3-51f2-bc8f-7423086fbde0",
  "catalog": "sigma",
  "name": "image_load_apt_diamond_sleet_side_load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1574.001"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "clip.exe",
        "wsmprovhost.exe"
      ],
      "raw_values": [
        "*:\\\\ProgramData\\\\clip.exe",
        "*:\\\\ProgramData\\\\wsmprovhost.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "version.dll",
        "dsrole.dll"
      ],
      "raw_values": [
        "*:\\\\ProgramData\\\\Version.dll",
        "*:\\\\ProgramData\\\\DSROLE.dll"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*:\\\\ProgramData\\\\clip.exe\" and file.path:\"*:\\\\ProgramData\\\\Version.dll\") or (process.executable:\"*:\\\\ProgramData\\\\wsmprovhost.exe\" and file.path:\"*:\\\\ProgramData\\\\DSROLE.dll\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/TA/Diamond-Sleet/image_load_apt_diamond_sleet_side_load.eql",
  "metadata": {}
}