{
  "id": "cddd4871-be62-56b9-8b33-d4589447404e",
  "catalog": "sigma",
  "name": "proc_creation_win_powershell_reverse_shell_connection",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.dll"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "net.sockets.tcpclient",
        ".getstream(",
        ".write("
      ],
      "raw_values": [
        "* Net.Sockets.TCPClient*",
        "*.GetStream(*",
        "*.Write(*"
      ]
    }
  ],
  "raw_query": "any where ((process.pe.original_file_name like~ (\"PowerShell.EXE\", \"pwsh.dll\")) or (process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\"))) and (process.command_line:\"* Net.Sockets.TCPClient*\" and process.command_line:\"*.GetStream(*\" and process.command_line:\"*.Write(*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_powershell_reverse_shell_connection.eql",
  "metadata": {}
}