{
  "id": "ce5287ae-1989-54d6-956e-c743f871b1e0",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_qbot",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059.005"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "winrar.exe"
      ],
      "raw_values": [
        "*\\\\WinRAR.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "c ping.exe -n 6 127.0.0.1 & type",
        "regsvr32.exe",
        "programdata",
        ".tmp"
      ],
      "raw_values": [
        "* /c ping.exe -n 6 127.0.0.1 & type *",
        "*regsvr32.exe*",
        "*C:\\\\ProgramData*",
        "*.tmp*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable:\"*\\\\WinRAR.exe\" and process.executable:\"*\\\\wscript.exe\") or process.command_line:\"* /c ping.exe -n 6 127.0.0.1 & type *\" or (process.command_line:\"*regsvr32.exe*\" and process.command_line:\"*C:\\\\ProgramData*\" and process.command_line:\"*.tmp*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2019/Malware/QBot/proc_creation_win_malware_qbot.eql",
  "metadata": {}
}