{
  "id": "d06c428b-d116-5362-9bea-ea40549cf7de",
  "catalog": "sigma",
  "name": "proc_creation_win_renamed_msdt",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "msdt.exe"
      ],
      "raw_values": [
        "msdt.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msdt.exe"
      ],
      "raw_values": [
        "*\\\\msdt.exe"
      ]
    }
  ],
  "raw_query": "any where process.pe.original_file_name:\"msdt.exe\" and (not process.executable:\"*\\\\msdt.exe\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_renamed_msdt.eql",
  "metadata": {}
}