{
  "id": "d320b5f6-5a6c-58e1-b6bd-732cd9840c6b",
  "catalog": "sigma",
  "name": "LSASS Memory Dump via ProcDump",
  "description": "Detects ProcDump targeting LSASS process memory",
  "severity": "critical",
  "mitre_techniques": [
    "attack.t1003.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "Image",
      "operator": "in",
      "values": [
        "procdump.exe",
        "procdump64.exe"
      ],
      "raw_values": [
        "procdump.exe",
        "procdump64.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "CommandLine",
      "operator": "like~",
      "values": [
        "*lsass*"
      ],
      "raw_values": [
        "*lsass*"
      ]
    }
  ],
  "raw_query": "process where process.name in (\"procdump.exe\",\"procdump64.exe\") and process.command_line like~ \"*lsass*\"",
  "language": "sigma",
  "translated_query": "process where process.name in (\"procdump.exe\",\"procdump64.exe\") and process.command_line like~ \"*lsass*\"",
  "source_path": "demo",
  "metadata": {}
}