{
  "id": "d52425b3-b63c-578c-b762-3e82949ae284",
  "catalog": "sigma",
  "name": "proc_creation_win_exploit_cve_2022_41120_sysmon_eop",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "sysmon.exe",
        "sysmon64.exe"
      ],
      "raw_values": [
        "*\\\\Sysmon.exe",
        "*\\\\Sysmon64.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "sysmon.exe",
        "sysmon64.exe",
        "conhost.exe",
        "werfault.exe",
        "werfaultsecure.exe",
        "wevtutil.exe"
      ],
      "raw_values": [
        "*\\\\Sysmon.exe",
        "*\\\\Sysmon64.exe",
        "*:\\\\Windows\\\\Sysmon.exe*",
        "*:\\\\Windows\\\\Sysmon64.exe*",
        "*:\\\\Windows\\\\System32\\\\conhost.exe*",
        "*:\\\\Windows\\\\System32\\\\WerFault.exe*",
        "*:\\\\Windows\\\\System32\\\\WerFaultSecure.exe*",
        "*:\\\\Windows\\\\System32\\\\wevtutil.exe*",
        "*:\\\\Windows\\\\SysWOW64\\\\wevtutil.exe*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable like~ (\"*\\\\Sysmon.exe\", \"*\\\\Sysmon64.exe\")) and (not ((process.executable:\"C:\\\\Users\\\\*\" and process.executable:\"*\\\\AppData\\\\Local\\\\Temp\\\\*\" and (process.executable like~ (\"*\\\\Sysmon.exe\", \"*\\\\Sysmon64.exe\"))) or (process.executable like~ (\"*:\\\\Windows\\\\Sysmon.exe*\", \"*:\\\\Windows\\\\Sysmon64.exe*\", \"*:\\\\Windows\\\\System32\\\\conhost.exe*\", \"*:\\\\Windows\\\\System32\\\\WerFault.exe*\", \"*:\\\\Windows\\\\System32\\\\WerFaultSecure.exe*\", \"*:\\\\Windows\\\\System32\\\\wevtutil.exe*\", \"*:\\\\Windows\\\\SysWOW64\\\\wevtutil.exe*\")) or (?process.executable == null)))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2022/Exploits/CVE-2022-41120/proc_creation_win_exploit_cve_2022_41120_sysmon_eop.eql",
  "metadata": {}
}