{
  "id": "d773a964-1bb9-5566-ab82-7c396cd51824",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_socgholish_fakeupdates_activity",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1059.001"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": "like~",
      "values": [
        "chrome",
        "edge",
        "firefox",
        "opera",
        "brave",
        "vivaldi"
      ],
      "raw_values": [
        "*Chrome*",
        "*Edge*",
        "*Firefox*",
        "*Opera*",
        "*Brave*",
        "*Vivaldi*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": ":",
      "values": [
        "temp",
        ".zip",
        "update",
        ".js"
      ],
      "raw_values": [
        "*\\\\AppData\\\\Local\\\\Temp*",
        "*.zip*",
        "*update*",
        "*.js*"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\wscript.exe\" and (process.parent.command_line:\"*\\\\AppData\\\\Local\\\\Temp*\" and process.parent.command_line:\"*.zip*\" and process.parent.command_line:\"*update*\" and process.parent.command_line:\"*.js*\") and (process.parent.command_line like~ (\"*Chrome*\", \"*Edge*\", \"*Firefox*\", \"*Opera*\", \"*Brave*\", \"*Vivaldi*\")) and (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2022/Malware/SocGholish/proc_creation_win_malware_socgholish_fakeupdates_activity.eql",
  "metadata": {}
}