{
  "id": "d90381be-df19-568c-a957-df6eea673659",
  "catalog": "sigma",
  "name": "win_firewall_as_setting_change",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "like~",
      "values": [
        "2002",
        "2083",
        "2003",
        "2082",
        "2008"
      ],
      "raw_values": [
        "2002",
        "2083",
        "2003",
        "2082",
        "2008"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-windows firewall with advanced security/firewall"
      ],
      "raw_values": [
        "Microsoft-Windows-Windows Firewall With Advanced Security/Firewall"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-Windows Firewall With Advanced Security/Firewall\" and (event.code like~ (\"2002\", \"2083\", \"2003\", \"2082\", \"2008\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/firewall_as/win_firewall_as_setting_change.eql",
  "metadata": {}
}