{
  "id": "db001c60-407b-5d0d-9a38-4294a866c60f",
  "catalog": "sigma",
  "name": "proc_creation_win_tasklist_basic_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "tasklist"
      ],
      "raw_values": [
        "*tasklist*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "tasklist.exe"
      ],
      "raw_values": [
        "*\\\\tasklist.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "tasklist.exe"
      ],
      "raw_values": [
        "tasklist.exe"
      ]
    }
  ],
  "raw_query": "any where process.command_line:\"*tasklist*\" or process.executable:\"*\\\\tasklist.exe\" or process.pe.original_file_name:\"tasklist.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_tasklist_basic_execution.eql",
  "metadata": {}
}