{
  "id": "dc04087a-dda9-5f98-8ac4-6d69108222cc",
  "catalog": "sigma",
  "name": "proc_creation_win_splwow64_cli_anomaly",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1202"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "splwow64.exe"
      ],
      "raw_values": [
        "*\\\\splwow64.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "splwow64.exe"
      ],
      "raw_values": [
        "*splwow64.exe"
      ]
    }
  ],
  "raw_query": "any where process.executable:\"*\\\\splwow64.exe\" and process.command_line:\"*splwow64.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_splwow64_cli_anomaly.eql",
  "metadata": {}
}