{
  "id": "dcf6fd56-41c8-5fd2-93b4-2835e979d35d",
  "catalog": "sigma",
  "name": "proc_creation_win_ieexec_download",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1105"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "ieexec.exe"
      ],
      "raw_values": [
        "*\\\\IEExec.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "ieexec.exe"
      ],
      "raw_values": [
        "IEExec.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\IEExec.exe\" or process.pe.original_file_name:\"IEExec.exe\") and (process.command_line like~ (\"*http://*\", \"*https://*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_ieexec_download.eql",
  "metadata": {}
}