{
  "id": "dd6bfd19-f7c3-5ed9-8a6c-4e0cfede1073",
  "catalog": "sigma",
  "name": "win_security_mal_creddumper",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1003.001",
    "attack.t1003.002",
    "attack.t1003.004",
    "attack.t1003.005",
    "attack.t1003.006",
    "attack.t1569.002"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.servicefilename",
      "raw_field": "winlog.event_data.ServiceFileName",
      "operator": "like~",
      "values": [
        "cachedump",
        "dumpsvc",
        "fgexec",
        "gsecdump",
        "mimidrv",
        "pwdump",
        "servpw"
      ],
      "raw_values": [
        "*cachedump*",
        "*dumpsvc*",
        "*fgexec*",
        "*gsecdump*",
        "*mimidrv*",
        "*pwdump*",
        "*servpw*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4697"
      ],
      "raw_values": [
        "4697"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4697\" and (winlog.event_data.ServiceFileName like~ (\"*cachedump*\", \"*dumpsvc*\", \"*fgexec*\", \"*gsecdump*\", \"*mimidrv*\", \"*pwdump*\", \"*servpw*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_mal_creddumper.eql",
  "metadata": {}
}