{
  "id": "de7f88da-72c1-5f15-9904-421221d81ce2",
  "catalog": "sigma",
  "name": "Mimikatz Credential Dumping",
  "description": "Detects execution of Mimikatz for credential dumping",
  "severity": "critical",
  "mitre_techniques": [
    "attack.t1003.001"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "Image",
      "operator": "==",
      "values": [
        "mimikatz.exe"
      ],
      "raw_values": [
        "mimikatz.exe"
      ]
    }
  ],
  "raw_query": "process where process.name == \"mimikatz.exe\"",
  "language": "sigma",
  "translated_query": "process where process.name == \"mimikatz.exe\"",
  "source_path": "demo",
  "metadata": {}
}