{
  "id": "df1efe99-c9fd-58b3-9833-abed2aea96b0",
  "catalog": "sigma",
  "name": "win_susp_ntlm_brute_force",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1110"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "source.domain",
      "raw_field": "source.domain",
      "operator": "like~",
      "values": [
        "rdesktop",
        "remmina",
        "freerdp",
        "windows7",
        "windows8",
        "windows2012",
        "windows2016",
        "windows2019"
      ],
      "raw_values": [
        "Rdesktop",
        "Remmina",
        "Freerdp",
        "Windows7",
        "Windows8",
        "Windows2012",
        "Windows2016",
        "Windows2019"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-ntlm/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-NTLM/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "8004"
      ],
      "raw_values": [
        "8004"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-NTLM/Operational\" and (event.code:\"8004\" and (source.domain like~ (\"Rdesktop\", \"Remmina\", \"Freerdp\", \"Windows7\", \"Windows8\", \"Windows2012\", \"Windows2016\", \"Windows2019\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/ntlm/win_susp_ntlm_brute_force.eql",
  "metadata": {}
}