{
  "id": "df3b2cce-36ca-5b18-9e5a-2118fd8f0ec5",
  "catalog": "sigma",
  "name": "file_event_win_susp_legitimate_app_dropping_exe",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1218"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "eqnedt32.exe",
        "wordpad.exe",
        "wordview.exe",
        "certutil.exe",
        "certoc.exe",
        "certreq.exe",
        "desktopimgdownldr.exe",
        "esentutl.exe",
        "mshta.exe",
        "acrord32.exe",
        "rdrcef.exe",
        "hh.exe",
        "finger.exe"
      ],
      "raw_values": [
        "*\\\\eqnedt32.exe",
        "*\\\\wordpad.exe",
        "*\\\\wordview.exe",
        "*\\\\certutil.exe",
        "*\\\\certoc.exe",
        "*\\\\CertReq.exe",
        "*\\\\Desktopimgdownldr.exe",
        "*\\\\esentutl.exe",
        "*\\\\mshta.exe",
        "*\\\\AcroRd32.exe",
        "*\\\\RdrCEF.exe",
        "*\\\\hh.exe",
        "*\\\\finger.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".exe",
        ".dll",
        ".ocx"
      ],
      "raw_values": [
        "*.exe",
        "*.dll",
        "*.ocx"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\eqnedt32.exe\", \"*\\\\wordpad.exe\", \"*\\\\wordview.exe\", \"*\\\\certutil.exe\", \"*\\\\certoc.exe\", \"*\\\\CertReq.exe\", \"*\\\\Desktopimgdownldr.exe\", \"*\\\\esentutl.exe\", \"*\\\\mshta.exe\", \"*\\\\AcroRd32.exe\", \"*\\\\RdrCEF.exe\", \"*\\\\hh.exe\", \"*\\\\finger.exe\")) and (file.path like~ (\"*.exe\", \"*.dll\", \"*.ocx\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/file/file_event/file_event_win_susp_legitimate_app_dropping_exe.eql",
  "metadata": {}
}