{
  "id": "df6d5103-21cc-5435-9cba-9bce844f257f",
  "catalog": "sigma",
  "name": "file_event_win_susp_legitimate_app_dropping_script",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "eqnedt32.exe",
        "wordpad.exe",
        "wordview.exe",
        "certutil.exe",
        "certoc.exe",
        "certreq.exe",
        "desktopimgdownldr.exe",
        "esentutl.exe",
        "mshta.exe",
        "acrord32.exe",
        "rdrcef.exe",
        "hh.exe",
        "finger.exe"
      ],
      "raw_values": [
        "*\\\\eqnedt32.exe",
        "*\\\\wordpad.exe",
        "*\\\\wordview.exe",
        "*\\\\certutil.exe",
        "*\\\\certoc.exe",
        "*\\\\CertReq.exe",
        "*\\\\Desktopimgdownldr.exe",
        "*\\\\esentutl.exe",
        "*\\\\mshta.exe",
        "*\\\\AcroRd32.exe",
        "*\\\\RdrCEF.exe",
        "*\\\\hh.exe",
        "*\\\\finger.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".ps1",
        ".bat",
        ".vbs",
        ".scf",
        ".wsf",
        ".wsh"
      ],
      "raw_values": [
        "*.ps1",
        "*.bat",
        "*.vbs",
        "*.scf",
        "*.wsf",
        "*.wsh"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\eqnedt32.exe\", \"*\\\\wordpad.exe\", \"*\\\\wordview.exe\", \"*\\\\certutil.exe\", \"*\\\\certoc.exe\", \"*\\\\CertReq.exe\", \"*\\\\Desktopimgdownldr.exe\", \"*\\\\esentutl.exe\", \"*\\\\mshta.exe\", \"*\\\\AcroRd32.exe\", \"*\\\\RdrCEF.exe\", \"*\\\\hh.exe\", \"*\\\\finger.exe\")) and (file.path like~ (\"*.ps1\", \"*.bat\", \"*.vbs\", \"*.scf\", \"*.wsf\", \"*.wsh\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/file/file_event/file_event_win_susp_legitimate_app_dropping_script.eql",
  "metadata": {}
}