{
  "id": "e13bbba6-9dc4-5c8a-a986-14262cf63c81",
  "catalog": "sigma",
  "name": "proc_creation_win_certutil_download_file_sharing_domains",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "urlcache",
        "verifyctl",
        "url",
        ".githubusercontent.com",
        "anonfiles.com",
        "cdn.discordapp.com",
        "ddns.net",
        "dl.dropboxusercontent.com",
        "ghostbin.co",
        "github.com",
        "glitch.me",
        "gofile.io",
        "hastebin.com",
        "mediafire.com",
        "mega.nz",
        "onrender.com",
        "pages.dev",
        "paste.ee",
        "pastebin.com",
        "pastebin.pl",
        "pastetext.net",
        "privatlab.com",
        "privatlab.net",
        "send.exploit.in",
        "sendspace.com",
        "storage.googleapis.com",
        "storjshare.io",
        "supabase.co",
        "temp.sh",
        "transfer.sh",
        "trycloudflare.com",
        "ufile.io",
        "w3spaces.com",
        "workers.dev"
      ],
      "raw_values": [
        "*urlcache *",
        "*verifyctl *",
        "*URL *",
        "*.githubusercontent.com*",
        "*anonfiles.com*",
        "*cdn.discordapp.com*",
        "*ddns.net*",
        "*dl.dropboxusercontent.com*",
        "*ghostbin.co*",
        "*github.com*",
        "*glitch.me*",
        "*gofile.io*",
        "*hastebin.com*",
        "*mediafire.com*",
        "*mega.nz*",
        "*onrender.com*",
        "*pages.dev*",
        "*paste.ee*",
        "*pastebin.com*",
        "*pastebin.pl*",
        "*pastetext.net*",
        "*privatlab.com*",
        "*privatlab.net*",
        "*send.exploit.in*",
        "*sendspace.com*",
        "*storage.googleapis.com*",
        "*storjshare.io*",
        "*supabase.co*",
        "*temp.sh*",
        "*transfer.sh*",
        "*trycloudflare.com*",
        "*ufile.io*",
        "*w3spaces.com*",
        "*workers.dev*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "*\\\\certutil.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "CertUtil.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\certutil.exe\" or process.pe.original_file_name:\"CertUtil.exe\") and (process.command_line like~ (\"*urlcache *\", \"*verifyctl *\", \"*URL *\")) and (process.command_line like~ (\"*.githubusercontent.com*\", \"*anonfiles.com*\", \"*cdn.discordapp.com*\", \"*ddns.net*\", \"*dl.dropboxusercontent.com*\", \"*ghostbin.co*\", \"*github.com*\", \"*glitch.me*\", \"*gofile.io*\", \"*hastebin.com*\", \"*mediafire.com*\", \"*mega.nz*\", \"*onrender.com*\", \"*pages.dev*\", \"*paste.ee*\", \"*pastebin.com*\", \"*pastebin.pl*\", \"*pastetext.net*\", \"*privatlab.com*\", \"*privatlab.net*\", \"*send.exploit.in*\", \"*sendspace.com*\", \"*storage.googleapis.com*\", \"*storjshare.io*\", \"*supabase.co*\", \"*temp.sh*\", \"*transfer.sh*\", \"*trycloudflare.com*\", \"*ufile.io*\", \"*w3spaces.com*\", \"*workers.dev*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_certutil_download_file_sharing_domains.eql",
  "metadata": {}
}