{
  "id": "e1ec184f-823f-5864-a272-cef40e24d0ab",
  "catalog": "sigma",
  "name": "win_codeintegrity_unsigned_driver_loaded",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-codeintegrity/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-CodeIntegrity/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "3001"
      ],
      "raw_values": [
        "3001"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-CodeIntegrity/Operational\" and event.code:\"3001\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/code_integrity/win_codeintegrity_unsigned_driver_loaded.eql",
  "metadata": {}
}