{
  "id": "e2f9b982-861b-5984-9a66-9489c643d0db",
  "catalog": "sigma",
  "name": "proc_creation_win_susp_network_sniffing",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "tshark.exe",
        "windump.exe"
      ],
      "raw_values": [
        "*\\\\tshark.exe",
        "*\\\\windump.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\tshark.exe\" and process.command_line:\"*-i*\") or process.executable:\"*\\\\windump.exe\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_susp_network_sniffing.eql",
  "metadata": {}
}