{
  "id": "e383194d-42c2-5dd2-8622-5f8c27ec6662",
  "catalog": "sigma",
  "name": "proc_creation_win_exploit_cve_2020_1350",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1190",
    "attack.t1569.002"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "werfault.exe",
        "conhost.exe",
        "dnscmd.exe",
        "dns.exe"
      ],
      "raw_values": [
        "*\\\\System32\\\\werfault.exe",
        "*\\\\System32\\\\conhost.exe",
        "*\\\\System32\\\\dnscmd.exe",
        "*\\\\System32\\\\dns.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "dns.exe"
      ],
      "raw_values": [
        "*\\\\System32\\\\dns.exe"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\System32\\\\dns.exe\" and (not (process.executable like~ (\"*\\\\System32\\\\werfault.exe\", \"*\\\\System32\\\\conhost.exe\", \"*\\\\System32\\\\dnscmd.exe\", \"*\\\\System32\\\\dns.exe\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2020/Exploits/CVE-2020-1350/proc_creation_win_exploit_cve_2020_1350.eql",
  "metadata": {}
}