{
  "id": "e7471c85-8fd9-55b6-9530-0fbd57e86ab3",
  "catalog": "sigma",
  "name": "Suspicious Mshta Execution",
  "description": "Detects mshta.exe executing remote scripts",
  "severity": "high",
  "mitre_techniques": [
    "attack.t1218.005"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "Image",
      "operator": "==",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "mshta.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "CommandLine",
      "operator": "like~",
      "values": [
        "*http*",
        "*vbscript*"
      ],
      "raw_values": [
        "*http*",
        "*vbscript*"
      ]
    }
  ],
  "raw_query": "process where process.name == \"mshta.exe\" and process.command_line like~ \"*http*\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "demo",
  "metadata": {}
}