{
  "id": "e77bb06a-ca5f-50d1-974b-e7248b4d3e78",
  "catalog": "sigma",
  "name": "proc_creation_win_whoami_groups_discovery",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1033"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "groups",
        "-groups"
      ],
      "raw_values": [
        "* /groups*",
        "* -groups*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "whoami.exe"
      ],
      "raw_values": [
        "*\\\\whoami.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "whoami.exe"
      ],
      "raw_values": [
        "whoami.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\whoami.exe\" or process.pe.original_file_name:\"whoami.exe\") and (process.command_line like~ (\"* /groups*\", \"* -groups*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_whoami_groups_discovery.eql",
  "metadata": {}
}