{
  "id": "e81fb9fb-8aee-53c3-abff-61a523a08ba3",
  "catalog": "sigma",
  "name": "proc_creation_win_mshta_http",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "*\\\\mshta.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "MSHTA.EXE"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\mshta.exe\" or process.pe.original_file_name:\"MSHTA.EXE\") and (process.command_line like~ (\"*http://*\", \"*https://*\", \"*ftp://*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_mshta_http.eql",
  "metadata": {}
}