{
  "id": "ea5cde26-1112-5a69-9ee8-7c47239c9834",
  "catalog": "sigma",
  "name": "win_system_apt_stonedrill",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1543.003"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    },
    {
      "field": "winlog.event_data.servicename",
      "raw_field": "winlog.event_data.ServiceName",
      "operator": ":",
      "values": [
        "ntssrv"
      ],
      "raw_values": [
        "NtsSrv"
      ]
    },
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": ":",
      "values": [
        "localservice"
      ],
      "raw_values": [
        "* LocalService"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"System\" and (winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\" and winlog.event_data.ServiceName:\"NtsSrv\" and winlog.event_data.ImagePath:\"* LocalService\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2017/Malware/StoneDrill/win_system_apt_stonedrill.eql",
  "metadata": {}
}