{
  "id": "eb733503-dd0c-5d6e-8837-5d141dffaa8a",
  "catalog": "sigma",
  "name": "proc_creation_win_powershell_cl_mutexverifiers",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "powershell.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "-nologo -windowstyle minimized -file"
      ],
      "raw_values": [
        "* -nologo -windowstyle minimized -file *"
      ]
    }
  ],
  "raw_query": "any where ((process.parent.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and process.executable:\"*\\\\powershell.exe\" and process.command_line:\"* -nologo -windowstyle minimized -file *\") and (process.command_line like~ (\"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\Windows\\\\Temp\\\\*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_powershell_cl_mutexverifiers.eql",
  "metadata": {}
}