{
  "id": "ede3651f-bff2-592d-bd53-62100d8334aa",
  "catalog": "sigma",
  "name": "proc_creation_win_lolbin_syncappvpublishingserver_execute_psh",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "syncappvpublishingserver.exe"
      ],
      "raw_values": [
        "*\\\\SyncAppvPublishingServer.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "syncappvpublishingserver.exe"
      ],
      "raw_values": [
        "syncappvpublishingserver.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable:\"*\\\\SyncAppvPublishingServer.exe\" or process.pe.original_file_name:\"syncappvpublishingserver.exe\") and process.command_line:\"*\\\"n; *\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_lolbin_syncappvpublishingserver_execute_psh.eql",
  "metadata": {}
}