{
  "id": "ef3bb95a-2404-5f5c-bab8-a9bc2c9b70fb",
  "catalog": "sigma",
  "name": "proc_creation_win_susp_service_dir",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1202"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "$recycle.bin"
      ],
      "raw_values": [
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\$Recycle.bin*",
        "*\\\\Users\\\\All Users\\\\*",
        "*\\\\Users\\\\Default\\\\*",
        "*\\\\Users\\\\Contacts\\\\*",
        "*\\\\Users\\\\Searches\\\\*",
        "*C:\\\\Perflogs\\\\*",
        "*\\\\config\\\\systemprofile\\\\*",
        "*\\\\Windows\\\\Fonts\\\\*",
        "*\\\\Windows\\\\IME\\\\*",
        "*\\\\Windows\\\\addins\\\\*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like~",
      "values": [
        "services.exe",
        "svchost.exe"
      ],
      "raw_values": [
        "*\\\\services.exe",
        "*\\\\svchost.exe"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\Users\\\\Public\\\\*\", \"*\\\\$Recycle.bin*\", \"*\\\\Users\\\\All Users\\\\*\", \"*\\\\Users\\\\Default\\\\*\", \"*\\\\Users\\\\Contacts\\\\*\", \"*\\\\Users\\\\Searches\\\\*\", \"*C:\\\\Perflogs\\\\*\", \"*\\\\config\\\\systemprofile\\\\*\", \"*\\\\Windows\\\\Fonts\\\\*\", \"*\\\\Windows\\\\IME\\\\*\", \"*\\\\Windows\\\\addins\\\\*\")) and (process.parent.executable like~ (\"*\\\\services.exe\", \"*\\\\svchost.exe\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_susp_service_dir.eql",
  "metadata": {}
}