{
  "id": "efa71841-c993-50fb-a731-089df55eb400",
  "catalog": "sigma",
  "name": "win_audit_cve",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1203",
    "attack.t1068",
    "attack.t1211",
    "attack.t1212",
    "attack.t1210",
    "attack.t1499.004"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": "like~",
      "values": [
        "microsoft-windows-audit-cve",
        "audit-cve"
      ],
      "raw_values": [
        "Microsoft-Windows-Audit-CVE",
        "Audit-CVE"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "application"
      ],
      "raw_values": [
        "Application"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Application\" and ((winlog.provider_name like~ (\"Microsoft-Windows-Audit-CVE\", \"Audit-CVE\")) and event.code:\"1\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/application/microsoft-windows_audit_cve/win_audit_cve.eql",
  "metadata": {}
}