{
  "id": "f171f2f2-755b-5668-9b1e-8fd1da024c9e",
  "catalog": "sigma",
  "name": "proc_creation_win_atbroker_uncommon_ats_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "animations",
        "audiodescription",
        "caretbrowsing",
        "caretwidth",
        "colorfiltering",
        "cursorindicator",
        "cursorscheme",
        "filterkeys",
        "focusborderheight",
        "focusborderwidth",
        "highcontrast",
        "keyboardcues",
        "keyboardpref",
        "livecaptions",
        "magnifierpane",
        "messageduration",
        "minimumhitradius",
        "mousekeys",
        "narrator",
        "osk",
        "overlappedcontent",
        "showsounds",
        "soundsentry",
        "speechreco",
        "stickykeys",
        "togglekeys",
        "voiceaccess",
        "windowarranging",
        "windowtracking",
        "windowtrackingtimeout",
        "windowtrackingzorder"
      ],
      "raw_values": [
        "*animations*",
        "*audiodescription*",
        "*caretbrowsing*",
        "*caretwidth*",
        "*colorfiltering*",
        "*cursorindicator*",
        "*cursorscheme*",
        "*filterkeys*",
        "*focusborderheight*",
        "*focusborderwidth*",
        "*highcontrast*",
        "*keyboardcues*",
        "*keyboardpref*",
        "*livecaptions*",
        "*magnifierpane*",
        "*messageduration*",
        "*minimumhitradius*",
        "*mousekeys*",
        "*Narrator*",
        "*osk*",
        "*overlappedcontent*",
        "*showsounds*",
        "*soundsentry*",
        "*speechreco*",
        "*stickykeys*",
        "*togglekeys*",
        "*voiceaccess*",
        "*windowarranging*",
        "*windowtracking*",
        "*windowtrackingtimeout*",
        "*windowtrackingzorder*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "atbroker.exe"
      ],
      "raw_values": [
        "*\\\\AtBroker.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "atbroker.exe"
      ],
      "raw_values": [
        "AtBroker.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "start",
        "oracle_javaaccessbridge"
      ],
      "raw_values": [
        "*start*",
        "*Oracle_JavaAccessBridge*"
      ]
    }
  ],
  "raw_query": "any where ((process.executable:\"*\\\\AtBroker.exe\" or process.pe.original_file_name:\"AtBroker.exe\") and process.command_line:\"*start*\") and (not (process.command_line like~ (\"*animations*\", \"*audiodescription*\", \"*caretbrowsing*\", \"*caretwidth*\", \"*colorfiltering*\", \"*cursorindicator*\", \"*cursorscheme*\", \"*filterkeys*\", \"*focusborderheight*\", \"*focusborderwidth*\", \"*highcontrast*\", \"*keyboardcues*\", \"*keyboardpref*\", \"*livecaptions*\", \"*magnifierpane*\", \"*messageduration*\", \"*minimumhitradius*\", \"*mousekeys*\", \"*Narrator*\", \"*osk*\", \"*overlappedcontent*\", \"*showsounds*\", \"*soundsentry*\", \"*speechreco*\", \"*stickykeys*\", \"*togglekeys*\", \"*voiceaccess*\", \"*windowarranging*\", \"*windowtracking*\", \"*windowtrackingtimeout*\", \"*windowtrackingzorder*\"))) and (not process.command_line:\"*Oracle_JavaAccessBridge*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_atbroker_uncommon_ats_execution.eql",
  "metadata": {}
}