{
  "id": "f5092bb4-c32c-5226-94da-0beb81c75572",
  "catalog": "sigma",
  "name": "win_application_exploit_cve_2023_40477_winrar_crash",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.appversion",
      "raw_field": "winlog.event_data.AppVersion",
      "operator": "like~",
      "values": [
        "6.23.",
        "6.24.",
        "6.25.",
        "6.26."
      ],
      "raw_values": [
        "6.23.*",
        "6.24.*",
        "6.25.*",
        "6.26.*",
        "7.*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "application"
      ],
      "raw_values": [
        "Application"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "application error"
      ],
      "raw_values": [
        "Application Error"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "1000"
      ],
      "raw_values": [
        "1000"
      ]
    },
    {
      "field": "winlog.event_data.appname",
      "raw_field": "winlog.event_data.AppName",
      "operator": ":",
      "values": [
        "winrar.exe"
      ],
      "raw_values": [
        "WinRAR.exe"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Application\" and ((winlog.provider_name:\"Application Error\" and event.code:\"1000\" and winlog.event_data.AppName:\"WinRAR.exe\") and (not (winlog.event_data.AppVersion like~ (\"6.23.*\", \"6.24.*\", \"6.25.*\", \"6.26.*\", \"7.*\"))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Exploits/CVE-2023-40477/win_application_exploit_cve_2023_40477_winrar_crash.eql",
  "metadata": {}
}