{
  "id": "f8ebb0d6-4ba8-5d54-94d1-59be294e7d98",
  "catalog": "sigma",
  "name": "registry_event_mal_azorult",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "registry"
  ],
  "conditions": [
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": ":",
      "values": [
        "system\\\\",
        "\\\\services\\\\localnetservice"
      ],
      "raw_values": [
        "*SYSTEM\\\\*",
        "*\\\\services\\\\localNETService"
      ]
    }
  ],
  "raw_query": "any where (event.code like~ (\"12\", \"13\")) and registry.path:\"*SYSTEM\\\\*\" and registry.path:\"*\\\\services\\\\localNETService\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/registry/registry_event/registry_event_mal_azorult.eql",
  "metadata": {}
}