{
  "id": "f941dc3b-ee47-55f4-8ae9-475d0d9522bc",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_serpent_backdoor_payload_execution",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1053.005",
    "attack.t1059.006"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "eventid=",
        "create",
        "delete",
        "tn run"
      ],
      "raw_values": [
        "*[System/EventID=*",
        "*/create*",
        "*/delete*",
        "*/ec*",
        "*/so*",
        "*/tn run*"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\")) and (process.command_line:\"*[System/EventID=*\" and process.command_line:\"*/create*\" and process.command_line:\"*/delete*\" and process.command_line:\"*/ec*\" and process.command_line:\"*/so*\" and process.command_line:\"*/tn run*\")",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2022/Malware/Serpent-Backdoor/proc_creation_win_malware_serpent_backdoor_payload_execution.eql",
  "metadata": {}
}