{
  "id": "fc9ebfe0-8665-5f4c-8140-68d1e8dff362",
  "catalog": "sigma",
  "name": "win_security_alert_enable_weak_encryption",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1562.001"
  ],
  "event_categories": [
    "builtin"
  ],
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4738"
      ],
      "raw_values": [
        "4738"
      ]
    }
  ],
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4738\" and (((winlog.event_data.NewUacValue like~ (\"*8???\", \"*9???\", \"*A???\", \"*B???\", \"*C???\", \"*D???\", \"*E???\", \"*F???\")) and (not (winlog.event_data.OldUacValue like~ (\"*8???\", \"*9???\", \"*A???\", \"*B???\", \"*C???\", \"*D???\", \"*E???\", \"*F???\")))) or ((winlog.event_data.NewUacValue like~ (\"*1????\", \"*3????\", \"*5????\", \"*7????\", \"*9????\", \"*B????\", \"*D????\", \"*F????\")) and (not (winlog.event_data.OldUacValue like~ (\"*1????\", \"*3????\", \"*5????\", \"*7????\", \"*9????\", \"*B????\", \"*D????\", \"*F????\")))) or ((winlog.event_data.NewUacValue like~ (\"*8??\", \"*9??\", \"*A??\", \"*B??\", \"*C??\", \"*D??\", \"*E??\", \"*F??\")) and (not (winlog.event_data.OldUacValue like~ (\"*8??\", \"*9??\", \"*A??\", \"*B??\", \"*C??\", \"*D??\", \"*E??\", \"*F??\"))))))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/builtin/security/win_security_alert_enable_weak_encryption.eql",
  "metadata": {}
}