{
  "id": "fd03be91-8d1c-5ec2-ad08-209b6dc4a151",
  "catalog": "sigma",
  "name": "proc_creation_win_malware_pikabot_rundll32_hollowing",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1055.012"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "searchfilterhost.exe",
        "searchprotocolhost.exe",
        "sndvol.exe",
        "wermgr.exe",
        "wwahost.exe"
      ],
      "raw_values": [
        "*\\\\SearchFilterHost.exe",
        "*\\\\SearchProtocolHost.exe",
        "*\\\\sndvol.exe",
        "*\\\\wermgr.exe",
        "*\\\\wwahost.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "sndvol.exe"
      ],
      "raw_values": [
        "*\\\\sndvol.exe"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": ":",
      "values": [
        "mmsys.cpl"
      ],
      "raw_values": [
        "*mmsys.cpl*"
      ]
    }
  ],
  "raw_query": "any where (process.parent.executable:\"*\\\\rundll32.exe\" and (process.executable like~ (\"*\\\\SearchFilterHost.exe\", \"*\\\\SearchProtocolHost.exe\", \"*\\\\sndvol.exe\", \"*\\\\wermgr.exe\", \"*\\\\wwahost.exe\"))) and (not (process.executable:\"*\\\\sndvol.exe\" and process.parent.command_line:\"*mmsys.cpl*\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Malware/Pikabot/proc_creation_win_malware_pikabot_rundll32_hollowing.eql",
  "metadata": {}
}