{
  "id": "ff42e4d0-c62a-50e7-85e5-76e811ef69c5",
  "catalog": "sigma",
  "name": "proc_creation_win_susp_script_exec_from_env_folder",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cscript.exe",
        "mshta.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-ep bypass",
        "-executionpolicy bypass",
        "-w hidden",
        "e:javascript",
        "e:jscript",
        "e:vbscript",
        "temp",
        "temporary internet"
      ],
      "raw_values": [
        "* -ep bypass *",
        "* -ExecutionPolicy bypass *",
        "* -w hidden *",
        "*/e:javascript *",
        "*/e:Jscript *",
        "*/e:vbscript *",
        "*:\\\\Perflogs\\\\*",
        "*:\\\\Users\\\\Public\\\\*",
        "*\\\\AppData\\\\Local\\\\Temp*",
        "*\\\\AppData\\\\Roaming\\\\Temp*",
        "*\\\\Temporary Internet*",
        "*\\\\Windows\\\\Temp*"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "cscript.exe",
        "mshta.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "cscript.exe",
        "mshta.exe",
        "wscript.exe"
      ]
    }
  ],
  "raw_query": "any where ((process.executable like~ (\"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\wscript.exe\")) or (process.command_line like~ (\"* -ep bypass *\", \"* -ExecutionPolicy bypass *\", \"* -w hidden *\", \"*/e:javascript *\", \"*/e:Jscript *\", \"*/e:vbscript *\")) or (process.pe.original_file_name like~ (\"cscript.exe\", \"mshta.exe\", \"wscript.exe\"))) and ((process.command_line like~ (\"*:\\\\Perflogs\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp*\", \"*\\\\AppData\\\\Roaming\\\\Temp*\", \"*\\\\Temporary Internet*\", \"*\\\\Windows\\\\Temp*\")) or ((process.command_line:\"*:\\\\Users\\\\*\" and process.command_line:\"*\\\\Favorites\\\\*\") or (process.command_line:\"*:\\\\Users\\\\*\" and process.command_line:\"*\\\\Favourites\\\\*\") or (process.command_line:\"*:\\\\Users\\\\*\" and process.command_line:\"*\\\\Contacts\\\\*\")))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/process_creation/proc_creation_win_susp_script_exec_from_env_folder.eql",
  "metadata": {}
}