{
  "id": "ff5e135b-9237-5be5-bc1b-9b885909a35d",
  "catalog": "sigma",
  "name": "image_load_susp_script_dotnet_clr_dll_load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1055"
  ],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmstp.exe",
        "cscript.exe",
        "mshta.exe",
        "msxsl.exe",
        "regsvr32.exe",
        "wmic.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\cmstp.exe",
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\msxsl.exe",
        "*\\\\regsvr32.exe",
        "*\\\\wmic.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "clr.dll",
        "mscoree.dll",
        "mscorlib.dll"
      ],
      "raw_values": [
        "*\\\\clr.dll",
        "*\\\\mscoree.dll",
        "*\\\\mscorlib.dll"
      ]
    }
  ],
  "raw_query": "any where (process.executable like~ (\"*\\\\cmstp.exe\", \"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\msxsl.exe\", \"*\\\\regsvr32.exe\", \"*\\\\wmic.exe\", \"*\\\\wscript.exe\")) and (file.path like~ (\"*\\\\clr.dll\", \"*\\\\mscoree.dll\", \"*\\\\mscorlib.dll\"))",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules/windows/image_load/image_load_susp_script_dotnet_clr_dll_load.eql",
  "metadata": {}
}