{
  "id": "ff7f4365-e082-5452-9bc9-3af5d8a8dd83",
  "catalog": "sigma",
  "name": "net_connection_win_malware_pikabot_rundll32_activity",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.t1573"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "searchfilterhost.exe",
        "searchprotocolhost.exe",
        "sndvol.exe",
        "wermgr.exe",
        "wwahost.exe"
      ],
      "raw_values": [
        "*\\\\SearchFilterHost.exe",
        "*\\\\SearchProtocolHost.exe",
        "*\\\\sndvol.exe",
        "*\\\\wermgr.exe",
        "*\\\\wwahost.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "network.transport",
      "raw_field": "network.transport",
      "operator": ":",
      "values": [
        "tcp"
      ],
      "raw_values": [
        "tcp"
      ]
    }
  ],
  "raw_query": "any where process.parent.executable:\"*\\\\rundll32.exe\" and (process.executable like~ (\"*\\\\SearchFilterHost.exe\", \"*\\\\SearchProtocolHost.exe\", \"*\\\\sndvol.exe\", \"*\\\\wermgr.exe\", \"*\\\\wwahost.exe\")) and network.transport:\"tcp\" and network.direction:\"true\"",
  "language": "sigma",
  "translated_query": null,
  "source_path": "rules-emerging-threats/2023/Malware/Pikabot/net_connection_win_malware_pikabot_rundll32_activity.eql",
  "metadata": {}
}