{
  "source": "sigma",
  "name": "create_stream_hash_regedit_export_to_ads",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/create_stream_hash/create_stream_hash_regedit_export_to_ads.eql",
  "raw_query": "any where process.executable:\"*\\\\regedit.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "regedit.exe"
      ],
      "raw_values": [
        "*\\\\regedit.exe"
      ]
    }
  ]
}