{
  "source": "sigma",
  "name": "file_access_win_susp_credhist",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_access/file_access_win_susp_credhist.eql",
  "raw_query": "any where file.path:\"*\\\\Microsoft\\\\Protect\\\\CREDHIST\" and (not ((process.executable like~ (\"C:\\\\Program Files\\\\*\", \"C:\\\\Program Files (x86)\\\\*\", \"C:\\\\Windows\\\\system32\\\\*\", \"C:\\\\Windows\\\\SysWOW64\\\\*\")) or process.executable:\"C:\\\\Windows\\\\explorer.exe\"))",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "credhist"
      ],
      "raw_values": [
        "*\\\\Microsoft\\\\Protect\\\\CREDHIST"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "explorer.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\explorer.exe"
      ]
    }
  ]
}