{
  "source": "sigma",
  "name": "file_event_win_office_onenote_files_in_susp_locations",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_office_onenote_files_in_susp_locations.eql",
  "raw_query": "any where ((file.path like~ (\"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\Windows\\\\Temp\\\\*\", \"*:\\\\Temp\\\\*\")) and (file.path like~ (\"*.one\", \"*.onepkg\"))) and (not (process.executable:\"*:\\\\Program Files\\\\Microsoft Office\\\\*\" and process.executable:\"*\\\\ONENOTE.EXE\"))",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".one",
        ".onepkg"
      ],
      "raw_values": [
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\Windows\\\\Temp\\\\*",
        "*:\\\\Temp\\\\*",
        "*.one",
        "*.onepkg"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "onenote.exe"
      ],
      "raw_values": [
        "*:\\\\Program Files\\\\Microsoft Office\\\\*",
        "*\\\\ONENOTE.EXE"
      ]
    }
  ]
}