{
  "source": "sigma",
  "name": "file_event_win_creation_scr_binary_file",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_creation_scr_binary_file.eql",
  "raw_query": "any where file.path:\"*.scr\" and (not ((process.executable like~ (\"*\\\\Kindle.exe\", \"*\\\\Bin\\\\ccSvcHst.exe\")) or (process.executable:\"*\\\\TiWorker.exe\" and file.path:\"*\\\\uwfservicingscr.scr\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "kindle.exe",
        "ccsvchst.exe"
      ],
      "raw_values": [
        "*\\\\Kindle.exe",
        "*\\\\Bin\\\\ccSvcHst.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".scr",
        "uwfservicingscr.scr"
      ],
      "raw_values": [
        "*.scr",
        "*\\\\uwfservicingscr.scr"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "tiworker.exe"
      ],
      "raw_values": [
        "*\\\\TiWorker.exe"
      ]
    }
  ]
}