{
  "source": "sigma",
  "name": "image_load_office_excel_xll_load",
  "subtree": "rules-threat-hunting",
  "category": "library",
  "sigma_path": "rules-threat-hunting/windows/image_load/image_load_office_excel_xll_load.eql",
  "raw_query": "any where process.executable:\"*\\\\excel.exe\" and file.path:\"*.xll\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "excel.exe"
      ],
      "raw_values": [
        "*\\\\excel.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".xll"
      ],
      "raw_values": [
        "*.xll"
      ]
    }
  ]
}