{
  "source": "sigma",
  "name": "image_load_side_load_solidpdfcreator",
  "subtree": "rules",
  "category": "library",
  "sigma_path": "rules/windows/image_load/image_load_side_load_solidpdfcreator.eql",
  "raw_query": "any where file.path:\"*\\\\SolidPDFCreator.dll\" and (not (process.executable:\"*\\\\SolidPDFCreator.exe\" and (file.path like~ (\"C:\\\\Program Files (x86)\\\\SolidDocuments\\\\SolidPDFCreator\\\\*\", \"C:\\\\Program Files\\\\SolidDocuments\\\\SolidPDFCreator\\\\*\"))))",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "solidpdfcreator.dll"
      ],
      "raw_values": [
        "*\\\\SolidPDFCreator.dll"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "solidpdfcreator.exe"
      ],
      "raw_values": [
        "*\\\\SolidPDFCreator.exe"
      ]
    }
  ]
}