{
  "source": "sigma",
  "name": "image_load_iexplore_dcom_iertutil_dll_hijack",
  "subtree": "rules",
  "category": "library",
  "sigma_path": "rules/windows/image_load/image_load_iexplore_dcom_iertutil_dll_hijack.eql",
  "raw_query": "any where process.executable:\"*\\\\Internet Explorer\\\\iexplore.exe\" and file.path:\"*\\\\Internet Explorer\\\\iertutil.dll\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "iexplore.exe"
      ],
      "raw_values": [
        "*\\\\Internet Explorer\\\\iexplore.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "iertutil.dll"
      ],
      "raw_values": [
        "*\\\\Internet Explorer\\\\iertutil.dll"
      ]
    }
  ]
}