{
  "source": "sigma",
  "name": "image_load_office_outlook_outlvba_load",
  "subtree": "rules",
  "category": "library",
  "sigma_path": "rules/windows/image_load/image_load_office_outlook_outlvba_load.eql",
  "raw_query": "any where process.executable:\"*\\\\outlook.exe\" and file.path:\"*\\\\outlvba.dll\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "outlook.exe"
      ],
      "raw_values": [
        "*\\\\outlook.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "outlvba.dll"
      ],
      "raw_values": [
        "*\\\\outlvba.dll"
      ]
    }
  ]
}