{
  "source": "sigma",
  "name": "net_connection_win_domain_dropbox_api",
  "subtree": "rules",
  "category": "network",
  "sigma_path": "rules/windows/network_connection/net_connection_win_domain_dropbox_api.eql",
  "raw_query": "any where (network.direction:\"true\" and (destination.domain like~ (\"*api.dropboxapi.com\", \"*content.dropboxapi.com\"))) and (not process.executable:\"*\\\\Dropbox*\")",
  "conditions": [
    {
      "field": "destination.domain",
      "raw_field": "destination.domain",
      "operator": "like~",
      "values": [
        "api.dropboxapi.com",
        "content.dropboxapi.com"
      ],
      "raw_values": [
        "*api.dropboxapi.com",
        "*content.dropboxapi.com"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dropbox"
      ],
      "raw_values": [
        "*\\\\Dropbox*"
      ]
    }
  ]
}