{
  "source": "sigma",
  "name": "proc_creation_win_dumpminitool_susp_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_dumpminitool_susp_execution.eql",
  "raw_query": "any where ((process.executable like~ (\"*\\\\DumpMinitool.exe\", \"*\\\\DumpMinitool.x86.exe\", \"*\\\\DumpMinitool.arm64.exe\")) or (process.pe.original_file_name like~ (\"DumpMinitool.exe\", \"DumpMinitool.x86.exe\", \"DumpMinitool.arm64.exe\"))) and ((not (process.executable like~ (\"*\\\\Microsoft Visual Studio\\\\*\", \"*\\\\Extensions\\\\*\"))) or process.command_line:\"*.txt*\" or ((process.command_line like~ (\"* Full*\", \"* Mini*\", \"* WithHeap*\")) and (not process.command_line:\"*--dumpType*\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "dumpminitool.exe",
        "dumpminitool.x86.exe",
        "dumpminitool.arm64.exe"
      ],
      "raw_values": [
        "*\\\\DumpMinitool.exe",
        "*\\\\DumpMinitool.x86.exe",
        "*\\\\DumpMinitool.arm64.exe",
        "*\\\\Microsoft Visual Studio\\\\*",
        "*\\\\Extensions\\\\*"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "dumpminitool.exe",
        "dumpminitool.x86.exe",
        "dumpminitool.arm64.exe"
      ],
      "raw_values": [
        "DumpMinitool.exe",
        "DumpMinitool.x86.exe",
        "DumpMinitool.arm64.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "full",
        "mini",
        "withheap"
      ],
      "raw_values": [
        "* Full*",
        "* Mini*",
        "* WithHeap*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        ".txt",
        "--dumptype"
      ],
      "raw_values": [
        "*.txt*",
        "*--dumpType*"
      ]
    }
  ]
}