{
  "source": "sigma",
  "name": "proc_creation_win_msdt_answer_file_exec",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_msdt_answer_file_exec.eql",
  "raw_query": "any where (process.executable:\"*\\\\msdt.exe\" and process.command_line:\"*\\\\WINDOWS\\\\diagnostics\\\\index\\\\PCWDiagnostic.xml*\" and process.command_line like~ (\"* -af *\", \"* /af *\", \"* \u2013af *\", \"* \u2014af *\", \"* \u2015af *\")) and (not process.parent.executable:\"*\\\\pcwrun.exe\")",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-af",
        "\u2013af",
        "\u2014af",
        "\u2015af"
      ],
      "raw_values": [
        "* -af *",
        "* /af *",
        "* \u2013af *",
        "* \u2014af *",
        "* \u2015af *"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msdt.exe"
      ],
      "raw_values": [
        "*\\\\msdt.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "pcwdiagnostic.xml"
      ],
      "raw_values": [
        "*\\\\WINDOWS\\\\diagnostics\\\\index\\\\PCWDiagnostic.xml*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "pcwrun.exe"
      ],
      "raw_values": [
        "*\\\\pcwrun.exe"
      ]
    }
  ]
}