{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_ttdinject",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_ttdinject.eql",
  "raw_query": "any where process.executable:\"*ttdinject.exe\" or process.pe.original_file_name:\"TTDInject.EXE\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "ttdinject.exe"
      ],
      "raw_values": [
        "*ttdinject.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "ttdinject.exe"
      ],
      "raw_values": [
        "TTDInject.EXE"
      ]
    }
  ]
}