{
  "source": "sigma",
  "name": "proc_creation_win_susp_service_tamper",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_susp_service_tamper.eql",
  "raw_query": "any where ((process.pe.original_file_name like~ (\"net.exe\", \"net1.exe\", \"PowerShell_ISE.EXE\", \"PowerShell.EXE\", \"psservice.exe\", \"pwsh.dll\", \"sc.exe\", \"wmic.exe\")) or (process.executable like~ (\"*\\\\net.exe\", \"*\\\\net1.exe\", \"*\\\\PowerShell_ISE.EXE\", \"*\\\\powershell.exe\", \"*\\\\PsService.exe\", \"*\\\\PsService64.exe\", \"*\\\\pwsh.exe\", \"*\\\\sc.exe\", \"*\\\\wmic.exe\"))) and ((process.command_line like~ (\"* delete *\", \"*.delete()*\", \"* pause *\", \"* stop *\", \"*Stop-Service *\", \"*Remove-Service *\")) or (process.command_line:\"*config*\" and process.command_line:\"*start=disabled*\")) and (process.command_line like~ (\"*143Svc*\", \"*Acronis VSS Provider*\", \"*AcronisAgent*\", \"*AcrSch2Svc*\", \"*AdobeARMservice*\", \"*AHS Service*\", \"*Antivirus*\", \"*Apache4*\", \"*ARSM*\", \"*aswBcc*\", \"*AteraAgent*\", \"*Avast Business Console Client Antivirus Service*\", \"*avast! Antivirus*\", \"*AVG Antivirus*\", \"*avgAdminClient*\", \"*AvgAdminServer*\", \"*AVP1*\", \"*BackupExec*\", \"*bedbg*\", \"*BITS*\", \"*BrokerInfrastructure*\", \"*CASLicenceServer*\", \"*CASWebServer*\", \"*Client Agent 7.60*\", \"*Core Browsing Protection*\", \"*Core Mail Protection*\", \"*Core Scanning Server*\", \"*DCAgent*\", \"*dwmrcs*\", \"*EhttpSr*\", \"*ekrn*\", \"*Enterprise Client Service*\", \"*epag*\", \"*EPIntegrationService*\", \"*EPProtectedService*\", \"*EPRedline*\", \"*EPSecurityService*\", \"*EPUpdateService*\", \"*EraserSvc11710*\", \"*EsgShKernel*\", \"*ESHASRV*\", \"*FA_Scheduler*\", \"*FirebirdGuardianDefaultInstance*\", \"*FirebirdServerDefaultInstance*\", \"*FontCache3.0.0.0*\", \"*HealthTLService*\", \"*hmpalertsvc*\", \"*HMS*\", \"*HostControllerService*\", \"*hvdsvc*\", \"*IAStorDataMgrSvc*\", \"*IBMHPS*\", \"*ibmspsvc*\", \"*IISAdmin*\", \"*IMANSVC*\", \"*IMAP4Svc*\", \"*instance2*\", \"*KAVFS*\", \"*KAVFSGT*\", \"*kavfsslp*\", \"*KeyIso*\", \"*klbackupdisk*\", \"*klbackupflt*\", \"*klflt*\", \"*klhk*\", \"*KLIF*\", \"*klim6*\", \"*klkbdflt*\", \"*klmouflt*\", \"*klnagent*\", \"*klpd*\", \"*kltap*\", \"*KSDE1.0.0*\", \"*LogProcessorService*\", \"*M8EndpointAgent*\", \"*macmnsvc*\", \"*masvc*\", \"*MBAMService*\", \"*MBCloudEA*\", \"*MBEndpointAgent*\", \"*McAfeeDLPAgentService*\", \"*McAfeeEngineService*\", \"*MCAFEEEVENTPARSERSRV*\", \"*McAfeeFramework*\", \"*MCAFEETOMCATSRV530*\", \"*McShield*\", \"*McTaskManager*\", \"*mfefire*\", \"*mfemms*\", \"*mfevto*\", \"*mfevtp*\", \"*mfewc*\", \"*MMS*\", \"*mozyprobackup*\", \"*mpssvc*\", \"*MSComplianceAudit*\", \"*MSDTC*\", \"*MsDtsServer*\", \"*MSExchange*\", \"*msftesq1SPROO*\", \"*msftesql$PROD*\", \"*msftesql$SQLEXPRESS*\", \"*MSOLAP$SQL_2008*\", \"*MSOLAP$SYSTEM_BGC*\", \"*MSOLAP$TPS*\", \"*MSOLAP$TPSAMA*\", \"*MSOLAPSTPS*\", \"*MSOLAPSTPSAMA*\", \"*mssecflt*\", \"*MSSQ!I.SPROFXENGAGEMEHT*\", \"*MSSQ0SHAREPOINT*\", \"*MSSQ0SOPHOS*\", \"*MSSQL*\", \"*MSSQLFDLauncher$*\", \"*MySQL*\", \"*NanoServiceMain*\", \"*NetMsmqActivator*\", \"*NetPipeActivator*\", \"*netprofm*\", \"*NetTcpActivator*\", \"*NetTcpPortSharing*\", \"*ntrtscan*\", \"*nvspwmi*\", \"*ofcservice*\", \"*Online Protection System*\", \"*OracleClientCache80*\", \"*OracleDBConsole*\", \"*OracleMTSRecoveryService*\", \"*OracleOraDb11g_home1*\", \"*OracleService*\", \"*OracleVssWriter*\", \"*osppsvc*\", \"*PandaAetherAgent*\", \"*PccNTUpd*\", \"*PDVFSService*\", \"*POP3Svc*\", \"*postgresql-x64-9.4*\", \"*POVFSService*\", \"*PSUAService*\", \"*Quick Update Service*\", \"*RepairService*\", \"*ReportServer*\", \"*ReportServer$*\", \"*RESvc*\", \"*RpcEptMapper*\", \"*sacsvr*\", \"*SamSs*\", \"*SAVAdminService*\", \"*SAVService*\", \"*ScSecSvc*\", \"*SDRSVC*\", \"*SearchExchangeTracing*\", \"*sense*\", \"*SentinelAgent*\", \"*SentinelHelperService*\", \"*SepMasterService*\", \"*ShMonitor*\", \"*Smcinst*\", \"*SmcService*\", \"*SMTPSvc*\", \"*SNAC*\", \"*SntpService*\", \"*Sophos*\", \"*SQ1SafeOLRService*\", \"*SQL Backups*\", \"*SQL Server*\", \"*SQLAgent*\", \"*SQLANYs_Sage_FAS_Fixed_Assets*\", \"*SQLBrowser*\", \"*SQLsafe*\", \"*SQLSERVERAGENT*\", \"*SQLTELEMETRY*\", \"*SQLWriter*\", \"*SSISTELEMETRY130*\", \"*SstpSvc*\", \"*storflt*\", \"*svcGenericHost*\", \"*swc_service*\", \"*swi_filter*\", \"*swi_service*\", \"*swi_update*\", \"*Symantec*\", \"*sysmon*\", \"*TeamViewer*\", \"*Telemetryserver*\", \"*ThreatLockerService*\", \"*TMBMServer*\", \"*TmCCSF*\", \"*TmFilter*\", \"*TMiCRCScanService*\", \"*tmlisten*\", \"*TMLWCSService*\", \"*TmPfw*\", \"*TmPreFilter*\", \"*TmProxy*\", \"*TMSmartRelayService*\", \"*tmusa*\", \"*Tomcat*\", \"*Trend Micro Deep Security Manager*\", \"*TrueKey*\", \"*UFNet*\", \"*UI0Detect*\", \"*UniFi*\", \"*UTODetect*\", \"*vds*\", \"*Veeam*\", \"*VeeamDeploySvc*\", \"*Veritas System Recovery*\", \"*vmic*\", \"*VMTools*\", \"*vmvss*\", \"*VSApiNt*\", \"*VSS*\", \"*W3Svc*\", \"*wbengine*\", \"*WdNisSvc*\", \"*WeanClOudSve*\", \"*Weems JY*\", \"*WinDefend*\", \"*wmms*\", \"*wozyprobackup*\", \"*WPFFontCache_v0400*\", \"*WRSVC*\", \"*wsbexchange*\", \"*WSearch*\", \"*wscsvc*\", \"*Zoolz 2 Service*\"))",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe",
        "powershell_ise.exe",
        "powershell.exe",
        "psservice.exe",
        "pwsh.dll",
        "sc.exe",
        "wmic.exe"
      ],
      "raw_values": [
        "net.exe",
        "net1.exe",
        "PowerShell_ISE.EXE",
        "PowerShell.EXE",
        "psservice.exe",
        "pwsh.dll",
        "sc.exe",
        "wmic.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "net.exe",
        "net1.exe",
        "powershell_ise.exe",
        "powershell.exe",
        "psservice.exe",
        "psservice64.exe",
        "pwsh.exe",
        "sc.exe",
        "wmic.exe"
      ],
      "raw_values": [
        "*\\\\net.exe",
        "*\\\\net1.exe",
        "*\\\\PowerShell_ISE.EXE",
        "*\\\\powershell.exe",
        "*\\\\PsService.exe",
        "*\\\\PsService64.exe",
        "*\\\\pwsh.exe",
        "*\\\\sc.exe",
        "*\\\\wmic.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "delete",
        "143svc",
        "acronis vss provider",
        "acronisagent",
        "acrsch2svc",
        "adobearmservice",
        "ahs service",
        "antivirus",
        "apache4",
        "arsm",
        "aswbcc",
        "ateraagent",
        "avast business console client antivirus service",
        "avast! antivirus",
        "avg antivirus",
        "avgadminclient",
        "avgadminserver",
        "avp1",
        "backupexec",
        "bedbg",
        "bits",
        "brokerinfrastructure",
        "caslicenceserver",
        "caswebserver",
        "client agent 7.60",
        "core browsing protection",
        "core mail protection",
        "core scanning server",
        "dcagent",
        "dwmrcs",
        "ehttpsr",
        "ekrn",
        "enterprise client service",
        "epag",
        "epintegrationservice",
        "epprotectedservice",
        "epredline",
        "epsecurityservice",
        "epupdateservice",
        "erasersvc11710",
        "esgshkernel",
        "eshasrv",
        "fa_scheduler",
        "firebirdguardiandefaultinstance",
        "firebirdserverdefaultinstance",
        "fontcache3.0.0.0",
        "healthtlservice",
        "hmpalertsvc",
        "hms",
        "hostcontrollerservice",
        "hvdsvc",
        "iastordatamgrsvc",
        "ibmhps",
        "ibmspsvc",
        "iisadmin",
        "imansvc",
        "imap4svc",
        "instance2",
        "kavfs",
        "kavfsgt",
        "kavfsslp",
        "keyiso",
        "klbackupdisk",
        "klbackupflt",
        "klflt",
        "klhk",
        "klif",
        "klim6",
        "klkbdflt",
        "klmouflt",
        "klnagent",
        "klpd",
        "kltap",
        "ksde1.0.0",
        "logprocessorservice",
        "m8endpointagent",
        "macmnsvc",
        "masvc",
        "mbamservice",
        "mbcloudea",
        "mbendpointagent",
        "mcafeedlpagentservice",
        "mcafeeengineservice",
        "mcafeeeventparsersrv",
        "mcafeeframework",
        "mcafeetomcatsrv530",
        "mcshield",
        "mctaskmanager",
        "mfefire",
        "mfemms",
        "mfevto",
        "mfevtp",
        "mfewc",
        "mms",
        "mozyprobackup",
        "mpssvc",
        "mscomplianceaudit",
        "msdtc",
        "msdtsserver",
        "msexchange",
        "msftesq1sproo",
        "msftesql$prod",
        "msftesql$sqlexpress",
        "msolap$sql_2008",
        "msolap$system_bgc",
        "msolap$tps",
        "msolap$tpsama",
        "msolapstps",
        "msolapstpsama",
        "mssecflt",
        "mssq!i.sprofxengagemeht",
        "mssq0sharepoint",
        "mssq0sophos",
        "mssql",
        "mssqlfdlauncher$",
        "mysql",
        "nanoservicemain",
        "netmsmqactivator",
        "netpipeactivator",
        "netprofm",
        "nettcpactivator",
        "nettcpportsharing",
        "ntrtscan",
        "nvspwmi",
        "ofcservice",
        "online protection system",
        "oracleclientcache80",
        "oracledbconsole",
        "oraclemtsrecoveryservice",
        "oracleoradb11g_home1",
        "oracleservice",
        "oraclevsswriter",
        "osppsvc",
        "pandaaetheragent",
        "pccntupd",
        "pdvfsservice",
        "pop3svc",
        "postgresql-x64-9.4",
        "povfsservice",
        "psuaservice",
        "quick update service",
        "repairservice",
        "reportserver",
        "reportserver$",
        "resvc",
        "rpceptmapper",
        "sacsvr",
        "samss",
        "savadminservice",
        "savservice",
        "scsecsvc",
        "sdrsvc",
        "searchexchangetracing",
        "sense",
        "sentinelagent",
        "sentinelhelperservice",
        "sepmasterservice",
        "shmonitor",
        "smcinst",
        "smcservice",
        "smtpsvc",
        "snac",
        "sntpservice",
        "sophos",
        "sq1safeolrservice",
        "sql backups",
        "sql server",
        "sqlagent",
        "sqlanys_sage_fas_fixed_assets",
        "sqlbrowser",
        "sqlsafe",
        "sqlserveragent",
        "sqltelemetry",
        "sqlwriter",
        "ssistelemetry130",
        "sstpsvc",
        "storflt",
        "svcgenerichost",
        "swc_service",
        "swi_filter",
        "swi_service",
        "swi_update",
        "symantec",
        "sysmon",
        "teamviewer",
        "telemetryserver",
        "threatlockerservice",
        "tmbmserver",
        "tmccsf",
        "tmfilter",
        "tmicrcscanservice",
        "tmlisten",
        "tmlwcsservice",
        "tmpfw",
        "tmprefilter",
        "tmproxy",
        "tmsmartrelayservice",
        "tmusa",
        "tomcat",
        "trend micro deep security manager",
        "truekey",
        "ufnet",
        "ui0detect",
        "unifi",
        "utodetect",
        "vds",
        "veeam",
        "veeamdeploysvc",
        "veritas system recovery",
        "vmic",
        "vmtools",
        "vmvss",
        "vsapint",
        "vss",
        "w3svc",
        "wbengine",
        "wdnissvc",
        "weancloudsve",
        "weems jy",
        "windefend",
        "wmms",
        "wozyprobackup",
        "wpffontcache_v0400",
        "wrsvc",
        "wsbexchange",
        "wsearch",
        "wscsvc",
        "zoolz 2 service"
      ],
      "raw_values": [
        "* delete *",
        "*143Svc*",
        "*Acronis VSS Provider*",
        "*AcronisAgent*",
        "*AcrSch2Svc*",
        "*AdobeARMservice*",
        "*AHS Service*",
        "*Antivirus*",
        "*Apache4*",
        "*ARSM*",
        "*aswBcc*",
        "*AteraAgent*",
        "*Avast Business Console Client Antivirus Service*",
        "*avast! Antivirus*",
        "*AVG Antivirus*",
        "*avgAdminClient*",
        "*AvgAdminServer*",
        "*AVP1*",
        "*BackupExec*",
        "*bedbg*",
        "*BITS*",
        "*BrokerInfrastructure*",
        "*CASLicenceServer*",
        "*CASWebServer*",
        "*Client Agent 7.60*",
        "*Core Browsing Protection*",
        "*Core Mail Protection*",
        "*Core Scanning Server*",
        "*DCAgent*",
        "*dwmrcs*",
        "*EhttpSr*",
        "*ekrn*",
        "*Enterprise Client Service*",
        "*epag*",
        "*EPIntegrationService*",
        "*EPProtectedService*",
        "*EPRedline*",
        "*EPSecurityService*",
        "*EPUpdateService*",
        "*EraserSvc11710*",
        "*EsgShKernel*",
        "*ESHASRV*",
        "*FA_Scheduler*",
        "*FirebirdGuardianDefaultInstance*",
        "*FirebirdServerDefaultInstance*",
        "*FontCache3.0.0.0*",
        "*HealthTLService*",
        "*hmpalertsvc*",
        "*HMS*",
        "*HostControllerService*",
        "*hvdsvc*",
        "*IAStorDataMgrSvc*",
        "*IBMHPS*",
        "*ibmspsvc*",
        "*IISAdmin*",
        "*IMANSVC*",
        "*IMAP4Svc*",
        "*instance2*",
        "*KAVFS*",
        "*KAVFSGT*",
        "*kavfsslp*",
        "*KeyIso*",
        "*klbackupdisk*",
        "*klbackupflt*",
        "*klflt*",
        "*klhk*",
        "*KLIF*",
        "*klim6*",
        "*klkbdflt*",
        "*klmouflt*",
        "*klnagent*",
        "*klpd*",
        "*kltap*",
        "*KSDE1.0.0*",
        "*LogProcessorService*",
        "*M8EndpointAgent*",
        "*macmnsvc*",
        "*masvc*",
        "*MBAMService*",
        "*MBCloudEA*",
        "*MBEndpointAgent*",
        "*McAfeeDLPAgentService*",
        "*McAfeeEngineService*",
        "*MCAFEEEVENTPARSERSRV*",
        "*McAfeeFramework*",
        "*MCAFEETOMCATSRV530*",
        "*McShield*",
        "*McTaskManager*",
        "*mfefire*",
        "*mfemms*",
        "*mfevto*",
        "*mfevtp*",
        "*mfewc*",
        "*MMS*",
        "*mozyprobackup*",
        "*mpssvc*",
        "*MSComplianceAudit*",
        "*MSDTC*",
        "*MsDtsServer*",
        "*MSExchange*",
        "*msftesq1SPROO*",
        "*msftesql$PROD*",
        "*msftesql$SQLEXPRESS*",
        "*MSOLAP$SQL_2008*",
        "*MSOLAP$SYSTEM_BGC*",
        "*MSOLAP$TPS*",
        "*MSOLAP$TPSAMA*",
        "*MSOLAPSTPS*",
        "*MSOLAPSTPSAMA*",
        "*mssecflt*",
        "*MSSQ!I.SPROFXENGAGEMEHT*",
        "*MSSQ0SHAREPOINT*",
        "*MSSQ0SOPHOS*",
        "*MSSQL*",
        "*MSSQLFDLauncher$*",
        "*MySQL*",
        "*NanoServiceMain*",
        "*NetMsmqActivator*",
        "*NetPipeActivator*",
        "*netprofm*",
        "*NetTcpActivator*",
        "*NetTcpPortSharing*",
        "*ntrtscan*",
        "*nvspwmi*",
        "*ofcservice*",
        "*Online Protection System*",
        "*OracleClientCache80*",
        "*OracleDBConsole*",
        "*OracleMTSRecoveryService*",
        "*OracleOraDb11g_home1*",
        "*OracleService*",
        "*OracleVssWriter*",
        "*osppsvc*",
        "*PandaAetherAgent*",
        "*PccNTUpd*",
        "*PDVFSService*",
        "*POP3Svc*",
        "*postgresql-x64-9.4*",
        "*POVFSService*",
        "*PSUAService*",
        "*Quick Update Service*",
        "*RepairService*",
        "*ReportServer*",
        "*ReportServer$*",
        "*RESvc*",
        "*RpcEptMapper*",
        "*sacsvr*",
        "*SamSs*",
        "*SAVAdminService*",
        "*SAVService*",
        "*ScSecSvc*",
        "*SDRSVC*",
        "*SearchExchangeTracing*",
        "*sense*",
        "*SentinelAgent*",
        "*SentinelHelperService*",
        "*SepMasterService*",
        "*ShMonitor*",
        "*Smcinst*",
        "*SmcService*",
        "*SMTPSvc*",
        "*SNAC*",
        "*SntpService*",
        "*Sophos*",
        "*SQ1SafeOLRService*",
        "*SQL Backups*",
        "*SQL Server*",
        "*SQLAgent*",
        "*SQLANYs_Sage_FAS_Fixed_Assets*",
        "*SQLBrowser*",
        "*SQLsafe*",
        "*SQLSERVERAGENT*",
        "*SQLTELEMETRY*",
        "*SQLWriter*",
        "*SSISTELEMETRY130*",
        "*SstpSvc*",
        "*storflt*",
        "*svcGenericHost*",
        "*swc_service*",
        "*swi_filter*",
        "*swi_service*",
        "*swi_update*",
        "*Symantec*",
        "*sysmon*",
        "*TeamViewer*",
        "*Telemetryserver*",
        "*ThreatLockerService*",
        "*TMBMServer*",
        "*TmCCSF*",
        "*TmFilter*",
        "*TMiCRCScanService*",
        "*tmlisten*",
        "*TMLWCSService*",
        "*TmPfw*",
        "*TmPreFilter*",
        "*TmProxy*",
        "*TMSmartRelayService*",
        "*tmusa*",
        "*Tomcat*",
        "*Trend Micro Deep Security Manager*",
        "*TrueKey*",
        "*UFNet*",
        "*UI0Detect*",
        "*UniFi*",
        "*UTODetect*",
        "*vds*",
        "*Veeam*",
        "*VeeamDeploySvc*",
        "*Veritas System Recovery*",
        "*vmic*",
        "*VMTools*",
        "*vmvss*",
        "*VSApiNt*",
        "*VSS*",
        "*W3Svc*",
        "*wbengine*",
        "*WdNisSvc*",
        "*WeanClOudSve*",
        "*Weems JY*",
        "*WinDefend*",
        "*wmms*",
        "*wozyprobackup*",
        "*WPFFontCache_v0400*",
        "*WRSVC*",
        "*wsbexchange*",
        "*WSearch*",
        "*wscsvc*",
        "*Zoolz 2 Service*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "config",
        "start=disabled"
      ],
      "raw_values": [
        "*config*",
        "*start=disabled*"
      ]
    }
  ]
}