{
  "source": "sigma",
  "name": "proc_creation_win_link_uncommon_parent_process",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_link_uncommon_parent_process.eql",
  "raw_query": "any where (process.executable:\"*\\\\link.exe\" and process.command_line:\"*LINK /*\") and (not ((process.parent.executable like~ (\"C:\\\\Program Files\\\\Microsoft Visual Studio\\\\*\", \"C:\\\\Program Files (x86)\\\\Microsoft Visual Studio\\\\*\")) and (process.parent.executable like~ (\"*\\\\VC\\\\bin\\\\*\", \"*\\\\VC\\\\Tools\\\\*\"))))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "link.exe"
      ],
      "raw_values": [
        "*\\\\link.exe"
      ]
    }
  ]
}