{
  "source": "sigma",
  "name": "proc_creation_win_rundll32_advpack_obfuscated_ordinal_call",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_rundll32_advpack_obfuscated_ordinal_call.eql",
  "raw_query": "any where (process.executable:\"*\\\\rundll32.exe\" or process.pe.original_file_name:\"RUNDLL32.EXE\" or process.command_line:\"*rundll32*\") and process.command_line:\"*advpack*\" and ((process.command_line:\"*#+*\" and process.command_line:\"*12*\") or process.command_line:\"*#-*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "*\\\\rundll32.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "RUNDLL32.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "rundll32",
        "advpack"
      ],
      "raw_values": [
        "*rundll32*",
        "*advpack*",
        "*#+*",
        "*12*",
        "*#-*"
      ]
    }
  ]
}