{
  "source": "sigma",
  "name": "proc_creation_win_dxcap_arbitrary_binary_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_dxcap_arbitrary_binary_execution.eql",
  "raw_query": "any where (process.executable:\"*\\\\DXCap.exe\" or process.pe.original_file_name:\"DXCap.exe\") and process.command_line:\"* -c *\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dxcap.exe"
      ],
      "raw_values": [
        "*\\\\DXCap.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "dxcap.exe"
      ],
      "raw_values": [
        "DXCap.exe"
      ]
    }
  ]
}