{
  "source": "sigma",
  "name": "proc_creation_win_remote_access_tools_meshagent_exec",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_remote_access_tools_meshagent_exec.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\meshagent.exe\" and (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "meshagent.exe"
      ],
      "raw_values": [
        "*\\\\meshagent.exe"
      ]
    }
  ]
}