{
  "source": "sigma",
  "name": "proc_creation_win_hostname_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_hostname_execution.eql",
  "raw_query": "any where process.executable:\"*\\\\HOSTNAME.EXE\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "hostname.exe"
      ],
      "raw_values": [
        "*\\\\HOSTNAME.EXE"
      ]
    }
  ]
}