{
  "source": "sigma",
  "name": "proc_creation_win_pua_webbrowserpassview",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_pua_webbrowserpassview.eql",
  "raw_query": "any where process.pe.description:\"Web Browser Password Viewer\" or process.executable:\"*\\\\WebBrowserPassView.exe\"",
  "conditions": [
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "web browser password viewer"
      ],
      "raw_values": [
        "Web Browser Password Viewer"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "webbrowserpassview.exe"
      ],
      "raw_values": [
        "*\\\\WebBrowserPassView.exe"
      ]
    }
  ]
}