{
  "source": "sigma",
  "name": "proc_creation_win_dsacls_abuse_permissions",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_dsacls_abuse_permissions.eql",
  "raw_query": "any where (process.executable:\"*\\\\dsacls.exe\" or process.pe.original_file_name:\"DSACLS.EXE\") and process.command_line:\"* /G *\" and (process.command_line like~ (\"*GR*\", \"*GE*\", \"*GW*\", \"*GA*\", \"*WP*\", \"*WD*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dsacls.exe"
      ],
      "raw_values": [
        "*\\\\dsacls.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "dsacls.exe"
      ],
      "raw_values": [
        "DSACLS.EXE"
      ]
    }
  ]
}