{
  "source": "sigma",
  "name": "proc_creation_win_renamed_jusched",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_renamed_jusched.eql",
  "raw_query": "any where (process.pe.description like~ (\"Java Update Scheduler\", \"Java(TM) Update Scheduler\")) and (not process.executable:\"*\\\\jusched.exe\")",
  "conditions": [
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": "like~",
      "values": [
        "java update scheduler"
      ],
      "raw_values": [
        "Java Update Scheduler"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "jusched.exe"
      ],
      "raw_values": [
        "*\\\\jusched.exe"
      ]
    }
  ]
}