{
  "source": "sigma",
  "name": "proc_creation_win_takeown_recursive_own",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_takeown_recursive_own.eql",
  "raw_query": "any where process.executable:\"*\\\\takeown.exe\" and (process.command_line:\"*/f *\" and process.command_line:\"*/r*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "takeown.exe"
      ],
      "raw_values": [
        "*\\\\takeown.exe"
      ]
    }
  ]
}