{
  "source": "sigma",
  "name": "proc_creation_win_hktl_trufflesnout",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_hktl_trufflesnout.eql",
  "raw_query": "any where process.pe.original_file_name:\"TruffleSnout.exe\" or process.executable:\"*\\\\TruffleSnout.exe\"",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "trufflesnout.exe"
      ],
      "raw_values": [
        "TruffleSnout.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "trufflesnout.exe"
      ],
      "raw_values": [
        "*\\\\TruffleSnout.exe"
      ]
    }
  ]
}