{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_devtoolslauncher",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_devtoolslauncher.eql",
  "raw_query": "any where process.executable:\"*\\\\devtoolslauncher.exe\" and process.command_line:\"*LaunchForDeploy*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "devtoolslauncher.exe"
      ],
      "raw_values": [
        "*\\\\devtoolslauncher.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "launchfordeploy"
      ],
      "raw_values": [
        "*LaunchForDeploy*"
      ]
    }
  ]
}