{
  "source": "sigma",
  "name": "proc_creation_win_esentutl_webcache",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_esentutl_webcache.eql",
  "raw_query": "any where (process.executable:\"*\\\\esentutl.exe\" or process.pe.original_file_name:\"esentutl.exe\") and process.command_line like~ (\"*-r*\", \"*/r*\", \"*\u2013r*\", \"*\u2014r*\", \"*\u2015r*\") and process.command_line:\"*\\\\Windows\\\\WebCache*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "esentutl.exe"
      ],
      "raw_values": [
        "*\\\\esentutl.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "esentutl.exe"
      ],
      "raw_values": [
        "esentutl.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "webcache"
      ],
      "raw_values": [
        "*\\\\Windows\\\\WebCache*"
      ]
    }
  ]
}