{
  "source": "sigma",
  "name": "proc_creation_win_psr_capture_screenshots",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_psr_capture_screenshots.eql",
  "raw_query": "any where process.executable:\"*\\\\Psr.exe\" and (process.command_line like~ (\"*/start*\", \"*-start*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "start",
        "-start"
      ],
      "raw_values": [
        "*/start*",
        "*-start*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "psr.exe"
      ],
      "raw_values": [
        "*\\\\Psr.exe"
      ]
    }
  ]
}