{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_syncappvpublishingserver_execute_psh",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_syncappvpublishingserver_execute_psh.eql",
  "raw_query": "any where (process.executable:\"*\\\\SyncAppvPublishingServer.exe\" or process.pe.original_file_name:\"syncappvpublishingserver.exe\") and process.command_line:\"*\\\"n; *\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "syncappvpublishingserver.exe"
      ],
      "raw_values": [
        "*\\\\SyncAppvPublishingServer.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "syncappvpublishingserver.exe"
      ],
      "raw_values": [
        "syncappvpublishingserver.exe"
      ]
    }
  ]
}