{
  "source": "sigma",
  "name": "proc_creation_win_mshta_lethalhta_technique",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_mshta_lethalhta_technique.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\svchost.exe\" and process.executable:\"*\\\\mshta.exe\"",
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "*\\\\svchost.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "*\\\\mshta.exe"
      ]
    }
  ]
}