{
  "source": "sigma",
  "name": "proc_creation_win_hktl_rubeus",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_hktl_rubeus.eql",
  "raw_query": "any where process.executable:\"*\\\\Rubeus.exe\" or process.pe.original_file_name:\"Rubeus.exe\" or process.pe.description:\"Rubeus\" or (process.command_line like~ (\"*asreproast *\", \"*dump /service:krbtgt *\", \"*dump /luid:0x*\", \"*kerberoast *\", \"*createnetonly /program:*\", \"*ptt /ticket:*\", \"*/impersonateuser:*\", \"*renew /ticket:*\", \"*asktgt /user:*\", \"*harvest /interval:*\", \"*s4u /user:*\", \"*s4u /ticket:*\", \"*hash /password:*\", \"*golden /aes256:*\", \"*silver /user:*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "asreproast",
        "service:krbtgt",
        "luid:0x",
        "kerberoast",
        "program:",
        "ticket:",
        "impersonateuser:",
        "user:",
        "interval:",
        "password:",
        "aes256:"
      ],
      "raw_values": [
        "*asreproast *",
        "*dump /service:krbtgt *",
        "*dump /luid:0x*",
        "*kerberoast *",
        "*createnetonly /program:*",
        "*ptt /ticket:*",
        "*/impersonateuser:*",
        "*renew /ticket:*",
        "*asktgt /user:*",
        "*harvest /interval:*",
        "*s4u /user:*",
        "*s4u /ticket:*",
        "*hash /password:*",
        "*golden /aes256:*",
        "*silver /user:*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rubeus.exe"
      ],
      "raw_values": [
        "*\\\\Rubeus.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "rubeus.exe"
      ],
      "raw_values": [
        "Rubeus.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "rubeus"
      ],
      "raw_values": [
        "Rubeus"
      ]
    }
  ]
}