{
  "source": "sigma",
  "name": "proc_creation_win_chcp_codepage_switch",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_chcp_codepage_switch.eql",
  "raw_query": "any where process.executable:\"*\\\\chcp.com\" and (process.command_line like~ (\"* 936\", \"* 1258\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "936",
        "1258"
      ],
      "raw_values": [
        "* 936",
        "* 1258"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "chcp.com"
      ],
      "raw_values": [
        "*\\\\chcp.com"
      ]
    }
  ]
}