{
  "source": "sigma",
  "name": "proc_creation_win_powershell_encoding_patterns",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_powershell_encoding_patterns.eql",
  "raw_query": "any where ((process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) or (process.pe.original_file_name like~ (\"PowerShell.EXE\", \"pwsh.dll\"))) and (((process.command_line like~ (\"*ToInt*\", \"*ToDecimal*\", \"*ToByte*\", \"*ToUint*\", \"*ToSingle*\", \"*ToSByte*\")) and (process.command_line like~ (\"*ToChar*\", \"*ToString*\", \"*String*\"))) or ((process.command_line:\"*char*\" and process.command_line:\"*join*\") or (process.command_line:\"*split*\" and process.command_line:\"*join*\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.dll"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "toint",
        "todecimal",
        "tobyte",
        "touint",
        "tosingle",
        "tosbyte",
        "tochar",
        "tostring",
        "string"
      ],
      "raw_values": [
        "*ToInt*",
        "*ToDecimal*",
        "*ToByte*",
        "*ToUint*",
        "*ToSingle*",
        "*ToSByte*",
        "*ToChar*",
        "*ToString*",
        "*String*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "char",
        "join",
        "split"
      ],
      "raw_values": [
        "*char*",
        "*join*",
        "*split*"
      ]
    }
  ]
}