{
  "source": "sigma",
  "name": "proc_access_win_lsass_dump_keyword_image",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_access/proc_access_win_lsass_dump_keyword_image.eql",
  "raw_query": "any where winlog.event_data.TargetImage:\"*\\\\lsass.exe\" and process.executable:\"*dump*\" and (winlog.event_data.GrantedAccess like~ (\"*10\", \"*30\", \"*50\", \"*70\", \"*90\", \"*B0\", \"*D0\", \"*F0\", \"*18\", \"*38\", \"*58\", \"*78\", \"*98\", \"*B8\", \"*D8\", \"*F8\", \"*1A\", \"*3A\", \"*5A\", \"*7A\", \"*9A\", \"*BA\", \"*DA\", \"*FA\", \"*0x14C2\", \"*FF\"))",
  "conditions": [
    {
      "field": "winlog.event_data.grantedaccess",
      "raw_field": "winlog.event_data.GrantedAccess",
      "operator": "like~",
      "values": [
        "0x14c2"
      ],
      "raw_values": [
        "*10",
        "*30",
        "*50",
        "*70",
        "*90",
        "*B0",
        "*D0",
        "*F0",
        "*18",
        "*38",
        "*58",
        "*78",
        "*98",
        "*B8",
        "*D8",
        "*F8",
        "*1A",
        "*3A",
        "*5A",
        "*7A",
        "*9A",
        "*BA",
        "*DA",
        "*FA",
        "*0x14C2",
        "*FF"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": ":",
      "values": [
        "\\\\lsass.exe"
      ],
      "raw_values": [
        "*\\\\lsass.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dump"
      ],
      "raw_values": [
        "*dump*"
      ]
    }
  ]
}