{
  "source": "sigma",
  "name": "proc_creation_win_secedit_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_secedit_execution.eql",
  "raw_query": "any where (process.executable:\"*\\\\secedit.exe\" or process.pe.original_file_name:\"SeCEdit\") and ((process.command_line:\"*/export*\" and process.command_line:\"*/cfg*\") or (process.command_line:\"*/configure*\" and process.command_line:\"*/db*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "secedit.exe"
      ],
      "raw_values": [
        "*\\\\secedit.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "secedit"
      ],
      "raw_values": [
        "SeCEdit"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "export",
        "cfg",
        "configure"
      ],
      "raw_values": [
        "*/export*",
        "*/cfg*",
        "*/configure*",
        "*/db*"
      ]
    }
  ]
}