{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_scriptrunner",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_scriptrunner.eql",
  "raw_query": "any where (process.executable:\"*\\\\ScriptRunner.exe\" or process.pe.original_file_name:\"ScriptRunner.exe\") and process.command_line:\"* -appvscript *\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "scriptrunner.exe"
      ],
      "raw_values": [
        "*\\\\ScriptRunner.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "scriptrunner.exe"
      ],
      "raw_values": [
        "ScriptRunner.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "-appvscript"
      ],
      "raw_values": [
        "* -appvscript *"
      ]
    }
  ]
}