{
  "source": "sigma",
  "name": "proc_creation_win_renamed_autohotkey",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_renamed_autohotkey.eql",
  "raw_query": "any where (process.pe.product:\"*AutoHotkey*\" or process.pe.description:\"*AutoHotkey*\" or (process.pe.original_file_name like~ (\"AutoHotkey.exe\", \"AutoHotkey.rc\"))) and (not ((process.executable like~ (\"*\\\\AutoHotkey.exe\", \"*\\\\AutoHotkey32.exe\", \"*\\\\AutoHotkey32_UIA.exe\", \"*\\\\AutoHotkey64.exe\", \"*\\\\AutoHotkey64_UIA.exe\", \"*\\\\AutoHotkeyA32.exe\", \"*\\\\AutoHotkeyA32_UIA.exe\", \"*\\\\AutoHotkeyU32.exe\", \"*\\\\AutoHotkeyU32_UIA.exe\", \"*\\\\AutoHotkeyU64.exe\", \"*\\\\AutoHotkeyU64_UIA.exe\")) or process.executable:\"*\\\\AutoHotkey*\"))",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "autohotkey.exe",
        "autohotkey.rc"
      ],
      "raw_values": [
        "AutoHotkey.exe",
        "AutoHotkey.rc"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "autohotkey.exe",
        "autohotkey32.exe",
        "autohotkey32_uia.exe",
        "autohotkey64.exe",
        "autohotkey64_uia.exe",
        "autohotkeya32.exe",
        "autohotkeya32_uia.exe",
        "autohotkeyu32.exe",
        "autohotkeyu32_uia.exe",
        "autohotkeyu64.exe",
        "autohotkeyu64_uia.exe"
      ],
      "raw_values": [
        "*\\\\AutoHotkey.exe",
        "*\\\\AutoHotkey32.exe",
        "*\\\\AutoHotkey32_UIA.exe",
        "*\\\\AutoHotkey64.exe",
        "*\\\\AutoHotkey64_UIA.exe",
        "*\\\\AutoHotkeyA32.exe",
        "*\\\\AutoHotkeyA32_UIA.exe",
        "*\\\\AutoHotkeyU32.exe",
        "*\\\\AutoHotkeyU32_UIA.exe",
        "*\\\\AutoHotkeyU64.exe",
        "*\\\\AutoHotkeyU64_UIA.exe"
      ]
    },
    {
      "field": "process.pe.product",
      "raw_field": "process.pe.product",
      "operator": ":",
      "values": [
        "autohotkey"
      ],
      "raw_values": [
        "*AutoHotkey*"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "autohotkey"
      ],
      "raw_values": [
        "*AutoHotkey*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "autohotkey"
      ],
      "raw_values": [
        "*\\\\AutoHotkey*"
      ]
    }
  ]
}