{
  "source": "sigma",
  "name": "proc_creation_win_cipher_overwrite_deleted_data",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_cipher_overwrite_deleted_data.eql",
  "raw_query": "any where (process.pe.original_file_name:\"CIPHER.EXE\" or process.executable:\"*\\\\cipher.exe\") and process.command_line:\"* /w:*\"",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cipher.exe"
      ],
      "raw_values": [
        "CIPHER.EXE"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cipher.exe"
      ],
      "raw_values": [
        "*\\\\cipher.exe"
      ]
    }
  ]
}