{
  "source": "sigma",
  "name": "registry_set_susp_pendingfilerenameoperations",
  "subtree": "rules",
  "category": "registry",
  "sigma_path": "rules/windows/registry/registry_set/registry_set_susp_pendingfilerenameoperations.eql",
  "raw_query": "any where registry.path:\"*\\\\CurrentControlSet\\\\Control\\\\Session Manager\\\\PendingFileRenameOperations*\" and (process.executable:\"*\\\\Users\\\\Public\\\\*\" or (process.executable like~ (\"*\\\\reg.exe\", \"*\\\\regedit.exe\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "reg.exe",
        "regedit.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe",
        "*\\\\regedit.exe"
      ]
    },
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": ":",
      "values": [
        "\\\\currentcontrolset\\\\control\\\\session manager\\\\pendingfilerenameoperations"
      ],
      "raw_values": [
        "*\\\\CurrentControlSet\\\\Control\\\\Session Manager\\\\PendingFileRenameOperations*"
      ]
    }
  ]
}