{
  "source": "sigma",
  "name": "win_appxdeployment_server_uncommon_package_locations",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_uncommon_package_locations.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-AppXDeploymentServer/Operational\" and (event.code:\"854\" and (not ((winlog.event_data.Path like~ (\"*:/Program%20Files*\", \"*:/Windows/System32/*\", \"*:\\\\Program Files (x86)\\\\*\", \"*:\\\\Program Files\\\\*\", \"*:\\\\Windows\\\\ImmersiveControlPanel\\\\*\", \"*:\\\\Windows\\\\PrintDialog\\\\*\", \"*:\\\\Windows\\\\SystemApps\\\\*\", \"*AppData/Local/Temp/WinGet/Microsoft.Winget.Source*\", \"*x-windowsupdate://*\")) or (winlog.event_data.Path like~ (\"*https://installer.teams.static.microsoft/*\", \"*https://res.cdn.office.net*\", \"*https://statics.teams.cdn.live.net/*\", \"*https://statics.teams.cdn.office.net/*\", \"*microsoft.com*\")))) and (not (winlog.event_data.Path:\"*AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*\" or (winlog.event_data.Path like~ (\"*AppData/Local/Temp/WinGet/Microsoft.Winget.Source*\", \"*AppData\\\\Local\\\\Temp\\\\WinGet\\\\Microsoft.Winget.Source*\")) or winlog.event_data.Path:\"*x-windowsupdate://*\")))",
  "conditions": [
    {
      "field": "winlog.event_data.path",
      "raw_field": "winlog.event_data.Path",
      "operator": "like~",
      "values": [
        ":/program%20files",
        ":/windows/system32/",
        "https://installer.teams.static.microsoft/",
        "https://res.cdn.office.net",
        "https://statics.teams.cdn.live.net/",
        "https://statics.teams.cdn.office.net/",
        "microsoft.com",
        "appdata/local/temp/winget/microsoft.winget.source",
        "appdata\\\\local\\\\temp\\\\winget\\\\microsoft.winget.source"
      ],
      "raw_values": [
        "*:/Program%20Files*",
        "*:/Windows/System32/*",
        "*https://installer.teams.static.microsoft/*",
        "*https://res.cdn.office.net*",
        "*https://statics.teams.cdn.live.net/*",
        "*https://statics.teams.cdn.office.net/*",
        "*microsoft.com*",
        "*AppData/Local/Temp/WinGet/Microsoft.Winget.Source*",
        "*AppData\\\\Local\\\\Temp\\\\WinGet\\\\Microsoft.Winget.Source*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-appxdeploymentserver/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-AppXDeploymentServer/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "854"
      ],
      "raw_values": [
        "854"
      ]
    },
    {
      "field": "winlog.event_data.path",
      "raw_field": "winlog.event_data.Path",
      "operator": ":",
      "values": [
        "appdata\\\\local\\\\microsoft\\\\onedrive\\\\",
        "x-windowsupdate://"
      ],
      "raw_values": [
        "*AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*",
        "*x-windowsupdate://*"
      ]
    }
  ]
}