{
  "source": "sigma",
  "name": "win_defender_virus_scan_disabled",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/windefend/win_defender_virus_scan_disabled.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-Windows Defender/Operational\" and event.code:\"5012\"",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-windows defender/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-Windows Defender/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "5012"
      ],
      "raw_values": [
        "5012"
      ]
    }
  ]
}