{
  "source": "sigma",
  "name": "win_cve_2023_21554_msmq_corrupted_packet",
  "subtree": "rules-emerging-threats",
  "category": "any",
  "sigma_path": "rules-emerging-threats/2023/Exploits/CVE-2023-21554/win_cve_2023_21554_msmq_corrupted_packet.eql",
  "raw_query": "any where winlog.channel:\"Application\" and (winlog.provider_name:\"MSMQ\" and event.code:\"2027\" and winlog.event_data.Level:\"2\")",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "application"
      ],
      "raw_values": [
        "Application"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "msmq"
      ],
      "raw_values": [
        "MSMQ"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "2027"
      ],
      "raw_values": [
        "2027"
      ]
    }
  ]
}