{
  "source": "sigma",
  "name": "win_security_user_logoff",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/security/win_security_user_logoff.eql",
  "raw_query": "any where winlog.channel:\"Security\" and (event.code like~ (\"4634\", \"4647\"))",
  "conditions": [
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "like~",
      "values": [
        "4634",
        "4647"
      ],
      "raw_values": [
        "4634",
        "4647"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    }
  ]
}