{
  "source": "sigma",
  "name": "win_dns_server_failed_dns_zone_transfer",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/dns_server/win_dns_server_failed_dns_zone_transfer.eql",
  "raw_query": "any where winlog.channel:\"DNS Server\" and event.code:\"6004\"",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "dns server"
      ],
      "raw_values": [
        "DNS Server"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "6004"
      ],
      "raw_values": [
        "6004"
      ]
    }
  ]
}