{
  "source": "sigma",
  "name": "win_firewall_as_failed_load_gpo",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/firewall_as/win_firewall_as_failed_load_gpo.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-Windows Firewall With Advanced Security/Firewall\" and event.code:\"2009\"",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-windows firewall with advanced security/firewall"
      ],
      "raw_values": [
        "Microsoft-Windows-Windows Firewall With Advanced Security/Firewall"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "2009"
      ],
      "raw_values": [
        "2009"
      ]
    }
  ]
}