{
  "source": "sigma",
  "name": "win_terminalservices_rdp_ngrok",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/terminalservices/win_terminalservices_rdp_ngrok.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-TerminalServices-LocalSessionManager/Operational\" and (event.code:\"21\" and winlog.event_data.Address:\"*16777216*\")",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-terminalservices-localsessionmanager/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational"
      ]
    },
    {
      "field": "winlog.event_data.address",
      "raw_field": "winlog.event_data.Address",
      "operator": ":",
      "values": [
        "16777216"
      ],
      "raw_values": [
        "*16777216*"
      ]
    }
  ]
}