{
  "source": "sigma",
  "name": "win_security_susp_opened_encrypted_zip_outlook",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/security/win_security_susp_opened_encrypted_zip_outlook.eql",
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"5379\" and (winlog.event_data.TargetName:\"*Microsoft_Windows_Shell_ZipFolder:filename*\" and winlog.event_data.TargetName:\"*\\\\Temporary Internet Files\\\\Content.Outlook*\"))",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "5379"
      ],
      "raw_values": [
        "5379"
      ]
    },
    {
      "field": "winlog.event_data.targetname",
      "raw_field": "winlog.event_data.TargetName",
      "operator": ":",
      "values": [
        "microsoft_windows_shell_zipfolder:filename",
        "\\\\temporary internet files\\\\content.outlook"
      ],
      "raw_values": [
        "*Microsoft_Windows_Shell_ZipFolder:filename*",
        "*\\\\Temporary Internet Files\\\\Content.Outlook*"
      ]
    }
  ]
}