any where winlog.channel:"Microsoft-Windows-AppXDeploymentServer/Operational" and (event.code:"854" and (not ((winlog.event_data.Path like~ ("*:/Program%20Files*", "*:/Windows/System32/*", "*:\\Program Files (x86)\\*", "*:\\Program Files\\*", "*:\\Windows\\ImmersiveControlPanel\\*", "*:\\Windows\\PrintDialog\\*", "*:\\Windows\\SystemApps\\*", "*AppData/Local/Temp/WinGet/Microsoft.Winget.Source*", "*x-windowsupdate://*")) or (winlog.event_data.Path like~ ("*https://installer.teams.static.microsoft/*", "*https://res.cdn.office.net*", "*https://statics.teams.cdn.live.net/*", "*https://statics.teams.cdn.office.net/*", "*microsoft.com*")))) and (not (winlog.event_data.Path:"*AppData\\Local\\Microsoft\\OneDrive\\*" or (winlog.event_data.Path like~ ("*AppData/Local/Temp/WinGet/Microsoft.Winget.Source*", "*AppData\\Local\\Temp\\WinGet\\Microsoft.Winget.Source*")) or winlog.event_data.Path:"*x-windowsupdate://*")))