any where winlog.channel:"Microsoft-Windows-AppXDeploymentServer/Operational" and (event.code:"854" and ((winlog.event_data.Path like~ ("*:/Perflogs/*", "*:/Users/Public/*", "*:/Windows/Temp/*", "*/AppdData/Local/Temp/*", "*/Desktop/*", "*/Downloads/*")) or (winlog.event_data.Path like~ ("*:\\PerfLogs\\*", "*:\\Users\\Public\\*", "*:\\Windows\\Temp\\*", "*\\AppdData\\Local\\Temp\\*", "*\\Desktop\\*", "*\\Downloads\\*"))))