any where winlog.channel:"Microsoft-Windows-TaskScheduler/Operational" and ((event.code like~ ("129", "140", "141")) and (winlog.event_data.TaskName like~ ("\\defender", "\\Microsoft\\DefenderService", "\\Microsoft\\Windows\\Application Experience\\StartupAppTaskCheck", "\\Microsoft\\Windows\\Application Experience\\StartupAppTaskCkeck", "\\Microsoft\\Windows\\ATPUpd", "\\Microsoft\\Windows\\Data Integrity Scan\\Data Integrity Update", "\\Microsoft\\Windows\\DefenderUPDService", "\\Microsoft\\Windows\\IISUpdateService", "\\Microsoft\\Windows\\Speech\\SpeechModelInstallTask", "\\Microsoft\\Windows\\WiMSDFS", "\\Microsoft\\Windows\\Windows Defender\\Defender Update Service", "\\Microsoft\\Windows\\Windows Defender\\Service Update", "\\Microsoft\\Windows\\Windows Error Reporting\\CheckReporting", "\\Microsoft\\Windows\\Windows Error Reporting\\SubmitReporting", "\\Microsoft\\Windows\\Windows Filtering Platform\\BfeOnServiceStart", "\\Microsoft\\Windows\\WindowsDefenderService", "\\Microsoft\\Windows\\WindowsDefenderService2", "\\Microsoft\\Windows\\WindowsUpdate\\Scheduled AutoCheck", "\\Microsoft\\Windows\\WindowsUpdate\\Scheduled Check", "\\WindowUpdate")))