{
  "source": "elastic",
  "name": "Network Connection to OAST Domain via Script Interpreter",
  "slug": "command_and_control_network_connection_to_oast_domain",
  "category": "any",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Command and Control",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/macos/command_and_control_network_connection_to_oast_domain.toml",
  "raw_query": "sequence by process.entity_id with maxspan=1m\n  [process where host.os.type == \"macos\" and event.type == \"start\" and event.action == \"exec\" and\n    (process.name == \"node\" or process.name like (\"python*\", \"ruby*\", \"perl*\"))]\n  [network where host.os.type == \"macos\" and event.type == \"start\" and destination.domain like \"*.oast*\"]\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "python",
        "ruby",
        "perl"
      ],
      "raw_values": [
        "python*",
        "ruby*",
        "perl*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "node"
      ],
      "raw_values": [
        "node"
      ]
    },
    {
      "field": "destination.domain",
      "raw_field": "destination.domain",
      "operator": "like",
      "values": [
        ".oast"
      ],
      "raw_values": [
        "*.oast*"
      ]
    }
  ]
}