{
  "source": "elastic",
  "name": "Network Activity to a Suspicious Top Level Domain",
  "slug": "command_and_control_dns_susp_tld",
  "category": "network",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Command and Control",
    "Resources: Investigation Guide",
    "Data Source: Elastic Endgame",
    "Data Source: Elastic Defend",
    "Data Source: SentinelOne",
    "Data Source: Crowdstrike",
    "Data Source: Sysmon"
  ],
  "elastic_path": "rules/windows/command_and_control_dns_susp_tld.toml",
  "raw_query": "network where host.os.type == \"windows\" and dns.question.name != null and\n (\n  process.name : (\"MSBuild.exe\", \"mshta.exe\", \"wscript.exe\", \"powershell.exe\", \"pwsh.exe\", \"msiexec.exe\", \"rundll32.exe\",\n                  \"bitsadmin.exe\", \"InstallUtil.exe\", \"python.exe\", \"regsvr32.exe\", \"dllhost.exe\", \"node.exe\", \"curl.exe\",\n                  \"java.exe\", \"javaw.exe\", \"*.pif\", \"*.com\", \"*.scr\") or\n  (?process.code_signature.trusted == false or ?process.code_signature.exists == false) or\n  ?process.code_signature.subject_name : (\"AutoIt Consulting Ltd\", \"OpenJS Foundation\", \"Python Software Foundation\") or\n  ?process.executable : (\n    \"?:\\\\Users\\\\Public\\\\*.exe\", \"?:\\\\ProgramData\\\\*.exe\", \"?:\\\\Users\\\\*\\\\Downloads\\\\*.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Users\\\\Public\\\\*.exe\", \"\\\\Device\\\\HarddiskVolume*\\\\ProgramData\\\\*.exe\", \"\\\\Device\\\\HarddiskVolume*\\\\Users\\\\*\\\\Downloads\\\\*.exe\"\n  )\n ) and\ndns.question.name regex \"\"\".*\\.(top|buzz|xyz|rest|ml|cf|gq|ga|onion|monster|cyou|quest|cc|bar|cfd|click|cam|surf|tk|shop|club|icu|pw|ws|online|fun|life|boats|store|hair|skin|motorcycles|christmas|lol|makeup|mom|bond|beauty|biz|live|work|zip|country|accountant|date|party|science|loan|win|men|faith|review|racing|download|host|zone)\"\"\" and\n\nnot process.executable : (\n    \"?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\platform\\\\*\\\\*.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\platform\\\\*\\\\*.exe\"\n)\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "msbuild.exe",
        "mshta.exe",
        "wscript.exe",
        "powershell.exe",
        "pwsh.exe",
        "msiexec.exe",
        "rundll32.exe",
        "bitsadmin.exe",
        "installutil.exe",
        "python.exe",
        "regsvr32.exe",
        "dllhost.exe",
        "node.exe",
        "curl.exe",
        "java.exe",
        "javaw.exe",
        ".pif",
        ".com",
        ".scr",
        ".exe"
      ],
      "raw_values": [
        "MSBuild.exe",
        "mshta.exe",
        "wscript.exe",
        "powershell.exe",
        "pwsh.exe",
        "msiexec.exe",
        "rundll32.exe",
        "bitsadmin.exe",
        "InstallUtil.exe",
        "python.exe",
        "regsvr32.exe",
        "dllhost.exe",
        "node.exe",
        "curl.exe",
        "java.exe",
        "javaw.exe",
        "*.pif",
        "*.com",
        "*.scr",
        "?:\\\\Users\\\\Public\\\\*.exe",
        "?:\\\\ProgramData\\\\*.exe",
        "?:\\\\Users\\\\*\\\\Downloads\\\\*.exe",
        "\\\\Device\\\\HarddiskVolume*\\\\Users\\\\Public\\\\*.exe",
        "\\\\Device\\\\HarddiskVolume*\\\\ProgramData\\\\*.exe",
        "\\\\Device\\\\HarddiskVolume*\\\\Users\\\\*\\\\Downloads\\\\*.exe",
        "?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\platform\\\\*\\\\*.exe",
        "\\\\Device\\\\HarddiskVolume*\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\platform\\\\*\\\\*.exe"
      ]
    },
    {
      "field": "process.code_signature.subject_name",
      "raw_field": "process.code_signature.subject_name",
      "operator": ":",
      "values": [
        "autoit consulting ltd",
        "openjs foundation",
        "python software foundation"
      ],
      "raw_values": [
        "AutoIt Consulting Ltd",
        "OpenJS Foundation",
        "Python Software Foundation"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    }
  ]
}