{
  "source": "elastic",
  "name": "Potential ADIDNS Poisoning via Wildcard Record Creation",
  "slug": "credential_access_adidns_wildcard",
  "category": "any",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Data Source: Active Directory",
    "Use Case: Active Directory Monitoring",
    "Data Source: Windows Security Event Logs",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/windows/credential_access_adidns_wildcard.toml",
  "raw_query": "any where host.os.type == \"windows\" and event.code == \"5137\" and\n    startsWith(winlog.event_data.ObjectDN, \"DC=*,\")\n",
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "5137"
      ],
      "raw_values": [
        "5137"
      ]
    }
  ]
}