{
  "source": "elastic",
  "name": "Potential Successful SSH Brute Force Attack",
  "slug": "credential_access_potential_successful_linux_ssh_bruteforce",
  "category": "any",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/credential_access_potential_successful_linux_ssh_bruteforce.toml",
  "raw_query": "sequence by host.id, source.ip, user.name with maxspan=15s\n  [authentication where host.os.type == \"linux\" and event.action  in (\"ssh_login\", \"user_login\") and\n   event.outcome == \"failure\" and source.ip != null and source.ip != \"0.0.0.0\" and source.ip != \"::\" ] with runs=25\n  [authentication where host.os.type == \"linux\" and event.action  in (\"ssh_login\", \"user_login\") and\n   event.outcome == \"success\" and source.ip != null and source.ip != \"0.0.0.0\" and source.ip != \"::\" ]\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "ssh_login",
        "user_login"
      ],
      "raw_values": [
        "ssh_login",
        "user_login"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "failure",
        "success"
      ],
      "raw_values": [
        "failure",
        "success"
      ]
    },
    {
      "field": "source.ip",
      "raw_field": "source.ip",
      "operator": "!=",
      "values": [
        "0.0.0.0"
      ],
      "raw_values": [
        "0.0.0.0",
        "::"
      ]
    }
  ]
}