{
  "source": "elastic",
  "name": "M365 Identity OAuth Flow by User Sign-in to Device Registration",
  "slug": "credential_access_entra_id_device_reg_via_oauth_redirection",
  "category": "any",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Cloud",
    "Domain: SaaS",
    "Data Source: Microsoft 365",
    "Data Source: Microsoft 365 Audit Logs",
    "Use Case: Identity and Access Audit",
    "Tactic: Credential Access",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/integrations/o365/credential_access_entra_id_device_reg_via_oauth_redirection.toml",
  "raw_query": "sequence by related.user with maxspan=30m\n[authentication where event.action == \"UserLoggedIn\" and\n o365.audit.ExtendedProperties.RequestType == \"OAuth2:Authorize\" and o365.audit.ExtendedProperties.ResultStatusDetail == \"Redirect\" and\n o365.audit.UserType: (\"0\", \"2\", \"3\", \"10\")] // victim source.ip\n[authentication where event.action == \"UserLoggedIn\" and\n o365.audit.ExtendedProperties.RequestType == \"OAuth2:Token\" and o365.audit.ExtendedProperties.ResultStatusDetail == \"Success\"] // attacker source.ip to convert oauth code to token\n[web where data_stream.dataset == \"o365.audit\" and event.action == \"Add registered users to device.\"] // user.name is captured in related.user\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "userloggedin",
        "add registered users to device."
      ],
      "raw_values": [
        "UserLoggedIn",
        "Add registered users to device."
      ]
    },
    {
      "field": "o365.audit.extendedproperties.requesttype",
      "raw_field": "o365.audit.ExtendedProperties.RequestType",
      "operator": "==",
      "values": [
        "oauth2:authorize",
        "oauth2:token"
      ],
      "raw_values": [
        "OAuth2:Authorize",
        "OAuth2:Token"
      ]
    },
    {
      "field": "o365.audit.extendedproperties.resultstatusdetail",
      "raw_field": "o365.audit.ExtendedProperties.ResultStatusDetail",
      "operator": "==",
      "values": [
        "redirect",
        "success"
      ],
      "raw_values": [
        "Redirect",
        "Success"
      ]
    },
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "o365.audit"
      ],
      "raw_values": [
        "o365.audit"
      ]
    }
  ]
}