{
  "source": "elastic",
  "name": "SystemKey Access via Command Line",
  "slug": "credential_access_systemkey_dumping",
  "category": "process",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/macos/credential_access_systemkey_dumping.toml",
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n  process.args in (\"/private/var/db/SystemKey\", \"/var/db/SystemKey\") and\n  not process.Ext.effective_parent.executable like \"/Library/Elastic/Endpoint/elastic-endpoint.app/Contents/MacOS/elastic-endpoint\"\n",
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "systemkey"
      ],
      "raw_values": [
        "/private/var/db/SystemKey",
        "/var/db/SystemKey"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.ext.effective_parent.executable",
      "raw_field": "process.Ext.effective_parent.executable",
      "operator": "like",
      "values": [
        "/library/elastic/endpoint/elastic-endpoint.app/contents/macos/elastic-endpoint"
      ],
      "raw_values": [
        "/Library/Elastic/Endpoint/elastic-endpoint.app/Contents/MacOS/elastic-endpoint"
      ]
    }
  ]
}