{
  "source": "elastic",
  "name": "Multiple Logon Failure Followed by Logon Success",
  "slug": "credential_access_bruteforce_multiple_logon_failure_followed_by_success",
  "category": "any",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Resources: Investigation Guide",
    "Data Source: Windows Security Event Logs"
  ],
  "elastic_path": "rules/windows/credential_access_bruteforce_multiple_logon_failure_followed_by_success.toml",
  "raw_query": "sequence by winlog.computer_name, source.ip with maxspan=5s\n  [authentication where host.os.type == \"windows\" and event.action == \"logon-failed\" and\n    /* event 4625 need to be logged */\n    winlog.logon.type : \"Network\" and user.id != null and \n    source.ip != null and source.ip != \"127.0.0.1\" and source.ip != \"::1\" and \n    not winlog.event_data.TargetUserSid : \"S-1-0-0\" and not user.id : \"S-1-0-0\" and \n    not user.name : (\"ANONYMOUS LOGON\", \"-\", \"*$\") and not user.domain == \"NT AUTHORITY\" and\n\n    /* noisy failure status codes often associated to authentication misconfiguration */\n    not winlog.event_data.Status : (\"0xC000015B\", \"0XC000005E\", \"0XC0000133\", \"0XC0000192\")] with runs=5\n  [authentication where host.os.type == \"windows\" and event.action == \"logged-in\" and\n    /* event 4624 need to be logged */\n    winlog.logon.type : \"Network\" and\n    source.ip != null and source.ip != \"127.0.0.1\" and source.ip != \"::1\" and\n    not user.name : (\"ANONYMOUS LOGON\", \"-\", \"*$\") and not user.domain == \"NT AUTHORITY\"]\n",
  "conditions": [
    {
      "field": "user.name",
      "raw_field": "user.name",
      "operator": ":",
      "values": [
        "anonymous logon"
      ],
      "raw_values": [
        "ANONYMOUS LOGON",
        "-",
        "*$"
      ]
    },
    {
      "field": "winlog.event_data.status",
      "raw_field": "winlog.event_data.Status",
      "operator": ":",
      "values": [
        "0xc000015b",
        "0xc000005e",
        "0xc0000133",
        "0xc0000192"
      ],
      "raw_values": [
        "0xC000015B",
        "0XC000005E",
        "0XC0000133",
        "0XC0000192"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "logon-failed",
        "logged-in"
      ],
      "raw_values": [
        "logon-failed",
        "logged-in"
      ]
    },
    {
      "field": "winlog.logon.type",
      "raw_field": "winlog.logon.type",
      "operator": ":",
      "values": [
        "network"
      ],
      "raw_values": [
        "Network"
      ]
    },
    {
      "field": "source.ip",
      "raw_field": "source.ip",
      "operator": "!=",
      "values": [
        "127.0.0.1",
        "::1"
      ],
      "raw_values": [
        "127.0.0.1",
        "::1"
      ]
    },
    {
      "field": "winlog.event_data.targetusersid",
      "raw_field": "winlog.event_data.TargetUserSid",
      "operator": ":",
      "values": [
        "s-1-0-0"
      ],
      "raw_values": [
        "S-1-0-0"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": ":",
      "values": [
        "s-1-0-0"
      ],
      "raw_values": [
        "S-1-0-0"
      ]
    },
    {
      "field": "user.domain",
      "raw_field": "user.domain",
      "operator": "==",
      "values": [
        "nt authority"
      ],
      "raw_values": [
        "NT AUTHORITY"
      ]
    }
  ]
}