{
  "source": "elastic",
  "name": "Potential Hex Payload Execution via Command-Line",
  "slug": "defense_evasion_hex_payload_execution_via_commandline",
  "category": "process",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Tactic: Execution",
    "Data Source: Auditd Manager",
    "Data Source: Elastic Defend",
    "Data Source: Elastic Endgame",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/defense_evasion_hex_payload_execution_via_commandline.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\", \"process_started\") and\n?process.parent.executable != null and\nprocess.command_line : \"*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\\\\x*\" and\nlength(process.command_line) > 50 and\nnot process.name in (\"snap\", \"printf\", \"sed\")\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "snap",
        "printf",
        "sed"
      ],
      "raw_values": [
        "snap",
        "printf",
        "sed"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ]
}