{
  "source": "elastic",
  "name": "Machine Learning Detected a Suspicious Windows Event with a Low Malicious Probability Score",
  "slug": "defense_evasion_ml_suspicious_windows_event_low_probability",
  "category": "process",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "OS: Windows",
    "Data Source: Elastic Endgame",
    "Use Case: Living off the Land Attack Detection",
    "Rule Type: ML",
    "Rule Type: Machine Learning",
    "Tactic: Defense Evasion",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/integrations/problemchild/defense_evasion_ml_suspicious_windows_event_low_probability.toml",
  "raw_query": "process where ((problemchild.prediction == 1 and problemchild.prediction_probability <= 0.98) or\nblocklist_label == 1) and not process.args : (\"*C:\\\\WINDOWS\\\\temp\\\\nessus_*.txt*\", \"*C:\\\\WINDOWS\\\\temp\\\\nessus_*.tmp*\") and\nprocess.parent.executable != null and not user.id in (\"S-1-5-18\", \"S-1-5-19\", \"S-1-5-20\") and\nnot process.parent.name : (\"cmd.exe\", \"powershell.exe\") and\nnot (process.name == \"net1.exe\" and process.parent.name == \"net.exe\") and\nnot (process.parent.executable : \"C:\\\\Windows\\\\System32\\\\svchost.exe\" and\n     process.name : (\"UCPDMgr.exe\", \"sdbinst.exe\", \"gpupdate.exe\", \"rundll32.exe\", \"taskhostw.exe\", \"taskeng.exe\")) and\nnot (process.name: (\"powershell.exe\", \"cmd.exe\", \"cscript.exe\") and\n     process.parent.executable : (\"C:\\\\Program Files\\\\*.exe\",\n                                  \"C:\\\\Program Files (x86)\\\\*.exe\",\n                                  \"C:\\\\Users\\\\*\\\\Documents\\\\scripts\\\\nssm-2.24\\\\win64\\\\nssm.exe\",\n                                  \"C:\\\\Windows\\\\System32\\\\cmd.exe\",\n                                  \"C:\\\\Windows\\\\SysWOW64\\\\cmd.exe\",\n                                  \"C:\\\\Windows\\\\CCM\\\\CcmExec.exe\",\n                                  \"C:\\\\Windows\\\\System32\\\\svchost.exe\",\n                                  \"C:\\\\Windows\\\\System32\\\\gpscript.exe\",\n                                  \"C:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe\",\n                                  \"C:\\\\appian\\\\java\\\\bin\\\\java.exe\")) and\nnot (process.executable : \"C:\\\\Windows\\\\System32\\\\cscript.exe\" and process.parent.name : (\"node.exe\", \"MicroStrategy Services.exe\")) and\nnot (process.name : \"MpCmdRun.exe\" and process.parent.name : (\"MsMpEng.exe\", \"MpCmdRun.exe\", \"svchost.exe\")) and\nnot process.executable : (\"C:\\\\Program Files\\\\*.exe\", \"C:\\\\Program Files (x86)\\\\*.exe\")\n",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "nessus_*.txt",
        "nessus_*.tmp"
      ],
      "raw_values": [
        "*C:\\\\WINDOWS\\\\temp\\\\nessus_*.txt*",
        "*C:\\\\WINDOWS\\\\temp\\\\nessus_*.tmp*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "cmd.exe",
        "powershell.exe",
        ".exe",
        "node.exe",
        "microstrategy services.exe",
        "msmpeng.exe",
        "mpcmdrun.exe",
        "svchost.exe"
      ],
      "raw_values": [
        "cmd.exe",
        "powershell.exe",
        "C:\\\\Program Files\\\\*.exe",
        "node.exe",
        "MicroStrategy Services.exe",
        "MsMpEng.exe",
        "MpCmdRun.exe",
        "svchost.exe",
        "C:\\\\Windows\\\\System32\\\\svchost.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "ucpdmgr.exe",
        "sdbinst.exe",
        "gpupdate.exe",
        "rundll32.exe",
        "taskhostw.exe",
        "taskeng.exe",
        "powershell.exe",
        "cmd.exe",
        "cscript.exe",
        ".exe",
        "mpcmdrun.exe"
      ],
      "raw_values": [
        "UCPDMgr.exe",
        "sdbinst.exe",
        "gpupdate.exe",
        "rundll32.exe",
        "taskhostw.exe",
        "taskeng.exe",
        "powershell.exe",
        "cmd.exe",
        "cscript.exe",
        "C:\\\\Program Files\\\\*.exe",
        "C:\\\\Windows\\\\System32\\\\cscript.exe",
        "MpCmdRun.exe"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": "in",
      "values": [
        "s-1-5-18",
        "s-1-5-19",
        "s-1-5-20"
      ],
      "raw_values": [
        "S-1-5-18",
        "S-1-5-19",
        "S-1-5-20"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "net1.exe"
      ],
      "raw_values": [
        "net1.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "==",
      "values": [
        "net.exe"
      ],
      "raw_values": [
        "net.exe"
      ]
    }
  ]
}