{
  "source": "elastic",
  "name": "Suspicious Execution from a Mounted Device",
  "slug": "defense_evasion_suspicious_execution_from_mounted_device",
  "category": "process",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Tactic: Execution",
    "Data Source: Elastic Defend",
    "Data Source: Sysmon",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/windows/defense_evasion_suspicious_execution_from_mounted_device.toml",
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and process.executable : \"C:\\\\*\" and\n  (\n    process.working_directory : (\"D:\\\\*\", \"E:\\\\*\", \"F:\\\\*\") or\n    ?process.Ext.device.product_id : (\"Virtual DVD-ROM\", \"Virtual Disk\")\n  ) and\n  process.parent.name : \"explorer.exe\" and\n  process.name : (\n    \"rundll32.exe\", \"mshta.exe\", \"powershell.exe\", \"pwsh.exe\", \"cmd.exe\", \"regsvr32.exe\", \"cscript.exe\",\n    \"wscript.exe\", \"certutil.exe\", \"bitsadmin.exe\", \"msiexec.exe\", \"wmic.exe\", \"schtasks.exe\", \"msbuild.exe\"\n  )\n",
  "conditions": [
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": ":",
      "values": [
        "d:\\\\",
        "e:\\\\",
        "f:\\\\"
      ],
      "raw_values": [
        "D:\\\\*",
        "E:\\\\*",
        "F:\\\\*"
      ]
    },
    {
      "field": "process.ext.device.product_id",
      "raw_field": "process.Ext.device.product_id",
      "operator": ":",
      "values": [
        "virtual dvd-rom",
        "virtual disk"
      ],
      "raw_values": [
        "Virtual DVD-ROM",
        "Virtual Disk"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "rundll32.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.exe",
        "cmd.exe",
        "regsvr32.exe",
        "cscript.exe",
        "wscript.exe",
        "certutil.exe",
        "bitsadmin.exe",
        "msiexec.exe",
        "wmic.exe",
        "schtasks.exe",
        "msbuild.exe"
      ],
      "raw_values": [
        "rundll32.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.exe",
        "cmd.exe",
        "regsvr32.exe",
        "cscript.exe",
        "wscript.exe",
        "certutil.exe",
        "bitsadmin.exe",
        "msiexec.exe",
        "wmic.exe",
        "schtasks.exe",
        "msbuild.exe",
        "C:\\\\*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "explorer.exe"
      ],
      "raw_values": [
        "explorer.exe"
      ]
    }
  ]
}