{
  "source": "elastic",
  "name": "Potential Microsoft Office Sandbox Evasion",
  "slug": "defense_evasion_sandboxed_office_app_suspicious_zip_file",
  "category": "file",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/macos/defense_evasion_sandboxed_office_app_suspicious_zip_file.toml",
  "raw_query": "file where host.os.type == \"macos\" and event.action in (\"modification\", \"rename\") and file.name like~ \"~$*.zip\"\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "modification",
        "rename"
      ],
      "raw_values": [
        "modification",
        "rename"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": "like~",
      "values": [
        "~$*.zip"
      ],
      "raw_values": [
        "~$*.zip"
      ]
    }
  ]
}