{
  "source": "elastic",
  "name": "Suspicious Python Shell Command Execution",
  "slug": "execution_suspicious_python_command_execution",
  "category": "any",
  "language": "esql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Execution",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/cross-platform/execution_suspicious_python_command_execution.toml",
  "raw_query": "FROM logs-endpoint.events.process-* METADATA _id, _version, _index\n\n| WHERE host.os.type in (\"linux\", \"macos\") and event.type == \"start\" and TO_LOWER(process.parent.name) like \"python*\" and\n  process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\n  KQL(\"\"\"event.action:\"exec\" and process.args:(\"-c\" or \"-cl\" or \"-lc\")\"\"\")\n\n// truncate timestamp to 1-minute window\n| EVAL Esql.time_window_date_trunc = DATE_TRUNC(1 minutes, @timestamp)\n\n| EVAL Esql.process_command_line_patterns = CASE(\n  process.command_line like \"*grep*\", \"grep\",\n  process.command_line like \"*find*\", \"find\",\n  process.command_line like \"*curl*\", \"curl\",\n  process.command_line like \"*env *\", \"environment_enumeration\",\n  process.command_line like \"*wget*\", \"wget\",\n  process.command_line like \"*whoami*\" or process.command_line like \"*uname*\" or process.command_line like \"*hostname*\", \"discovery\", \"other\"\n)\n\n| KEEP\n    @timestamp,\n    _id,\n    _index,\n    _version,\n    Esql.process_command_line_patterns,\n    Esql.time_window_date_trunc,\n    host.os.type,\n    event.type,\n    event.action,\n    process.parent.name,\n    process.working_directory,\n    process.parent.working_directory,\n    process.name,\n    process.executable,\n    process.command_line,\n    process.parent.executable,\n    process.parent.entity_id,\n    agent.id,\n    host.name,\n    data_stream.dataset,\n    data_stream.namespace\n\n| STATS\n  Esql.process_command_line_count_distinct = COUNT_DISTINCT(process.command_line),\n  Esql.patterns_count_distinct = COUNT_DISTINCT(Esql.process_command_line_patterns),\n  Esql.process_command_line_values = VALUES(process.command_line),\n  Esql.host_name_values = values(host.name),\n  Esql.agent_id_values = values(agent.id),\n  Esql.data_stream_dataset_values = values(data_stream.dataset),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n  BY process.parent.entity_id, agent.id, host.name, Esql.time_window_date_trunc\n\n| SORT Esql.process_command_line_count_distinct DESC\n| WHERE Esql.process_command_line_count_distinct >= 5 AND Esql.patterns_count_distinct >= 4\n",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "-cl",
        "-lc"
      ],
      "raw_values": [
        "-c",
        "-cl",
        "-lc"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "in",
      "values": [
        "linux",
        "macos"
      ],
      "raw_values": [
        "linux",
        "macos"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": ":",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like",
      "values": [
        "grep",
        "find",
        "curl",
        "env",
        "wget",
        "whoami",
        "uname",
        "hostname"
      ],
      "raw_values": [
        "*grep*",
        "*find*",
        "*curl*",
        "*env *",
        "*wget*",
        "*whoami*",
        "*uname*",
        "*hostname*"
      ]
    }
  ]
}