{
  "source": "elastic",
  "name": "Unusual Execution via Microsoft Common Console File",
  "slug": "execution_initial_access_via_msc_file",
  "category": "process",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Execution",
    "Tactic: Initial Access",
    "Resources: Investigation Guide",
    "Data Source: Elastic Endgame",
    "Data Source: Elastic Defend",
    "Data Source: Sysmon",
    "Data Source: Microsoft Defender for Endpoint",
    "Data Source: SentinelOne"
  ],
  "elastic_path": "rules/windows/execution_initial_access_via_msc_file.toml",
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.parent.executable : \"?:\\\\Windows\\\\System32\\\\mmc.exe\" and endswith~(process.parent.args, \".msc\") and\n  not (\n    process.parent.args : (\n      \"?:\\\\Windows\\\\System32\\\\*.msc\",\n      \"?:\\\\Windows\\\\SysWOW64\\\\*.msc\",\n      \"?:\\\\Program files\\\\*.msc\",\n      \"?:\\\\Program Files (x86)\\\\*.msc\"\n    ) or\n    (\n      process.executable : \"?:\\\\Windows\\\\System32\\\\mmc.exe\" and\n      process.command_line : \"\\\"C:\\\\WINDOWS\\\\system32\\\\mmc.exe\\\" \\\"C:\\\\Windows\\\\System32\\\\gpme.msc\\\" /s /gpobject:\\\"LDAP://*\"\n    ) or\n    (\n      process.executable : (\n        \"?:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\",\n        \"?:\\\\Program Files\\\\Mozilla Firefox\\\\firefox.exe\",\n        \"?:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\",\n        \"?:\\\\Program Files\\\\internet explorer\\\\iexplore.exe\"\n      ) and\n      process.args : \"http*://go.microsoft.com/fwlink/*\"\n    ) or\n    process.executable : (\n      \"?:\\\\Windows\\\\System32\\\\vmconnect.exe\",\n      \"?:\\\\Windows\\\\System32\\\\WerFault.exe\",\n      \"?:\\\\Windows\\\\System32\\\\wermgr.exe\"\n    )\n  )\n",
  "conditions": [
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": ":",
      "values": [
        ":\\\\windows\\\\system32\\\\*.msc",
        ":\\\\windows\\\\syswow64\\\\*.msc",
        ":\\\\program files\\\\*.msc"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\*.msc",
        "?:\\\\Windows\\\\SysWOW64\\\\*.msc",
        "?:\\\\Program files\\\\*.msc"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vmconnect.exe",
        "werfault.exe",
        "wermgr.exe",
        "mmc.exe"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\vmconnect.exe",
        "?:\\\\Windows\\\\System32\\\\WerFault.exe",
        "?:\\\\Windows\\\\System32\\\\wermgr.exe",
        "?:\\\\Windows\\\\System32\\\\mmc.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "mmc.exe"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\mmc.exe"
      ]
    }
  ]
}