{
  "source": "elastic",
  "name": "Service Account Token or Certificate Access Followed by Kubernetes API Request",
  "slug": "execution_d4c_k8s_mda_service_account_token_access_followed_by_kubernetes_api_request",
  "category": "any",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Data Source: Elastic Defend for Containers",
    "Data Source: Kubernetes",
    "Domain: Container",
    "Domain: Kubernetes",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Execution",
    "Tactic: Credential Access",
    "Tactic: Discovery",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/cross-platform/execution_d4c_k8s_mda_service_account_token_access_followed_by_kubernetes_api_request.toml",
  "raw_query": "sequence with maxspan=60s\n  [file where host.os.type == \"linux\" and event.type == \"change\" and event.action == \"open\" and\n   file.path in (\"/var/run/secrets/kubernetes.io/serviceaccount/token\", \"/var/run/secrets/kubernetes.io/serviceaccount/ca.crt\") and\n   process.interactive == true and container.id like \"*\"] by orchestrator.resource.name\n  [any where data_stream.dataset == \"kubernetes.audit_logs\" and kubernetes.audit.stage in (\"ResponseComplete\", \"ResponseStarted\")] by `kubernetes.audit.user.extra.authentication.kubernetes.io/pod-name`\n",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "in",
      "values": [
        "token",
        "ca.crt"
      ],
      "raw_values": [
        "/var/run/secrets/kubernetes.io/serviceaccount/token",
        "/var/run/secrets/kubernetes.io/serviceaccount/ca.crt"
      ]
    },
    {
      "field": "kubernetes.audit.stage",
      "raw_field": "kubernetes.audit.stage",
      "operator": "in",
      "values": [
        "responsecomplete",
        "responsestarted"
      ],
      "raw_values": [
        "ResponseComplete",
        "ResponseStarted"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change"
      ],
      "raw_values": [
        "change"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "open"
      ],
      "raw_values": [
        "open"
      ]
    },
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "kubernetes.audit_logs"
      ],
      "raw_values": [
        "kubernetes.audit_logs"
      ]
    }
  ]
}