{
  "source": "elastic",
  "name": "Interactive Terminal Spawned via Perl",
  "slug": "execution_perl_tty_shell",
  "category": "process",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Execution",
    "Data Source: Elastic Defend",
    "Data Source: Elastic Endgame",
    "Data Source: Auditd Manager",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/execution_perl_tty_shell.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\", \"process_started\") and\nprocess.name == \"perl\" and process.args == \"exec\" and\nprocess.args in (\n  \"\\\"sh\\\";\", \"\\\"dash\\\";\", \"\\\"bash\\\";\", \"\\\"zsh\\\";\",\n  \"\\\"/bin/sh\\\";\", \"\\\"/bin/dash\\\";\", \"\\\"/bin/bash\\\";\", \"\\\"/bin/zsh\\\";\",\n  \"\\\"/usr/bin/sh\\\";\", \"\\\"/usr/bin/dash\\\";\", \"\\\"/usr/bin/bash\\\";\", \"\\\"/usr/bin/zsh\\\";\",\n  \"\\\"/usr/local/bin/sh\\\";\", \"\\\"/usr/local/bin/dash\\\";\", \"\\\"/usr/local/bin/bash\\\";\", \"\\\"/usr/local/bin/zsh\\\";\"\n)\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "perl"
      ],
      "raw_values": [
        "perl"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    }
  ]
}