{
  "source": "elastic",
  "name": "File Transfer Utility Launched from Unusual Parent",
  "slug": "exfiltration_unusual_file_transfer_utility_launched",
  "category": "any",
  "language": "esql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Exfiltration",
    "Tactic: Execution",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/exfiltration_unusual_file_transfer_utility_launched.toml",
  "raw_query": "from logs-endpoint.events.process-* metadata _id, _index, _version\n| mv_expand event.action \n| where\n    host.os.type == \"linux\" and\n    event.type == \"start\" and\n    event.action == \"exec\" and\n    process.name in (\"scp\", \"ftp\", \"sftp\", \"vsftpd\", \"sftp-server\", \"rsync\") and (\n        (process.parent.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\")) or\n        (\n          process.parent.name like \".*\" or\n          process.parent.name like \"*.elf\" or\n          process.parent.name like \"*.sh\" or\n          process.parent.name like \"*.py\" or\n          process.parent.name like \"*.rb\" or\n          process.parent.name like \"*.pl\" or\n          process.parent.name like \"*.lua*\" or\n          process.parent.name like \"*.php*\" or\n          process.parent.name like \"*.js\"\n        ) or\n        (\n          process.parent.executable like \"/tmp/*\" or\n          process.parent.executable like \"/var/tmp/*\" or\n          process.parent.executable like \"/dev/shm/*\" or\n          process.parent.executable like \"./*\" or\n          process.parent.executable like \"/run/*\" or\n          process.parent.executable like \"/var/run/*\" or\n          process.parent.executable like \"/boot/*\" or\n          process.parent.executable like \"/sys/*\" or\n          process.parent.executable like \"/lost+found/*\" or\n          process.parent.executable like \"/proc/*\" or\n          process.parent.executable like \"/var/mail/*\" or\n          process.parent.executable like \"/var/www/*\" or\n          process.parent.executable like \"/home/*\" or\n          process.parent.executable like \"/root/*\"\n        )\n    )\n\n| keep\n    @timestamp,\n    _id,\n    _index,\n    _version,\n    host.os.type,\n    event.type,\n    event.action,\n    process.name,\n    process.parent.name,\n    process.parent.executable,\n    process.executable,\n    agent.id,\n    host.name,\n    data_stream.dataset,\n    data_stream.namespace\n\n| stats\n    Esql.event_count = count(),\n    Esql.agent_id_count_distinct = count_distinct(agent.id),\n    Esql.host_name_values = values(host.name),\n    Esql.agent_id_values = values(agent.id),\n    Esql.data_stream_dataset_values = values(data_stream.dataset),\n    Esql.data_stream_namespace_values = values(data_stream.namespace)\n\n  by process.executable, process.parent.executable\n\n| where\n    Esql.agent_id_count_distinct == 1 and\n    Esql.event_count < 5\n| sort Esql.event_count asc\n\n// Extract unique values to ECS fields for alerts exclusion\n| eval agent.id = mv_min(Esql.agent_id_values),\n       host.name = mv_min(Esql.host_name_values)\n\n| keep agent.id, host.name, process.executable, process.parent.executable, Esql.*\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "scp",
        "ftp",
        "sftp",
        "vsftpd",
        "sftp-server",
        "rsync"
      ],
      "raw_values": [
        "scp",
        "ftp",
        "sftp",
        "vsftpd",
        "sftp-server",
        "rsync"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "like",
      "values": [
        ".elf",
        ".sh",
        ".py",
        ".rb",
        ".pl",
        ".lua",
        ".php",
        ".js"
      ],
      "raw_values": [
        ".*",
        "*.elf",
        "*.sh",
        "*.py",
        "*.rb",
        "*.pl",
        "*.lua*",
        "*.php*",
        "*.js",
        "/tmp/*",
        "/var/tmp/*",
        "/dev/shm/*",
        "./*",
        "/run/*",
        "/var/run/*",
        "/boot/*",
        "/sys/*",
        "/lost+found/*",
        "/proc/*",
        "/var/mail/*",
        "/var/www/*",
        "/home/*",
        "/root/*"
      ]
    }
  ]
}