{
  "source": "elastic",
  "name": "Suspicious Execution via Scheduled Task",
  "slug": "persistence_suspicious_scheduled_task_runtime",
  "category": "process",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Tactic: Execution",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide",
    "Data Source: Sysmon"
  ],
  "elastic_path": "rules/windows/persistence_suspicious_scheduled_task_runtime.toml",
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n    /* Schedule service cmdline on Win10+ */\n    process.parent.name : \"svchost.exe\" and process.parent.args : \"Schedule\" and\n    /* add suspicious programs here */\n    process.pe.original_file_name in\n                                (\n                                  \"cscript.exe\",\n                                  \"wscript.exe\",\n                                  \"PowerShell.EXE\",\n                                  \"Cmd.Exe\",\n                                  \"MSHTA.EXE\",\n                                  \"RUNDLL32.EXE\",\n                                  \"REGSVR32.EXE\",\n                                  \"MSBuild.exe\",\n                                  \"InstallUtil.exe\",\n                                  \"RegAsm.exe\",\n                                  \"RegSvcs.exe\",\n                                  \"msxsl.exe\",\n                                  \"CONTROL.EXE\",\n                                  \"EXPLORER.EXE\",\n                                  \"Microsoft.Workflow.Compiler.exe\",\n                                  \"msiexec.exe\"\n                                  ) and\n    /* add suspicious paths here */\n    process.args : (\n       \"C:\\\\Users\\\\*\",\n       \"C:\\\\ProgramData\\\\*\",\n       \"C:\\\\Windows\\\\Temp\\\\*\",\n       \"C:\\\\Windows\\\\Tasks\\\\*\",\n       \"C:\\\\PerfLogs\\\\*\",\n       \"C:\\\\Intel\\\\*\",\n       \"C:\\\\Windows\\\\Debug\\\\*\",\n       \"C:\\\\HP\\\\*\") and\n\n    not (process.name : \"cmd.exe\" and process.args : (\"*.bat\", \"*.cmd\")) and\n    not (process.name : \"cscript.exe\" and process.args : \"?:\\\\Windows\\\\system32\\\\calluxxprovider.vbs\") and\n    not (\n       process.name : \"powershell.exe\" and\n       process.args : (\n           \"-File\", \"-PSConsoleFile\",\n           \"C:\\\\ProgramData\\\\Microsoft\\\\AutopatchSetupScheduled\\\\SetupAutopatchClientV2Package.ps1\",\n           \"C:\\\\ProgramData\\\\Microsoft\\\\AutopatchSetupScheduled\\\\SetupAutopatchClientPackage.ps1\",\n           \"C:\\\\Windows\\\\Temp\\\\MSS\\\\MDESetup\\\\Invoke-MDESetup.ps1\"\n       ) and user.id : \"S-1-5-18\"\n    ) and\n    not (process.name : \"msiexec.exe\" and user.id : \"S-1-5-18\") and\n    not (process.name : \"powershell.exe\" and\n         process.command_line : (\"C:\\\\ProgramData\\\\ElasticAgent-HealthCheck.ps1\",\n                                 \"C:\\\\ProgramData\\\\ssh\\\\puttysetup.ps1\"))\n",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        ".bat",
        ".cmd",
        "-file",
        "-psconsolefile",
        "setupautopatchclientv2package.ps1",
        "setupautopatchclientpackage.ps1",
        "invoke-mdesetup.ps1",
        "elasticagent-healthcheck.ps1",
        "puttysetup.ps1",
        "calluxxprovider.vbs"
      ],
      "raw_values": [
        "C:\\\\Users\\\\*",
        "C:\\\\ProgramData\\\\*",
        "C:\\\\Windows\\\\Temp\\\\*",
        "C:\\\\Windows\\\\Tasks\\\\*",
        "C:\\\\PerfLogs\\\\*",
        "C:\\\\Intel\\\\*",
        "C:\\\\Windows\\\\Debug\\\\*",
        "C:\\\\HP\\\\*",
        "*.bat",
        "*.cmd",
        "-File",
        "-PSConsoleFile",
        "C:\\\\ProgramData\\\\Microsoft\\\\AutopatchSetupScheduled\\\\SetupAutopatchClientV2Package.ps1",
        "C:\\\\ProgramData\\\\Microsoft\\\\AutopatchSetupScheduled\\\\SetupAutopatchClientPackage.ps1",
        "C:\\\\Windows\\\\Temp\\\\MSS\\\\MDESetup\\\\Invoke-MDESetup.ps1",
        "C:\\\\ProgramData\\\\ElasticAgent-HealthCheck.ps1",
        "C:\\\\ProgramData\\\\ssh\\\\puttysetup.ps1",
        "?:\\\\Windows\\\\system32\\\\calluxxprovider.vbs"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "in",
      "values": [
        "cscript.exe",
        "wscript.exe",
        "powershell.exe",
        "cmd.exe",
        "mshta.exe",
        "rundll32.exe",
        "regsvr32.exe",
        "msbuild.exe",
        "installutil.exe",
        "regasm.exe",
        "regsvcs.exe",
        "msxsl.exe",
        "control.exe",
        "explorer.exe",
        "microsoft.workflow.compiler.exe",
        "msiexec.exe"
      ],
      "raw_values": [
        "cscript.exe",
        "wscript.exe",
        "PowerShell.EXE",
        "Cmd.Exe",
        "MSHTA.EXE",
        "RUNDLL32.EXE",
        "REGSVR32.EXE",
        "MSBuild.exe",
        "InstallUtil.exe",
        "RegAsm.exe",
        "RegSvcs.exe",
        "msxsl.exe",
        "CONTROL.EXE",
        "EXPLORER.EXE",
        "Microsoft.Workflow.Compiler.exe",
        "msiexec.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "svchost.exe"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": ":",
      "values": [
        "schedule"
      ],
      "raw_values": [
        "Schedule"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "powershell.exe",
        "msiexec.exe"
      ],
      "raw_values": [
        "cmd.exe",
        "cscript.exe",
        "powershell.exe",
        "msiexec.exe"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": ":",
      "values": [
        "s-1-5-18"
      ],
      "raw_values": [
        "S-1-5-18"
      ]
    }
  ]
}