{
  "source": "elastic",
  "name": "Linux Group Creation",
  "slug": "persistence_linux_group_creation",
  "category": "iam",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/persistence_linux_group_creation.toml",
  "raw_query": "iam where host.os.type == \"linux\" and event.type == \"group\" and event.type == \"creation\" and event.outcome == \"success\"\n",
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "group",
        "creation"
      ],
      "raw_values": [
        "group",
        "creation"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "success"
      ],
      "raw_values": [
        "success"
      ]
    }
  ]
}