{
  "source": "elastic",
  "name": "Uncommon Destination Port Connection by Web Server",
  "slug": "persistence_web_server_sus_destination_port",
  "category": "network",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Tactic: Execution",
    "Tactic: Command and Control",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/persistence_web_server_sus_destination_port.toml",
  "raw_query": "network where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"connection_attempted\" and (\n  process.name like (\n    \"apache\", \"nginx\", \"apache2\", \"httpd\", \"lighttpd\", \"caddy\", \"mongrel_rails\", \"gunicorn\",\n    \"uwsgi\", \"openresty\", \"cherokee\", \"h2o\", \"resin\", \"puma\", \"unicorn\", \"traefik\", \"tornado\", \"hypercorn\",\n    \"daphne\", \"twistd\", \"yaws\", \"webfsd\", \"httpd.worker\", \"flask\", \"rails\", \"mongrel\", \"php-fpm*\", \"php-cgi\",\n    \"php-fcgi\", \"php-cgi.cagefs\", \"catalina.sh\", \"hiawatha\", \"lswsctrl\"\n  ) or\n  user.name in (\"apache\", \"www-data\", \"httpd\", \"nginx\", \"lighttpd\", \"tomcat\", \"tomcat8\", \"tomcat9\") or\n  user.id in (\"33\", \"498\", \"48\") or\n  (process.name == \"java\" and process.working_directory like \"/u0?/*\")\n) and\nnetwork.direction == \"egress\" and destination.ip != null and\nnot destination.port in (80, 443, 8080, 8443, 8000, 8888, 3128, 3306, 5432, 8220, 8082) and\nnot cidrmatch(destination.ip, \"127.0.0.0/8\", \"::1\",\"FE80::/10\", \"FF00::/8\", \"10.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\", \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\",\n\"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\",\n\"224.0.0.0/4\", \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"224.0.0.0/4\", \"240.0.0.0/4\")\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "apache",
        "nginx",
        "apache2",
        "httpd",
        "lighttpd",
        "caddy",
        "mongrel_rails",
        "gunicorn",
        "uwsgi",
        "openresty",
        "cherokee",
        "h2o",
        "resin",
        "puma",
        "unicorn",
        "traefik",
        "tornado",
        "hypercorn",
        "daphne",
        "twistd",
        "yaws",
        "webfsd",
        "httpd.worker",
        "flask",
        "rails",
        "mongrel",
        "php-fpm",
        "php-cgi",
        "php-fcgi",
        "php-cgi.cagefs",
        "catalina.sh",
        "hiawatha",
        "lswsctrl"
      ],
      "raw_values": [
        "apache",
        "nginx",
        "apache2",
        "httpd",
        "lighttpd",
        "caddy",
        "mongrel_rails",
        "gunicorn",
        "uwsgi",
        "openresty",
        "cherokee",
        "h2o",
        "resin",
        "puma",
        "unicorn",
        "traefik",
        "tornado",
        "hypercorn",
        "daphne",
        "twistd",
        "yaws",
        "webfsd",
        "httpd.worker",
        "flask",
        "rails",
        "mongrel",
        "php-fpm*",
        "php-cgi",
        "php-fcgi",
        "php-cgi.cagefs",
        "catalina.sh",
        "hiawatha",
        "lswsctrl"
      ]
    },
    {
      "field": "user.name",
      "raw_field": "user.name",
      "operator": "in",
      "values": [
        "apache",
        "www-data",
        "httpd",
        "nginx",
        "lighttpd",
        "tomcat",
        "tomcat8",
        "tomcat9"
      ],
      "raw_values": [
        "apache",
        "www-data",
        "httpd",
        "nginx",
        "lighttpd",
        "tomcat",
        "tomcat8",
        "tomcat9"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": "in",
      "values": [
        "498"
      ],
      "raw_values": [
        "33",
        "498",
        "48"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "connection_attempted"
      ],
      "raw_values": [
        "connection_attempted"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "java"
      ],
      "raw_values": [
        "java"
      ]
    },
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": "like",
      "values": [
        "/u0?/"
      ],
      "raw_values": [
        "/u0?/*"
      ]
    },
    {
      "field": "network.direction",
      "raw_field": "network.direction",
      "operator": "==",
      "values": [
        "egress"
      ],
      "raw_values": [
        "egress"
      ]
    }
  ]
}