{
  "source": "elastic",
  "name": "Network Connections Initiated Through XDG Autostart Entry",
  "slug": "persistence_xdg_autostart_netcon",
  "category": "any",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/persistence_xdg_autostart_netcon.toml",
  "raw_query": "sequence by host.id, process.entity_id with maxspan=1s\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n     (process.parent.executable == \"/usr/bin/xfce4-session\") or\n     (process.executable == \"/bin/sh\" and process.args == \"-e\" and process.args == \"-u\" and\n      process.args == \"-c\" and process.args : \"export GIO_LAUNCHED_DESKTOP_FILE_PID=$$;*\")\n   )\n  ]\n  [network where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"connection_attempted\" and not (\n     destination.ip == null or destination.ip == \"0.0.0.0\" or cidrmatch(\n       destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\", \"192.0.0.0/29\",\n       \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\",\n       \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\",\n       \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\", \"FE80::/10\",\n       \"FF00::/8\", \"172.31.0.0/16\"\n       ) or\n       process.name in (\n         \"telegram-desktop\", \"firefox\", \"gnome-calculator\", \"remmina\", \"spotify\", \"librewolf\", \"fortitraylauncher\",\n         \"flameshot\", \"thunderbird\", \"update-manager\", \"warp-terminal\", \"obs\", \"transmission-gtk\", \"telegram\",\n         \"mintupdate-launcher\", \"firefox-bin\", \"xbrlapi\", \"gnome-software\"\n       )\n     )\n  ]\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "telegram-desktop",
        "firefox",
        "gnome-calculator",
        "remmina",
        "spotify",
        "librewolf",
        "fortitraylauncher",
        "flameshot",
        "thunderbird",
        "update-manager",
        "warp-terminal",
        "obs",
        "transmission-gtk",
        "telegram",
        "mintupdate-launcher",
        "firefox-bin",
        "xbrlapi",
        "gnome-software"
      ],
      "raw_values": [
        "telegram-desktop",
        "firefox",
        "gnome-calculator",
        "remmina",
        "spotify",
        "librewolf",
        "fortitraylauncher",
        "flameshot",
        "thunderbird",
        "update-manager",
        "warp-terminal",
        "obs",
        "transmission-gtk",
        "telegram",
        "mintupdate-launcher",
        "firefox-bin",
        "xbrlapi",
        "gnome-software"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec",
        "connection_attempted"
      ],
      "raw_values": [
        "exec",
        "connection_attempted"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "==",
      "values": [
        "xfce4-session"
      ],
      "raw_values": [
        "/usr/bin/xfce4-session"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "export gio_launched_desktop_file_pid=$$;"
      ],
      "raw_values": [
        "export GIO_LAUNCHED_DESKTOP_FILE_PID=$$;*"
      ]
    },
    {
      "field": "destination.ip",
      "raw_field": "destination.ip",
      "operator": "==",
      "values": [
        "0.0.0.0"
      ],
      "raw_values": [
        "0.0.0.0"
      ]
    }
  ]
}