{
  "source": "elastic",
  "name": "Dynamic Linker Copy",
  "slug": "persistence_dynamic_linker_backup",
  "category": "any",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Threat: Orbit",
    "Data Source: Elastic Defend",
    "Data Source: SentinelOne",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/persistence_dynamic_linker_backup.toml",
  "raw_query": "sequence by process.entity_id with maxspan=1m\n  [process where host.os.type == \"linux\" and event.type == \"start\" and process.name in (\"cp\", \"rsync\", \"mv\") and\n  process.args in (\n   \"/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2\", \"/etc/ld.so.preload\", \"/lib64/ld-linux-x86-64.so.2\",\n   \"/usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2\", \"/usr/lib64/ld-linux-x86-64.so.2\"\n  ) and\n  not process.args like (\"/var/tmp/mkinitramfs*\", \"/var/tmp/dracut*\", \"/tmp/mkinitcpio*\")]\n[file where host.os.type == \"linux\" and event.action == \"creation\" and (file.extension == \"so\" or file.name like \"*.so.*\")]\n",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "mkinitramfs",
        "dracut",
        "mkinitcpio"
      ],
      "raw_values": [
        "/var/tmp/mkinitramfs*",
        "/var/tmp/dracut*",
        "/tmp/mkinitcpio*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "rsync"
      ],
      "raw_values": [
        "cp",
        "rsync",
        "mv"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "ld-linux-x86-64.so.2",
        "ld.so.preload"
      ],
      "raw_values": [
        "/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2",
        "/etc/ld.so.preload",
        "/lib64/ld-linux-x86-64.so.2",
        "/usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2",
        "/usr/lib64/ld-linux-x86-64.so.2"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "creation"
      ],
      "raw_values": [
        "creation"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": "like",
      "values": [
        ".so."
      ],
      "raw_values": [
        "*.so.*"
      ]
    }
  ]
}