{
  "source": "elastic",
  "name": "DebugFS Execution Detected via Defend for Containers",
  "slug": "privilege_escalation_debugfs_launched_inside_a_privileged_container",
  "category": "process",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Data Source: Elastic Defend for Containers",
    "Domain: Container",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/integrations/cloud_defend/privilege_escalation_debugfs_launched_inside_a_privileged_container.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n  process.name == \"debugfs\" or\n  (\n    /* account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg */\n    process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\n    process.args in (\n      \"debugfs\", \"/bin/debugfs\", \"/usr/bin/debugfs\", \"/usr/local/bin/debugfs\"\n    ) and\n    /* default exclusion list to not FP on default multi-process commands */\n    not process.args in (\n      \"which\", \"/bin/which\", \"/usr/bin/which\", \"/usr/local/bin/which\",\n      \"man\", \"/bin/man\", \"/usr/bin/man\", \"/usr/local/bin/man\",\n      \"chmod\", \"/bin/chmod\", \"/usr/bin/chmod\", \"/usr/local/bin/chmod\",\n      \"chown\", \"/bin/chown\", \"/usr/bin/chown\", \"/usr/local/bin/chown\"\n    )\n  )\n) and\nprocess.args like \"/dev/sd*\" and not process.args == \"-R\" and\ncontainer.security_context.privileged == true and process.interactive == true and container.id like \"*\"\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "debugfs",
        "which",
        "man",
        "chmod",
        "chown"
      ],
      "raw_values": [
        "debugfs",
        "/bin/debugfs",
        "/usr/bin/debugfs",
        "/usr/local/bin/debugfs",
        "which",
        "/bin/which",
        "/usr/bin/which",
        "/usr/local/bin/which",
        "man",
        "/bin/man",
        "/usr/bin/man",
        "/usr/local/bin/man",
        "chmod",
        "/bin/chmod",
        "/usr/bin/chmod",
        "/usr/local/bin/chmod",
        "chown",
        "/bin/chown",
        "/usr/bin/chown",
        "/usr/local/bin/chown"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "debugfs"
      ],
      "raw_values": [
        "debugfs"
      ]
    }
  ]
}