{
  "source": "elastic",
  "name": "Potential Privilege Escalation via Service ImagePath Modification",
  "slug": "privilege_escalation_reg_service_imagepath_mod",
  "category": "registry",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Execution",
    "Tactic: Privilege Escalation",
    "Data Source: Elastic Defend",
    "Data Source: Sysmon",
    "Data Source: Crowdstrike",
    "Resources: Investigation Guide",
    "Data Source: SentinelOne",
    "Data Source: Microsoft Defender for Endpoint",
    "Data Source: Elastic Endgame"
  ],
  "elastic_path": "rules/windows/privilege_escalation_reg_service_imagepath_mod.toml",
  "raw_query": "registry where host.os.type == \"windows\" and event.type == \"change\" and process.executable != null and\n  registry.data.strings != null and registry.value == \"ImagePath\" and\n  registry.key : (\n    \"*\\\\ADWS\", \"*\\\\AppHostSvc\", \"*\\\\AppReadiness\", \"*\\\\AudioEndpointBuilder\", \"*\\\\AxInstSV\", \"*\\\\camsvc\", \"*\\\\CertSvc\",\n    \"*\\\\COMSysApp\", \"*\\\\CscService\", \"*\\\\defragsvc\", \"*\\\\DeviceAssociationService\", \"*\\\\DeviceInstall\", \"*\\\\DevQueryBroker\",\n    \"*\\\\Dfs\", \"*\\\\DFSR\", \"*\\\\diagnosticshub.standardcollector.service\", \"*\\\\DiagTrack\", \"*\\\\DmEnrollmentSvc\", \"*\\\\DNS\",\n    \"*\\\\dot3svc\", \"*\\\\Eaphost\", \"*\\\\GraphicsPerfSvc\", \"*\\\\hidserv\", \"*\\\\HvHost\", \"*\\\\IISADMIN\", \"*\\\\IKEEXT\",\n    \"*\\\\InstallService\", \"*\\\\iphlpsvc\", \"*\\\\IsmServ\", \"*\\\\LanmanServer\", \"*\\\\MSiSCSI\", \"*\\\\NcbService\", \"*\\\\Netlogon\",\n    \"*\\\\Netman\", \"*\\\\NtFrs\", \"*\\\\PlugPlay\", \"*\\\\Power\", \"*\\\\PrintNotify\", \"*\\\\ProfSvc\", \"*\\\\PushToInstall\", \"*\\\\RSoPProv\",\n    \"*\\\\sacsvr\", \"*\\\\SENS\", \"*\\\\SensorDataService\", \"*\\\\SgrmBroker\", \"*\\\\ShellHWDetection\", \"*\\\\shpamsvc\", \"*\\\\StorSvc\",\n    \"*\\\\svsvc\", \"*\\\\swprv\", \"*\\\\SysMain\", \"*\\\\Themes\", \"*\\\\TieringEngineService\", \"*\\\\TokenBroker\", \"*\\\\TrkWks\",\n    \"*\\\\UALSVC\", \"*\\\\UserManager\", \"*\\\\vm3dservice\", \"*\\\\vmicguestinterface\", \"*\\\\vmicheartbeat\", \"*\\\\vmickvpexchange\",\n    \"*\\\\vmicrdv\", \"*\\\\vmicshutdown\", \"*\\\\vmicvmsession\", \"*\\\\vmicvss\", \"*\\\\vmvss\", \"*\\\\VSS\", \"*\\\\w3logsvc\", \"*\\\\W3SVC\",\n    \"*\\\\WalletService\", \"*\\\\WAS\", \"*\\\\wercplsupport\", \"*\\\\WerSvc\", \"*\\\\Winmgmt\", \"*\\\\wisvc\", \"*\\\\wmiApSrv\",\n    \"*\\\\WPDBusEnum\", \"*\\\\WSearch\"\n  ) and\n  not (\n    registry.data.strings : (\n        \"?:\\\\Windows\\\\system32\\\\*.exe\",\n        \"%systemroot%\\\\system32\\\\*.exe\",\n        \"%windir%\\\\system32\\\\*.exe\",\n        \"%SystemRoot%\\\\system32\\\\svchost.exe -k *\",\n        \"%windir%\\\\system32\\\\svchost.exe -k *\"\n    ) and\n        not registry.data.strings : (\n            \"*\\\\cmd.exe\",\n            \"*\\\\cscript.exe\",\n            \"*\\\\ieexec.exe\",\n            \"*\\\\iexpress.exe\",\n            \"*\\\\installutil.exe\",\n            \"*\\\\Microsoft.Workflow.Compiler.exe\",\n            \"*\\\\msbuild.exe\",\n            \"*\\\\mshta.exe\",\n            \"*\\\\msiexec.exe\",\n            \"*\\\\msxsl.exe\",\n            \"*\\\\net.exe\",\n            \"*\\\\powershell.exe\",\n            \"*\\\\pwsh.exe\",\n            \"*\\\\reg.exe\",\n            \"*\\\\RegAsm.exe\",\n            \"*\\\\RegSvcs.exe\",\n            \"*\\\\regsvr32.exe\",\n            \"*\\\\rundll32.exe\",\n            \"*\\\\vssadmin.exe\",\n            \"*\\\\wbadmin.exe\",\n            \"*\\\\wmic.exe\",\n            \"*\\\\wscript.exe\"\n        )\n  )\n",
  "conditions": [
    {
      "field": "registry.key",
      "raw_field": "registry.key",
      "operator": ":",
      "values": [
        "\\\\adws",
        "\\\\apphostsvc",
        "\\\\appreadiness",
        "\\\\audioendpointbuilder",
        "\\\\axinstsv",
        "\\\\camsvc",
        "\\\\certsvc",
        "\\\\comsysapp",
        "\\\\cscservice",
        "\\\\defragsvc",
        "\\\\deviceassociationservice",
        "\\\\deviceinstall",
        "\\\\devquerybroker",
        "\\\\dfs",
        "\\\\dfsr",
        "\\\\diagnosticshub.standardcollector.service",
        "\\\\diagtrack",
        "\\\\dmenrollmentsvc",
        "\\\\dns",
        "\\\\dot3svc",
        "\\\\eaphost",
        "\\\\graphicsperfsvc",
        "\\\\hidserv",
        "\\\\hvhost",
        "\\\\iisadmin",
        "\\\\ikeext",
        "\\\\installservice",
        "\\\\iphlpsvc",
        "\\\\ismserv",
        "\\\\lanmanserver",
        "\\\\msiscsi",
        "\\\\ncbservice",
        "\\\\netlogon",
        "\\\\netman",
        "\\\\ntfrs",
        "\\\\plugplay",
        "\\\\power",
        "\\\\printnotify",
        "\\\\profsvc",
        "\\\\pushtoinstall",
        "\\\\rsopprov",
        "\\\\sacsvr",
        "\\\\sens",
        "\\\\sensordataservice",
        "\\\\sgrmbroker",
        "\\\\shellhwdetection",
        "\\\\shpamsvc",
        "\\\\storsvc",
        "\\\\svsvc",
        "\\\\swprv",
        "\\\\sysmain",
        "\\\\themes",
        "\\\\tieringengineservice",
        "\\\\tokenbroker",
        "\\\\trkwks",
        "\\\\ualsvc",
        "\\\\usermanager",
        "\\\\vm3dservice",
        "\\\\vmicguestinterface",
        "\\\\vmicheartbeat",
        "\\\\vmickvpexchange",
        "\\\\vmicrdv",
        "\\\\vmicshutdown",
        "\\\\vmicvmsession",
        "\\\\vmicvss",
        "\\\\vmvss",
        "\\\\vss",
        "\\\\w3logsvc",
        "\\\\w3svc",
        "\\\\walletservice",
        "\\\\was",
        "\\\\wercplsupport",
        "\\\\wersvc",
        "\\\\winmgmt",
        "\\\\wisvc",
        "\\\\wmiapsrv",
        "\\\\wpdbusenum",
        "\\\\wsearch"
      ],
      "raw_values": [
        "*\\\\ADWS",
        "*\\\\AppHostSvc",
        "*\\\\AppReadiness",
        "*\\\\AudioEndpointBuilder",
        "*\\\\AxInstSV",
        "*\\\\camsvc",
        "*\\\\CertSvc",
        "*\\\\COMSysApp",
        "*\\\\CscService",
        "*\\\\defragsvc",
        "*\\\\DeviceAssociationService",
        "*\\\\DeviceInstall",
        "*\\\\DevQueryBroker",
        "*\\\\Dfs",
        "*\\\\DFSR",
        "*\\\\diagnosticshub.standardcollector.service",
        "*\\\\DiagTrack",
        "*\\\\DmEnrollmentSvc",
        "*\\\\DNS",
        "*\\\\dot3svc",
        "*\\\\Eaphost",
        "*\\\\GraphicsPerfSvc",
        "*\\\\hidserv",
        "*\\\\HvHost",
        "*\\\\IISADMIN",
        "*\\\\IKEEXT",
        "*\\\\InstallService",
        "*\\\\iphlpsvc",
        "*\\\\IsmServ",
        "*\\\\LanmanServer",
        "*\\\\MSiSCSI",
        "*\\\\NcbService",
        "*\\\\Netlogon",
        "*\\\\Netman",
        "*\\\\NtFrs",
        "*\\\\PlugPlay",
        "*\\\\Power",
        "*\\\\PrintNotify",
        "*\\\\ProfSvc",
        "*\\\\PushToInstall",
        "*\\\\RSoPProv",
        "*\\\\sacsvr",
        "*\\\\SENS",
        "*\\\\SensorDataService",
        "*\\\\SgrmBroker",
        "*\\\\ShellHWDetection",
        "*\\\\shpamsvc",
        "*\\\\StorSvc",
        "*\\\\svsvc",
        "*\\\\swprv",
        "*\\\\SysMain",
        "*\\\\Themes",
        "*\\\\TieringEngineService",
        "*\\\\TokenBroker",
        "*\\\\TrkWks",
        "*\\\\UALSVC",
        "*\\\\UserManager",
        "*\\\\vm3dservice",
        "*\\\\vmicguestinterface",
        "*\\\\vmicheartbeat",
        "*\\\\vmickvpexchange",
        "*\\\\vmicrdv",
        "*\\\\vmicshutdown",
        "*\\\\vmicvmsession",
        "*\\\\vmicvss",
        "*\\\\vmvss",
        "*\\\\VSS",
        "*\\\\w3logsvc",
        "*\\\\W3SVC",
        "*\\\\WalletService",
        "*\\\\WAS",
        "*\\\\wercplsupport",
        "*\\\\WerSvc",
        "*\\\\Winmgmt",
        "*\\\\wisvc",
        "*\\\\wmiApSrv",
        "*\\\\WPDBusEnum",
        "*\\\\WSearch"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "registry.data.strings",
      "operator": ":",
      "values": [
        ":\\\\windows\\\\system32\\\\*.exe",
        "%systemroot%\\\\system32\\\\*.exe",
        "%windir%\\\\system32\\\\*.exe",
        "%systemroot%\\\\system32\\\\svchost.exe -k",
        "%windir%\\\\system32\\\\svchost.exe -k",
        "\\\\cmd.exe",
        "\\\\cscript.exe",
        "\\\\ieexec.exe",
        "\\\\iexpress.exe",
        "\\\\installutil.exe",
        "\\\\microsoft.workflow.compiler.exe",
        "\\\\msbuild.exe",
        "\\\\mshta.exe",
        "\\\\msiexec.exe",
        "\\\\msxsl.exe",
        "\\\\net.exe",
        "\\\\powershell.exe",
        "\\\\pwsh.exe",
        "\\\\reg.exe",
        "\\\\regasm.exe",
        "\\\\regsvcs.exe",
        "\\\\regsvr32.exe",
        "\\\\rundll32.exe",
        "\\\\vssadmin.exe",
        "\\\\wbadmin.exe",
        "\\\\wmic.exe",
        "\\\\wscript.exe"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\system32\\\\*.exe",
        "%systemroot%\\\\system32\\\\*.exe",
        "%windir%\\\\system32\\\\*.exe",
        "%SystemRoot%\\\\system32\\\\svchost.exe -k *",
        "%windir%\\\\system32\\\\svchost.exe -k *",
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\ieexec.exe",
        "*\\\\iexpress.exe",
        "*\\\\installutil.exe",
        "*\\\\Microsoft.Workflow.Compiler.exe",
        "*\\\\msbuild.exe",
        "*\\\\mshta.exe",
        "*\\\\msiexec.exe",
        "*\\\\msxsl.exe",
        "*\\\\net.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\reg.exe",
        "*\\\\RegAsm.exe",
        "*\\\\RegSvcs.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\vssadmin.exe",
        "*\\\\wbadmin.exe",
        "*\\\\wmic.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change"
      ],
      "raw_values": [
        "change"
      ]
    },
    {
      "field": "registry.value",
      "raw_field": "registry.value",
      "operator": "==",
      "values": [
        "imagepath"
      ],
      "raw_values": [
        "ImagePath"
      ]
    }
  ]
}