{
  "source": "elastic",
  "name": "Unusual Print Spooler Child Process",
  "slug": "privilege_escalation_unusual_printspooler_childprocess",
  "category": "process",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Use Case: Vulnerability",
    "Data Source: Elastic Defend",
    "Data Source: Windows Security Event Logs",
    "Resources: Investigation Guide",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne",
    "Data Source: Microsoft Defender for Endpoint",
    "Data Source: Elastic Endgame",
    "Data Source: Sysmon"
  ],
  "elastic_path": "rules/windows/privilege_escalation_unusual_printspooler_childprocess.toml",
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n process.parent.name : \"spoolsv.exe\" and process.command_line != null and\n (?process.Ext.token.integrity_level_name : \"System\" or ?winlog.event_data.IntegrityLevel : \"System\") and\n\n /* exclusions for FP control below */\n not process.name : (\"splwow64.exe\", \"PDFCreator.exe\", \"acrodist.exe\", \"spoolsv.exe\", \"msiexec.exe\", \"route.exe\", \"WerFault.exe\") and\n not process.command_line : \"*\\\\WINDOWS\\\\system32\\\\spool\\\\DRIVERS*\" and\n not (process.name : \"net.exe\" and process.command_line : (\"*stop*\", \"*start*\")) and\n not (process.name : (\"cmd.exe\", \"powershell.exe\") and process.command_line : (\"*.spl*\", \"*\\\\program files*\", \"*route add*\")) and\n not (process.name : \"netsh.exe\" and process.command_line : (\"*add portopening*\", \"*rule name*\")) and\n not (process.name : \"regsvr32.exe\" and process.command_line : \"*PrintConfig.dll*\") and\n not process.executable : (\n    \"?:\\\\Program Files (x86)\\\\CutePDF Writer\\\\CPWriter2.exe\",\n    \"?:\\\\Program Files (x86)\\\\GPLGS\\\\gswin32c.exe\",\n    \"?:\\\\Program Files (x86)\\\\Acro Software\\\\CutePDF Writer\\\\CPWSave.exe\",\n    \"?:\\\\Program Files (x86)\\\\Acro Software\\\\CutePDF Writer\\\\CPWriter2.exe\",\n    \"?:\\\\Program Files (x86)\\\\CutePDF Writer\\\\CPWSave.exe\",\n    \"?:\\\\Program Files (x86)\\\\TSplus\\\\UniversalPrinter\\\\CPWriter2.exe\",\n    \"?:\\\\Program Files\\\\Seagull\\\\Printer Drivers\\\\Packages\\\\*\\\\DriverEnvironmentSetup.exe\",\n    \"?:\\\\Windows\\\\system32\\\\CNAB4RPD.EXE\",\n\n    /* Crowdstrike specific condition as it uses NT Object paths */\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\CutePDF Writer\\\\CPWriter2.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\GPLGS\\\\gswin32c.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\Acro Software\\\\CutePDF Writer\\\\CPWSave.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\Acro Software\\\\CutePDF Writer\\\\CPWriter2.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\CutePDF Writer\\\\CPWSave.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\TSplus\\\\UniversalPrinter\\\\CPWriter2.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Program Files\\\\Seagull\\\\Printer Drivers\\\\Packages\\\\*\\\\DriverEnvironmentSetup.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\system32\\\\CNAB4RPD.EXE\"\n )\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "splwow64.exe",
        "pdfcreator.exe",
        "acrodist.exe",
        "spoolsv.exe",
        "msiexec.exe",
        "route.exe",
        "werfault.exe",
        "cmd.exe",
        "powershell.exe",
        "net.exe",
        "netsh.exe",
        "regsvr32.exe"
      ],
      "raw_values": [
        "splwow64.exe",
        "PDFCreator.exe",
        "acrodist.exe",
        "spoolsv.exe",
        "msiexec.exe",
        "route.exe",
        "WerFault.exe",
        "cmd.exe",
        "powershell.exe",
        "net.exe",
        "netsh.exe",
        "regsvr32.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "stop",
        "start",
        ".spl",
        "program files",
        "route add",
        "add portopening",
        "rule name",
        "drivers",
        "printconfig.dll"
      ],
      "raw_values": [
        "*stop*",
        "*start*",
        "*.spl*",
        "*\\\\program files*",
        "*route add*",
        "*add portopening*",
        "*rule name*",
        "*\\\\WINDOWS\\\\system32\\\\spool\\\\DRIVERS*",
        "*PrintConfig.dll*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "spoolsv.exe"
      ],
      "raw_values": [
        "spoolsv.exe"
      ]
    },
    {
      "field": "process.ext.token.integrity_level_name",
      "raw_field": "process.Ext.token.integrity_level_name",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.event_data.integritylevel",
      "raw_field": "winlog.event_data.IntegrityLevel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    }
  ]
}