any where winlog.channel:"Security" and ((event.code:"4738" and (not ((winlog.event_data.AllowedToDelegateTo like~ ("", "-")) or (?winlog.event_data.AllowedToDelegateTo == null)))) or ((event.code:"5136" and winlog.event_data.AttributeLDAPDisplayName:"msDS-AllowedToDelegateTo") or (event.code:"5136" and winlog.event_data.ObjectClass:"user" and winlog.event_data.AttributeLDAPDisplayName:"servicePrincipalName") or (event.code:"5136" and winlog.event_data.AttributeLDAPDisplayName:"msDS-AllowedToActOnBehalfOfOtherIdentity")))