any where winlog.channel:"Security" and ((event.code:"4673" and winlog.event_data.PrivilegeList:"SeLoadDriverPrivilege" and winlog.event_data.Service:"-") and (not ((process.executable like~ ("C:\\Windows\\explorer.exe", "C:\\Windows\\HelpPane.exe", "C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exe", "C:\\Windows\\System32\\Dism.exe", "C:\\Windows\\System32\\fltMC.exe", "C:\\Windows\\System32\\mmc.exe", "C:\\Windows\\System32\\rundll32.exe", "C:\\Windows\\System32\\RuntimeBroker.exe", "C:\\Windows\\System32\\ShellHost.exe", "C:\\Windows\\System32\\svchost.exe", "C:\\Windows\\System32\\SystemSettingsBroker.exe", "C:\\Windows\\System32\\wimserv.exe")) or process.executable:"C:\\Program Files\\WindowsApps\\Microsoft*")) and (not ((process.executable like~ ("*\\AppData\\Local\\Microsoft\\Teams\\current\\Teams.exe", "*\\Google\\Chrome\\Application\\chrome.exe", "*\\procexp.exe", "*\\procexp64.exe", "*\\procmon.exe", "*\\procmon64.exe")) or ((process.executable like~ ("C:\\Program Files (x86)\\Dropbox\\*", "C:\\Program Files\\Dropbox\\*")) and process.executable:"*\\Dropbox.exe"))))