{
  "source": "sigma",
  "name": "create_remote_thread_win_powershell_lsass",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/create_remote_thread/create_remote_thread_win_powershell_lsass.eql",
  "raw_query": "any where (process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and winlog.event_data.TargetImage:\"*\\\\lsass.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": ":",
      "values": [
        "\\\\lsass.exe"
      ],
      "raw_values": [
        "*\\\\lsass.exe"
      ]
    }
  ]
}