{
  "source": "sigma",
  "name": "file_event_win_dcom_iertutil_dll_hijack",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_dcom_iertutil_dll_hijack.eql",
  "raw_query": "any where process.executable:\"System\" and file.path:\"*\\\\Internet Explorer\\\\iertutil.dll\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "iertutil.dll"
      ],
      "raw_values": [
        "*\\\\Internet Explorer\\\\iertutil.dll"
      ]
    }
  ]
}