{
  "source": "sigma",
  "name": "file_event_win_vscode_tunnel_remote_creation_artefacts",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_vscode_tunnel_remote_creation_artefacts.eql",
  "raw_query": "any where process.executable:\"*\\\\servers\\\\Stable-*\" and process.executable:\"*\\\\server\\\\node.exe\" and file.path:\"*\\\\.vscode-server\\\\data\\\\User\\\\History\\\\*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "stable-",
        "node.exe"
      ],
      "raw_values": [
        "*\\\\servers\\\\Stable-*",
        "*\\\\server\\\\node.exe"
      ]
    }
  ]
}