{
  "source": "sigma",
  "name": "file_event_win_susp_exchange_aspx_write",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_susp_exchange_aspx_write.eql",
  "raw_query": "any where process.executable:\"*\\\\MSExchangeMailboxReplication.exe\" and (file.path like~ (\"*.aspx\", \"*.asp\"))",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".aspx",
        ".asp"
      ],
      "raw_values": [
        "*.aspx",
        "*.asp"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msexchangemailboxreplication.exe"
      ],
      "raw_values": [
        "*\\\\MSExchangeMailboxReplication.exe"
      ]
    }
  ]
}