{
  "source": "sigma",
  "name": "file_event_win_aspnet_temp_files",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_aspnet_temp_files.eql",
  "raw_query": "any where process.executable:\"*\\\\aspnet_compiler.exe\" and (file.path:\"*\\\\Temporary ASP.NET Files\\\\*\" and file.path:\"*\\\\assembly\\\\tmp\\\\*\" and file.path:\"*.dll*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "aspnet_compiler.exe"
      ],
      "raw_values": [
        "*\\\\aspnet_compiler.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".dll"
      ],
      "raw_values": [
        "*\\\\Temporary ASP.NET Files\\\\*",
        "*\\\\assembly\\\\tmp\\\\*",
        "*.dll*"
      ]
    }
  ]
}