{
  "source": "sigma",
  "name": "file_event_win_ntds_dit_uncommon_process",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_ntds_dit_uncommon_process.eql",
  "raw_query": "any where file.path:\"*\\\\ntds.dit\" and ((process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regsvr32.exe\", \"*\\\\rundll32.exe\", \"*\\\\wscript.exe\", \"*\\\\wsl.exe\", \"*\\\\wt.exe\")) or (process.executable like~ (\"*\\\\AppData\\\\*\", \"*\\\\Temp\\\\*\", \"*\\\\Public\\\\*\", \"*\\\\PerfLogs\\\\*\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "wscript.exe",
        "wsl.exe",
        "wt.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\wscript.exe",
        "*\\\\wsl.exe",
        "*\\\\wt.exe",
        "*\\\\AppData\\\\*",
        "*\\\\Temp\\\\*",
        "*\\\\Public\\\\*",
        "*\\\\PerfLogs\\\\*"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "ntds.dit"
      ],
      "raw_values": [
        "*\\\\ntds.dit"
      ]
    }
  ]
}