{
  "source": "sigma",
  "name": "file_event_win_uac_bypass_ieinstal",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_uac_bypass_ieinstal.eql",
  "raw_query": "any where process.executable:\"C:\\\\Program Files\\\\Internet Explorer\\\\IEInstal.exe\" and file.path:\"C:\\\\Users\\\\*\" and file.path:\"*\\\\AppData\\\\Local\\\\Temp\\\\*\" and file.path:\"*consent.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "ieinstal.exe"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Internet Explorer\\\\IEInstal.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "consent.exe"
      ],
      "raw_values": [
        "C:\\\\Users\\\\*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*consent.exe"
      ]
    }
  ]
}