{
  "source": "sigma",
  "name": "file_event_win_lsass_werfault_dump",
  "subtree": "rules",
  "category": "file",
  "sigma_path": "rules/windows/file/file_event/file_event_win_lsass_werfault_dump.eql",
  "raw_query": "any where process.executable:\"C:\\\\WINDOWS\\\\system32\\\\WerFault.exe\" and (file.path like~ (\"*\\\\lsass*\", \"*lsass.exe*\"))",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        "lsass",
        "lsass.exe"
      ],
      "raw_values": [
        "*\\\\lsass*",
        "*lsass.exe*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "werfault.exe"
      ],
      "raw_values": [
        "C:\\\\WINDOWS\\\\system32\\\\WerFault.exe"
      ]
    }
  ]
}