{
  "source": "sigma",
  "name": "image_load_dll_sdiageng_load_by_msdt",
  "subtree": "rules",
  "category": "library",
  "sigma_path": "rules/windows/image_load/image_load_dll_sdiageng_load_by_msdt.eql",
  "raw_query": "any where process.executable:\"*\\\\msdt.exe\" and file.path:\"*\\\\sdiageng.dll\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "msdt.exe"
      ],
      "raw_values": [
        "*\\\\msdt.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "sdiageng.dll"
      ],
      "raw_values": [
        "*\\\\sdiageng.dll"
      ]
    }
  ]
}