{
  "source": "sigma",
  "name": "image_load_side_load_rjvplatform_non_default_location",
  "subtree": "rules",
  "category": "library",
  "sigma_path": "rules/windows/image_load/image_load_side_load_rjvplatform_non_default_location.eql",
  "raw_query": "any where (file.path:\"*\\\\RjvPlatform.dll\" and process.executable:\"\\\\SystemResetPlatform.exe\") and (not process.executable:\"C:\\\\Windows\\\\System32\\\\SystemResetPlatform\\\\*\")",
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "rjvplatform.dll"
      ],
      "raw_values": [
        "*\\\\RjvPlatform.dll"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "systemresetplatform.exe"
      ],
      "raw_values": [
        "\\\\SystemResetPlatform.exe",
        "C:\\\\Windows\\\\System32\\\\SystemResetPlatform\\\\*"
      ]
    }
  ]
}