{
  "source": "sigma",
  "name": "image_load_side_load_windows_defender",
  "subtree": "rules",
  "category": "library",
  "sigma_path": "rules/windows/image_load/image_load_side_load_windows_defender.eql",
  "raw_query": "any where (file.path:\"*\\\\mpclient.dll\" and (process.executable like~ (\"*\\\\MpCmdRun.exe\", \"*\\\\NisSrv.exe\"))) and (not (process.executable like~ (\"C:\\\\Program Files (x86)\\\\Windows Defender\\\\*\", \"C:\\\\Program Files\\\\Microsoft Security Client\\\\*\", \"C:\\\\Program Files\\\\Windows Defender\\\\*\", \"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\*\", \"C:\\\\Windows\\\\WinSxS\\\\*\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "mpcmdrun.exe",
        "nissrv.exe"
      ],
      "raw_values": [
        "*\\\\MpCmdRun.exe",
        "*\\\\NisSrv.exe"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "mpclient.dll"
      ],
      "raw_values": [
        "*\\\\mpclient.dll"
      ]
    }
  ]
}