{
  "source": "sigma",
  "name": "net_connection_win_powershell_network_connection",
  "subtree": "rules-threat-hunting",
  "category": "network",
  "sigma_path": "rules-threat-hunting/windows/network_connection/net_connection_win_powershell_network_connection.eql",
  "raw_query": "any where ((process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\")) and network.direction:\"true\") and (not (((cidrMatch(destination.ip, \"127.0.0.0/8\") or cidrMatch(destination.ip, \"10.0.0.0/8\") or cidrMatch(destination.ip, \"169.254.0.0/16\") or cidrMatch(destination.ip, \"172.16.0.0/12\") or cidrMatch(destination.ip, \"192.168.0.0/16\") or cidrMatch(destination.ip, \"::1/128\") or cidrMatch(destination.ip, \"fe80::/10\") or cidrMatch(destination.ip, \"fc00::/7\")) and (user.name like~ (\"*AUTHORI*\", \"*AUTORI*\"))) or (cidrMatch(destination.ip, \"20.184.0.0/13\") or cidrMatch(destination.ip, \"51.103.210.0/23\"))))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "user.name",
      "raw_field": "user.name",
      "operator": "like~",
      "values": [
        "authori",
        "autori"
      ],
      "raw_values": [
        "*AUTHORI*",
        "*AUTORI*"
      ]
    }
  ]
}