{
  "source": "sigma",
  "name": "proc_creation_win_esentutl_sensitive_file_copy",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_esentutl_sensitive_file_copy.eql",
  "raw_query": "any where ((process.executable:\"*\\\\esentutl.exe\" or process.pe.original_file_name:\"\\\\esentutl.exe\") and (process.command_line like~ (\"*vss*\") or process.command_line like~ (\"* -m *\", \"* /m *\", \"* \u2013m *\", \"* \u2014m *\", \"* \u2015m *\") or process.command_line like~ (\"* -y *\", \"* /y *\", \"* \u2013y *\", \"* \u2014y *\", \"* \u2015y *\"))) or (process.command_line like~ (\"*\\\\config\\\\RegBack\\\\sam*\", \"*\\\\config\\\\RegBack\\\\security*\", \"*\\\\config\\\\RegBack\\\\system*\", \"*\\\\config\\\\sam*\", \"*\\\\config\\\\security*\", \"*\\\\config\\\\system *\", \"*\\\\repair\\\\sam*\", \"*\\\\repair\\\\security*\", \"*\\\\repair\\\\system*\", \"*\\\\windows\\\\ntds\\\\ntds.dit*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "vss",
        "sam",
        "security",
        "system",
        "ntds.dit"
      ],
      "raw_values": [
        "*vss*",
        "* -m *",
        "* /m *",
        "* \u2013m *",
        "* \u2014m *",
        "* \u2015m *",
        "* -y *",
        "* /y *",
        "* \u2013y *",
        "* \u2014y *",
        "* \u2015y *",
        "*\\\\config\\\\RegBack\\\\sam*",
        "*\\\\config\\\\RegBack\\\\security*",
        "*\\\\config\\\\RegBack\\\\system*",
        "*\\\\config\\\\sam*",
        "*\\\\config\\\\security*",
        "*\\\\config\\\\system *",
        "*\\\\repair\\\\sam*",
        "*\\\\repair\\\\security*",
        "*\\\\repair\\\\system*",
        "*\\\\windows\\\\ntds\\\\ntds.dit*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "esentutl.exe"
      ],
      "raw_values": [
        "*\\\\esentutl.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "\\\\esentutl.exe"
      ],
      "raw_values": [
        "\\\\esentutl.exe"
      ]
    }
  ]
}