{
  "source": "sigma",
  "name": "proc_creation_win_bash_command_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_bash_command_execution.eql",
  "raw_query": "any where ((process.executable like~ (\"*:\\\\Windows\\\\System32\\\\bash.exe\", \"*:\\\\Windows\\\\SysWOW64\\\\bash.exe\")) or process.pe.original_file_name:\"Bash.exe\") and process.command_line:\"* -c *\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "bash.exe"
      ],
      "raw_values": [
        "*:\\\\Windows\\\\System32\\\\bash.exe",
        "*:\\\\Windows\\\\SysWOW64\\\\bash.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "bash.exe"
      ],
      "raw_values": [
        "Bash.exe"
      ]
    }
  ]
}