{
  "source": "sigma",
  "name": "proc_creation_win_wscript_cscript_dropper",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_wscript_cscript_dropper.eql",
  "raw_query": "any where (process.executable like~ (\"*\\\\wscript.exe\", \"*\\\\cscript.exe\")) and (process.command_line like~ (\"*:\\\\Temp\\\\*\", \"*:\\\\Tmp\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\Temp\\\\*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\*\")) and (process.command_line like~ (\"*.js*\", \"*.jse*\", \"*.vba*\", \"*.vbe*\", \"*.vbs*\", \"*.wsf*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "wscript.exe",
        "cscript.exe"
      ],
      "raw_values": [
        "*\\\\wscript.exe",
        "*\\\\cscript.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".js",
        ".jse",
        ".vba",
        ".vbe",
        ".vbs",
        ".wsf"
      ],
      "raw_values": [
        "*:\\\\Temp\\\\*",
        "*:\\\\Tmp\\\\*",
        "*:\\\\Users\\\\Public\\\\*",
        "*:\\\\Windows\\\\Temp\\\\*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*.js*",
        "*.jse*",
        "*.vba*",
        "*.vbe*",
        "*.vbs*",
        "*.wsf*"
      ]
    }
  ]
}