{
  "source": "sigma",
  "name": "proc_creation_win_ruby_inline_command_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_ruby_inline_command_execution.eql",
  "raw_query": "any where (process.executable:\"*\\\\ruby.exe\" or process.pe.original_file_name:\"ruby.exe\") and process.command_line:\"* -e*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "ruby.exe"
      ],
      "raw_values": [
        "*\\\\ruby.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "ruby.exe"
      ],
      "raw_values": [
        "ruby.exe"
      ]
    }
  ]
}