{
  "source": "sigma",
  "name": "proc_creation_win_certutil_encode",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_certutil_encode.eql",
  "raw_query": "any where (process.executable:\"*\\\\certutil.exe\" or process.pe.original_file_name:\"CertUtil.exe\") and process.command_line like~ (\"*-encode*\", \"*/encode*\", \"*\u2013encode*\", \"*\u2014encode*\", \"*\u2015encode*\")",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-encode",
        "encode",
        "\u2013encode",
        "\u2014encode",
        "\u2015encode"
      ],
      "raw_values": [
        "*-encode*",
        "*/encode*",
        "*\u2013encode*",
        "*\u2014encode*",
        "*\u2015encode*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "*\\\\certutil.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "CertUtil.exe"
      ]
    }
  ]
}