{
  "source": "sigma",
  "name": "proc_creation_win_lsass_process_clone",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lsass_process_clone.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\Windows\\\\System32\\\\lsass.exe\" and process.executable:\"*\\\\Windows\\\\System32\\\\lsass.exe\"",
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "lsass.exe"
      ],
      "raw_values": [
        "*\\\\Windows\\\\System32\\\\lsass.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "lsass.exe"
      ],
      "raw_values": [
        "*\\\\Windows\\\\System32\\\\lsass.exe"
      ]
    }
  ]
}