{
  "source": "sigma",
  "name": "proc_creation_win_schtasks_creation_temp_folder",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_schtasks_creation_temp_folder.eql",
  "raw_query": "any where process.executable:\"*\\\\schtasks.exe\" and (process.command_line:\"* /create *\" and process.command_line:\"* /sc once *\" and process.command_line:\"*\\\\Temp\\\\*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "schtasks.exe"
      ],
      "raw_values": [
        "*\\\\schtasks.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "create",
        "sc once"
      ],
      "raw_values": [
        "* /create *",
        "* /sc once *",
        "*\\\\Temp\\\\*"
      ]
    }
  ]
}