{
  "source": "sigma",
  "name": "proc_creation_win_wmic_process_creation",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_wmic_process_creation.eql",
  "raw_query": "any where (process.executable:\"*\\\\wmic.exe\" or process.pe.original_file_name:\"wmic.exe\") and (process.command_line:\"*process*\" and process.command_line:\"*call*\" and process.command_line:\"*create*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "*\\\\wmic.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "wmic.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "process",
        "call",
        "create"
      ],
      "raw_values": [
        "*process*",
        "*call*",
        "*create*"
      ]
    }
  ]
}