{
  "source": "sigma",
  "name": "proc_creation_win_cmdkey_recon",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_cmdkey_recon.eql",
  "raw_query": "any where (process.executable:\"*\\\\cmdkey.exe\" or process.pe.original_file_name:\"cmdkey.exe\") and process.command_line like~ (\"* -l*\", \"* /l*\", \"* \u2013l*\", \"* \u2014l*\", \"* \u2015l*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmdkey.exe"
      ],
      "raw_values": [
        "*\\\\cmdkey.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmdkey.exe"
      ],
      "raw_values": [
        "cmdkey.exe"
      ]
    }
  ]
}