{
  "source": "sigma",
  "name": "proc_creation_win_cmd_mklink_osk_cmd",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_cmd_mklink_osk_cmd.eql",
  "raw_query": "any where (process.executable:\"*\\\\cmd.exe\" or process.pe.original_file_name:\"Cmd.Exe\") and (process.command_line:\"*mklink*\" and process.command_line:\"*\\\\osk.exe*\" and process.command_line:\"*\\\\cmd.exe*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "Cmd.Exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "mklink",
        "osk.exe",
        "cmd.exe"
      ],
      "raw_values": [
        "*mklink*",
        "*\\\\osk.exe*",
        "*\\\\cmd.exe*"
      ]
    }
  ]
}