{
  "source": "sigma",
  "name": "proc_creation_win_fsutil_drive_enumeration",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_fsutil_drive_enumeration.eql",
  "raw_query": "any where (process.executable:\"*\\\\fsutil.exe\" or process.pe.original_file_name:\"fsutil.exe\") and process.command_line:\"*drives*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "fsutil.exe"
      ],
      "raw_values": [
        "*\\\\fsutil.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "fsutil.exe"
      ],
      "raw_values": [
        "fsutil.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "drives"
      ],
      "raw_values": [
        "*drives*"
      ]
    }
  ]
}