{
  "source": "sigma",
  "name": "proc_creation_win_wmic_recon_service",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_wmic_recon_service.eql",
  "raw_query": "any where (process.executable:\"*\\\\WMIC.exe\" or process.pe.original_file_name:\"wmic.exe\") and process.command_line:\"*service*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "*\\\\WMIC.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "wmic.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "service"
      ],
      "raw_values": [
        "*service*"
      ]
    }
  ]
}