{
  "source": "sigma",
  "name": "proc_creation_win_office_onenote_susp_child_processes",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_office_onenote_susp_child_processes.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\onenote.exe\" and (((process.pe.original_file_name like~ (\"bitsadmin.exe\", \"CertOC.exe\", \"CertUtil.exe\", \"Cmd.Exe\", \"CMSTP.EXE\", \"cscript.exe\", \"curl.exe\", \"HH.exe\", \"IEExec.exe\", \"InstallUtil.exe\", \"javaw.exe\", \"Microsoft.Workflow.Compiler.exe\", \"msdt.exe\", \"MSHTA.EXE\", \"msiexec.exe\", \"Msxsl.exe\", \"odbcconf.exe\", \"pcalua.exe\", \"PowerShell.EXE\", \"RegAsm.exe\", \"RegSvcs.exe\", \"REGSVR32.exe\", \"RUNDLL32.exe\", \"schtasks.exe\", \"ScriptRunner.exe\", \"wmic.exe\", \"WorkFolders.exe\", \"wscript.exe\")) or (process.executable like~ (\"*\\\\AppVLP.exe\", \"*\\\\bash.exe\", \"*\\\\bitsadmin.exe\", \"*\\\\certoc.exe\", \"*\\\\certutil.exe\", \"*\\\\cmd.exe\", \"*\\\\cmstp.exe\", \"*\\\\control.exe\", \"*\\\\cscript.exe\", \"*\\\\curl.exe\", \"*\\\\forfiles.exe\", \"*\\\\hh.exe\", \"*\\\\ieexec.exe\", \"*\\\\installutil.exe\", \"*\\\\javaw.exe\", \"*\\\\mftrace.exe\", \"*\\\\Microsoft.Workflow.Compiler.exe\", \"*\\\\msbuild.exe\", \"*\\\\msdt.exe\", \"*\\\\mshta.exe\", \"*\\\\msidb.exe\", \"*\\\\msiexec.exe\", \"*\\\\msxsl.exe\", \"*\\\\odbcconf.exe\", \"*\\\\pcalua.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regasm.exe\", \"*\\\\regsvcs.exe\", \"*\\\\regsvr32.exe\", \"*\\\\rundll32.exe\", \"*\\\\schtasks.exe\", \"*\\\\scrcons.exe\", \"*\\\\scriptrunner.exe\", \"*\\\\sh.exe\", \"*\\\\svchost.exe\", \"*\\\\verclsid.exe\", \"*\\\\wmic.exe\", \"*\\\\workfolders.exe\", \"*\\\\wscript.exe\"))) or (process.executable:\"*\\\\explorer.exe\" and (process.command_line like~ (\"*.hta*\", \"*.vb*\", \"*.wsh*\", \"*.js*\", \"*.ps*\", \"*.scr*\", \"*.pif*\", \"*.bat*\", \"*.cmd*\"))) or (process.executable like~ (\"*\\\\AppData\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\ProgramData\\\\*\", \"*\\\\Windows\\\\Tasks\\\\*\", \"*\\\\Windows\\\\Temp\\\\*\", \"*\\\\Windows\\\\System32\\\\Tasks\\\\*\"))) and (not ((process.executable:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and process.command_line:\"*-Embedding\") or (process.executable:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*\" and process.executable:\"*\\\\FileCoAuth.exe\" and process.command_line:\"*-Embedding\")))",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "bitsadmin.exe",
        "certoc.exe",
        "certutil.exe",
        "cmd.exe",
        "cmstp.exe",
        "cscript.exe",
        "curl.exe",
        "hh.exe",
        "ieexec.exe",
        "installutil.exe",
        "javaw.exe",
        "microsoft.workflow.compiler.exe",
        "msdt.exe",
        "mshta.exe",
        "msiexec.exe",
        "msxsl.exe",
        "odbcconf.exe",
        "pcalua.exe",
        "powershell.exe",
        "regasm.exe",
        "regsvcs.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "schtasks.exe",
        "scriptrunner.exe",
        "wmic.exe",
        "workfolders.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "bitsadmin.exe",
        "CertOC.exe",
        "CertUtil.exe",
        "Cmd.Exe",
        "CMSTP.EXE",
        "cscript.exe",
        "curl.exe",
        "HH.exe",
        "IEExec.exe",
        "InstallUtil.exe",
        "javaw.exe",
        "Microsoft.Workflow.Compiler.exe",
        "msdt.exe",
        "MSHTA.EXE",
        "msiexec.exe",
        "Msxsl.exe",
        "odbcconf.exe",
        "pcalua.exe",
        "PowerShell.EXE",
        "RegAsm.exe",
        "RegSvcs.exe",
        "REGSVR32.exe",
        "RUNDLL32.exe",
        "schtasks.exe",
        "ScriptRunner.exe",
        "wmic.exe",
        "WorkFolders.exe",
        "wscript.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "appvlp.exe",
        "bash.exe",
        "bitsadmin.exe",
        "certoc.exe",
        "certutil.exe",
        "cmd.exe",
        "cmstp.exe",
        "control.exe",
        "cscript.exe",
        "curl.exe",
        "forfiles.exe",
        "hh.exe",
        "ieexec.exe",
        "installutil.exe",
        "javaw.exe",
        "mftrace.exe",
        "microsoft.workflow.compiler.exe",
        "msbuild.exe",
        "msdt.exe",
        "mshta.exe",
        "msidb.exe",
        "msiexec.exe",
        "msxsl.exe",
        "odbcconf.exe",
        "pcalua.exe",
        "powershell.exe",
        "pwsh.exe",
        "regasm.exe",
        "regsvcs.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "schtasks.exe",
        "scrcons.exe",
        "scriptrunner.exe",
        "sh.exe",
        "svchost.exe",
        "verclsid.exe",
        "wmic.exe",
        "workfolders.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\AppVLP.exe",
        "*\\\\bash.exe",
        "*\\\\bitsadmin.exe",
        "*\\\\certoc.exe",
        "*\\\\certutil.exe",
        "*\\\\cmd.exe",
        "*\\\\cmstp.exe",
        "*\\\\control.exe",
        "*\\\\cscript.exe",
        "*\\\\curl.exe",
        "*\\\\forfiles.exe",
        "*\\\\hh.exe",
        "*\\\\ieexec.exe",
        "*\\\\installutil.exe",
        "*\\\\javaw.exe",
        "*\\\\mftrace.exe",
        "*\\\\Microsoft.Workflow.Compiler.exe",
        "*\\\\msbuild.exe",
        "*\\\\msdt.exe",
        "*\\\\mshta.exe",
        "*\\\\msidb.exe",
        "*\\\\msiexec.exe",
        "*\\\\msxsl.exe",
        "*\\\\odbcconf.exe",
        "*\\\\pcalua.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regasm.exe",
        "*\\\\regsvcs.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\schtasks.exe",
        "*\\\\scrcons.exe",
        "*\\\\scriptrunner.exe",
        "*\\\\sh.exe",
        "*\\\\svchost.exe",
        "*\\\\verclsid.exe",
        "*\\\\wmic.exe",
        "*\\\\workfolders.exe",
        "*\\\\wscript.exe",
        "*\\\\AppData\\\\*",
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\ProgramData\\\\*",
        "*\\\\Windows\\\\Tasks\\\\*",
        "*\\\\Windows\\\\Temp\\\\*",
        "*\\\\Windows\\\\System32\\\\Tasks\\\\*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".hta",
        ".vb",
        ".wsh",
        ".js",
        ".ps",
        ".scr",
        ".pif",
        ".bat",
        ".cmd"
      ],
      "raw_values": [
        "*.hta*",
        "*.vb*",
        "*.wsh*",
        "*.js*",
        "*.ps*",
        "*.scr*",
        "*.pif*",
        "*.bat*",
        "*.cmd*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "onenote.exe"
      ],
      "raw_values": [
        "*\\\\onenote.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "explorer.exe",
        "teams.exe",
        "filecoauth.exe"
      ],
      "raw_values": [
        "*\\\\explorer.exe",
        "*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe",
        "*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*",
        "*\\\\FileCoAuth.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "-embedding"
      ],
      "raw_values": [
        "*-Embedding"
      ]
    }
  ]
}