{
  "source": "sigma",
  "name": "proc_creation_win_regedit_export_keys",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_regedit_export_keys.eql",
  "raw_query": "any where ((process.executable:\"*\\\\regedit.exe\" or process.pe.original_file_name:\"REGEDIT.EXE\") and process.command_line like~ (\"* -E *\", \"* /E *\", \"* \u2013E *\", \"* \u2014E *\", \"* \u2015E *\")) and (not ((process.command_line like~ (\"*hklm*\", \"*hkey_local_machine*\")) and (process.command_line like~ (\"*\\\\system\", \"*\\\\sam\", \"*\\\\security\"))))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "hklm",
        "hkey_local_machine",
        "system",
        "sam",
        "security"
      ],
      "raw_values": [
        "* -E *",
        "* /E *",
        "* \u2013E *",
        "* \u2014E *",
        "* \u2015E *",
        "*hklm*",
        "*hkey_local_machine*",
        "*\\\\system",
        "*\\\\sam",
        "*\\\\security"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "regedit.exe"
      ],
      "raw_values": [
        "*\\\\regedit.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "regedit.exe"
      ],
      "raw_values": [
        "REGEDIT.EXE"
      ]
    }
  ]
}