{
  "source": "sigma",
  "name": "proc_creation_win_curl_execution",
  "subtree": "rules-threat-hunting",
  "category": "process",
  "sigma_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_curl_execution.eql",
  "raw_query": "any where process.executable:\"*\\\\curl.exe\" or process.pe.product:\"The curl executable\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "curl.exe"
      ],
      "raw_values": [
        "*\\\\curl.exe"
      ]
    },
    {
      "field": "process.pe.product",
      "raw_field": "process.pe.product",
      "operator": ":",
      "values": [
        "the curl executable"
      ],
      "raw_values": [
        "The curl executable"
      ]
    }
  ]
}