{
  "source": "sigma",
  "name": "proc_creation_win_susp_cli_obfuscation_unicode_img",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_susp_cli_obfuscation_unicode_img.eql",
  "raw_query": "any where ((process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\powershell.exe\", \"*\\\\powershell_ise.exe\", \"*\\\\pwsh.exe\", \"*\\\\wscript.exe\")) and (process.pe.original_file_name like~ (\"Cmd.EXE\", \"cscript.exe\", \"PowerShell.EXE\", \"PowerShell_ISE.EXE\", \"pwsh.dll\", \"wscript.exe\"))) and (process.command_line like~ (\"*\u02e3*\", \"*\u02ea*\", \"*\u02e2*\", \"*\u2215*\", \"*\u2044*\", \"*\u2015*\", \"*\u2014*\", \"*\u00a0*\", \"*\u00af*\", \"*\u00ae*\", \"*\u00b6*\", \"*\u2800*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "powershell.exe",
        "powershell_ise.exe",
        "pwsh.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\powershell.exe",
        "*\\\\powershell_ise.exe",
        "*\\\\pwsh.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "powershell.exe",
        "powershell_ise.exe",
        "pwsh.dll",
        "wscript.exe"
      ],
      "raw_values": [
        "Cmd.EXE",
        "cscript.exe",
        "PowerShell.EXE",
        "PowerShell_ISE.EXE",
        "pwsh.dll",
        "wscript.exe"
      ]
    }
  ]
}