{
  "source": "sigma",
  "name": "proc_creation_win_hktl_sharpevtmute",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_hktl_sharpevtmute.eql",
  "raw_query": "any where process.executable:\"*\\\\SharpEvtMute.exe\" or process.pe.description:\"SharpEvtMute\" or (process.command_line like~ (\"*--Filter \\\"rule *\", \"*--Encoded --Filter \\\\\\\"*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "sharpevtmute.exe"
      ],
      "raw_values": [
        "*\\\\SharpEvtMute.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "sharpevtmute"
      ],
      "raw_values": [
        "SharpEvtMute"
      ]
    }
  ]
}