{
  "source": "sigma",
  "name": "proc_creation_win_reg_susp_paths",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_reg_susp_paths.eql",
  "raw_query": "any where (process.executable:\"*\\\\reg.exe\" or process.pe.original_file_name:\"reg.exe\") and (process.command_line like~ (\"*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\*\", \"*\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE*\", \"*\\\\Policies\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon*\", \"*\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\Currentversion\\\\Winlogon*\", \"*\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest*\", \"*\\\\Microsoft\\\\Windows Defender\\\\*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "oobe",
        "winlogon",
        "wdigest"
      ],
      "raw_values": [
        "*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\*",
        "*\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE*",
        "*\\\\Policies\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon*",
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\Currentversion\\\\Winlogon*",
        "*\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest*",
        "*\\\\Microsoft\\\\Windows Defender\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "reg.exe"
      ]
    }
  ]
}