{
  "source": "sigma",
  "name": "proc_creation_win_csvde_export",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_csvde_export.eql",
  "raw_query": "any where ((process.executable:\"*\\\\csvde.exe\" or process.pe.original_file_name:\"csvde.exe\") and process.command_line:\"* -f*\") and (not process.command_line:\"* -i*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "csvde.exe"
      ],
      "raw_values": [
        "*\\\\csvde.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "csvde.exe"
      ],
      "raw_values": [
        "csvde.exe"
      ]
    }
  ]
}