{
  "source": "sigma",
  "name": "proc_creation_win_browsers_remote_debugging",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_browsers_remote_debugging.eql",
  "raw_query": "any where process.command_line:\"* --remote-debugging-*\" or (process.executable:\"*\\\\firefox.exe\" and process.command_line:\"* -start-debugger-server*\")",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "--remote-debugging-",
        "-start-debugger-server"
      ],
      "raw_values": [
        "* --remote-debugging-*",
        "* -start-debugger-server*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "firefox.exe"
      ],
      "raw_values": [
        "*\\\\firefox.exe"
      ]
    }
  ]
}