{
  "source": "sigma",
  "name": "proc_creation_win_extexport_execution",
  "subtree": "rules-threat-hunting",
  "category": "process",
  "sigma_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_extexport_execution.eql",
  "raw_query": "any where process.executable:\"*\\\\Extexport.exe\" or process.pe.original_file_name:\"extexport.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "extexport.exe"
      ],
      "raw_values": [
        "*\\\\Extexport.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "extexport.exe"
      ],
      "raw_values": [
        "extexport.exe"
      ]
    }
  ]
}