{
  "source": "sigma",
  "name": "proc_creation_win_mshta_susp_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_mshta_susp_execution.eql",
  "raw_query": "any where (process.executable:\"*\\\\mshta.exe\" or process.pe.original_file_name:\"mshta.exe\") and (process.command_line like~ (\"*.7z*\", \"*.avi*\", \"*.bat*\", \"*.bmp*\", \"*.conf*\", \"*.csv*\", \"*.dll*\", \"*.doc*\", \"*.gif*\", \"*.gz*\", \"*.ini*\", \"*.jpe*\", \"*.jpg*\", \"*.json*\", \"*.lnk*\", \"*.log*\", \"*.mkv*\", \"*.mp3*\", \"*.mp4*\", \"*.pdf*\", \"*.png*\", \"*.ppt*\", \"*.rar*\", \"*.rtf*\", \"*.svg*\", \"*.tar*\", \"*.tmp*\", \"*.txt*\", \"*.xls*\", \"*.xml*\", \"*.yaml*\", \"*.yml*\", \"*.zip*\", \"*vbscript*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".7z",
        ".avi",
        ".bat",
        ".bmp",
        ".conf",
        ".csv",
        ".dll",
        ".doc",
        ".gif",
        ".gz",
        ".ini",
        ".jpe",
        ".jpg",
        ".json",
        ".lnk",
        ".log",
        ".mkv",
        ".mp3",
        ".mp4",
        ".pdf",
        ".png",
        ".ppt",
        ".rar",
        ".rtf",
        ".svg",
        ".tar",
        ".tmp",
        ".txt",
        ".xls",
        ".xml",
        ".yaml",
        ".yml",
        ".zip",
        "vbscript"
      ],
      "raw_values": [
        "*.7z*",
        "*.avi*",
        "*.bat*",
        "*.bmp*",
        "*.conf*",
        "*.csv*",
        "*.dll*",
        "*.doc*",
        "*.gif*",
        "*.gz*",
        "*.ini*",
        "*.jpe*",
        "*.jpg*",
        "*.json*",
        "*.lnk*",
        "*.log*",
        "*.mkv*",
        "*.mp3*",
        "*.mp4*",
        "*.pdf*",
        "*.png*",
        "*.ppt*",
        "*.rar*",
        "*.rtf*",
        "*.svg*",
        "*.tar*",
        "*.tmp*",
        "*.txt*",
        "*.xls*",
        "*.xml*",
        "*.yaml*",
        "*.yml*",
        "*.zip*",
        "*vbscript*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "*\\\\mshta.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "mshta.exe"
      ],
      "raw_values": [
        "mshta.exe"
      ]
    }
  ]
}