{
  "source": "sigma",
  "name": "proc_creation_win_findstr_password_recon",
  "subtree": "rules-threat-hunting",
  "category": "process",
  "sigma_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_findstr_password_recon.eql",
  "raw_query": "any where (process.executable:\"*\\\\findstr.exe\" or process.pe.original_file_name:\"FINDSTR.EXE\") and (process.command_line like~ (\"*contrase\u00f1a*\", \"*has\u0142o*\", \"*heslo*\", \"*parola*\", \"*passe*\", \"*passw*\", \"*senha*\", \"*senord*\", \"*\u5bc6\u78bc*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "contrase\u00f1a",
        "has\u0142o",
        "heslo",
        "parola",
        "passe",
        "passw",
        "senha",
        "senord"
      ],
      "raw_values": [
        "*contrase\u00f1a*",
        "*has\u0142o*",
        "*heslo*",
        "*parola*",
        "*passe*",
        "*passw*",
        "*senha*",
        "*senord*",
        "*\u5bc6\u78bc*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "findstr.exe"
      ],
      "raw_values": [
        "*\\\\findstr.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "findstr.exe"
      ],
      "raw_values": [
        "FINDSTR.EXE"
      ]
    }
  ]
}