{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_wfc",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_wfc.eql",
  "raw_query": "any where process.executable:\"*\\\\wfc.exe\" or process.pe.original_file_name:\"wfc.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wfc.exe"
      ],
      "raw_values": [
        "*\\\\wfc.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wfc.exe"
      ],
      "raw_values": [
        "wfc.exe"
      ]
    }
  ]
}