{
  "source": "sigma",
  "name": "proc_creation_win_powershell_set_acl",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_powershell_set_acl.eql",
  "raw_query": "any where ((process.pe.original_file_name like~ (\"PowerShell.EXE\", \"pwsh.dll\")) or (process.executable like~ (\"*\\\\powershell.exe\", \"*\\\\pwsh.exe\"))) and (process.command_line:\"*Set-Acl *\" and process.command_line:\"*-AclObject *\" and process.command_line:\"*-Path *\")",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.dll"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "powershell.exe",
        "pwsh.exe"
      ],
      "raw_values": [
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "set-acl",
        "-aclobject",
        "-path"
      ],
      "raw_values": [
        "*Set-Acl *",
        "*-AclObject *",
        "*-Path *"
      ]
    }
  ]
}