{
  "source": "sigma",
  "name": "proc_creation_win_imewbdld_download",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_imewbdld_download.eql",
  "raw_query": "any where (process.executable:\"*\\\\IMEWDBLD.exe\" or process.pe.original_file_name:\"imewdbld.exe\") and (process.command_line like~ (\"*http://*\", \"*https://*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "imewdbld.exe"
      ],
      "raw_values": [
        "*\\\\IMEWDBLD.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "imewdbld.exe"
      ],
      "raw_values": [
        "imewdbld.exe"
      ]
    }
  ]
}