{
  "source": "sigma",
  "name": "proc_creation_win_protocolhandler_download",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_protocolhandler_download.eql",
  "raw_query": "any where (process.executable:\"*\\\\protocolhandler.exe\" or process.pe.original_file_name:\"ProtocolHandler.exe\") and (process.command_line like~ (\"*ftp://*\", \"*http://*\", \"*https://*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "protocolhandler.exe"
      ],
      "raw_values": [
        "*\\\\protocolhandler.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "protocolhandler.exe"
      ],
      "raw_values": [
        "ProtocolHandler.exe"
      ]
    }
  ]
}