{
  "source": "sigma",
  "name": "proc_creation_win_python_adidnsdump",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_python_adidnsdump.eql",
  "raw_query": "any where process.executable:\"*\\\\python.exe\" and process.command_line:\"*adidnsdump*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "python.exe"
      ],
      "raw_values": [
        "*\\\\python.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "adidnsdump"
      ],
      "raw_values": [
        "*adidnsdump*"
      ]
    }
  ]
}