{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_visual_basic_compiler",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_visual_basic_compiler.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\vbc.exe\" and process.executable:\"*\\\\cvtres.exe\"",
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "vbc.exe"
      ],
      "raw_values": [
        "*\\\\vbc.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cvtres.exe"
      ],
      "raw_values": [
        "*\\\\cvtres.exe"
      ]
    }
  ]
}