{
  "source": "sigma",
  "name": "proc_creation_win_remote_access_tools_screenconnect_webshell",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect_webshell.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\ScreenConnect.Service.exe\" and (process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\csc.exe\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "csc.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\csc.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "screenconnect.service.exe"
      ],
      "raw_values": [
        "*\\\\ScreenConnect.Service.exe"
      ]
    }
  ]
}