{
  "source": "sigma",
  "name": "proc_creation_win_dsquery_domain_trust_discovery",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_dsquery_domain_trust_discovery.eql",
  "raw_query": "any where (process.executable:\"*\\\\dsquery.exe\" or process.pe.original_file_name:\"dsquery.exe\") and process.command_line:\"*trustedDomain*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "dsquery.exe"
      ],
      "raw_values": [
        "*\\\\dsquery.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "dsquery.exe"
      ],
      "raw_values": [
        "dsquery.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "trusteddomain"
      ],
      "raw_values": [
        "*trustedDomain*"
      ]
    }
  ]
}