{
  "source": "sigma",
  "name": "proc_creation_win_certoc_load_dll_susp_locations",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_certoc_load_dll_susp_locations.eql",
  "raw_query": "any where (process.executable:\"*\\\\certoc.exe\" or process.pe.original_file_name:\"CertOC.exe\") and process.command_line like~ (\"* -LoadDLL *\", \"* /LoadDLL *\", \"* \u2013LoadDLL *\", \"* \u2014LoadDLL *\", \"* \u2015LoadDLL *\") and (process.command_line like~ (\"*\\\\Appdata\\\\Local\\\\Temp\\\\*\", \"*\\\\Desktop\\\\*\", \"*\\\\Downloads\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*C:\\\\Windows\\\\Tasks\\\\*\", \"*C:\\\\Windows\\\\Temp\\\\*\"))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-loaddll",
        "loaddll",
        "\u2013loaddll",
        "\u2014loaddll",
        "\u2015loaddll"
      ],
      "raw_values": [
        "* -LoadDLL *",
        "* /LoadDLL *",
        "* \u2013LoadDLL *",
        "* \u2014LoadDLL *",
        "* \u2015LoadDLL *",
        "*\\\\Appdata\\\\Local\\\\Temp\\\\*",
        "*\\\\Desktop\\\\*",
        "*\\\\Downloads\\\\*",
        "*\\\\Users\\\\Public\\\\*",
        "*C:\\\\Windows\\\\Tasks\\\\*",
        "*C:\\\\Windows\\\\Temp\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certoc.exe"
      ],
      "raw_values": [
        "*\\\\certoc.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certoc.exe"
      ],
      "raw_values": [
        "CertOC.exe"
      ]
    }
  ]
}