{
  "source": "sigma",
  "name": "proc_creation_win_cmd_dir_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_cmd_dir_execution.eql",
  "raw_query": "any where (process.executable:\"*\\\\cmd.exe\" or process.pe.original_file_name:\"Cmd.Exe\") and process.command_line like~ (\"*dir*-s*\", \"*dir*/s*\", \"*dir*\u2013s*\", \"*dir*\u2014s*\", \"*dir*\u2015s*\")",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "dir*-s",
        "dir*\u2013s",
        "dir*\u2014s",
        "dir*\u2015s"
      ],
      "raw_values": [
        "*dir*-s*",
        "*dir*/s*",
        "*dir*\u2013s*",
        "*dir*\u2014s*",
        "*dir*\u2015s*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "Cmd.Exe"
      ]
    }
  ]
}