{
  "source": "sigma",
  "name": "proc_creation_win_agentexecutor_potential_abuse",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_agentexecutor_potential_abuse.eql",
  "raw_query": "any where ((process.executable:\"\\\\AgentExecutor.exe\" or process.pe.original_file_name:\"AgentExecutor.exe\") and (process.command_line like~ (\"* -powershell*\", \"* -remediationScript*\"))) and (not process.parent.executable:\"*\\\\Microsoft.Management.Services.IntuneWindowsAgent.exe\")",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-powershell",
        "-remediationscript"
      ],
      "raw_values": [
        "* -powershell*",
        "* -remediationScript*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "agentexecutor.exe"
      ],
      "raw_values": [
        "\\\\AgentExecutor.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "agentexecutor.exe"
      ],
      "raw_values": [
        "AgentExecutor.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "microsoft.management.services.intunewindowsagent.exe"
      ],
      "raw_values": [
        "*\\\\Microsoft.Management.Services.IntuneWindowsAgent.exe"
      ]
    }
  ]
}