{
  "source": "sigma",
  "name": "proc_creation_win_certutil_certificate_installation",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_certutil_certificate_installation.eql",
  "raw_query": "any where (process.executable:\"*\\\\certutil.exe\" or process.pe.original_file_name:\"CertUtil.exe\") and process.command_line like~ (\"*-addstore*\", \"*/addstore*\", \"*\u2013addstore*\", \"*\u2014addstore*\", \"*\u2015addstore*\") and process.command_line:\"*root*\"",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "-addstore",
        "addstore",
        "\u2013addstore",
        "\u2014addstore",
        "\u2015addstore"
      ],
      "raw_values": [
        "*-addstore*",
        "*/addstore*",
        "*\u2013addstore*",
        "*\u2014addstore*",
        "*\u2015addstore*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "*\\\\certutil.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "certutil.exe"
      ],
      "raw_values": [
        "CertUtil.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "root"
      ],
      "raw_values": [
        "*root*"
      ]
    }
  ]
}