{
  "source": "sigma",
  "name": "proc_creation_win_renamed_browsercore",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_renamed_browsercore.eql",
  "raw_query": "any where process.pe.original_file_name:\"BrowserCore.exe\" and (not process.executable:\"*\\\\BrowserCore.exe\")",
  "conditions": [
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "browsercore.exe"
      ],
      "raw_values": [
        "BrowserCore.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "browsercore.exe"
      ],
      "raw_values": [
        "*\\\\BrowserCore.exe"
      ]
    }
  ]
}