{
  "source": "sigma",
  "name": "proc_creation_win_reg_service_imagepath_change",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_reg_service_imagepath_change.eql",
  "raw_query": "any where (process.executable:\"*\\\\reg.exe\" and (process.command_line:\"*add *\" and process.command_line:\"*SYSTEM\\\\CurrentControlSet\\\\Services\\\\*\" and process.command_line:\"* ImagePath *\")) and process.command_line like~ (\"* -d *\", \"* /d *\", \"* \u2013d *\", \"* \u2014d *\", \"* \u2015d *\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "reg.exe"
      ],
      "raw_values": [
        "*\\\\reg.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "add",
        "imagepath"
      ],
      "raw_values": [
        "*add *",
        "*SYSTEM\\\\CurrentControlSet\\\\Services\\\\*",
        "* ImagePath *"
      ]
    }
  ]
}