{
  "source": "sigma",
  "name": "proc_creation_win_pua_cleanwipe",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_pua_cleanwipe.eql",
  "raw_query": "any where process.executable:\"*\\\\SepRemovalToolNative_x64.exe\" or (process.executable:\"*\\\\CATClean.exe\" and process.command_line:\"*--uninstall*\") or (process.executable:\"*\\\\NetInstaller.exe\" and process.command_line:\"*-r*\") or (process.executable:\"*\\\\WFPUnins.exe\" and (process.command_line:\"*/uninstall*\" and process.command_line:\"*/enterprise*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "sepremovaltoolnative_x64.exe",
        "catclean.exe",
        "netinstaller.exe",
        "wfpunins.exe"
      ],
      "raw_values": [
        "*\\\\SepRemovalToolNative_x64.exe",
        "*\\\\CATClean.exe",
        "*\\\\NetInstaller.exe",
        "*\\\\WFPUnins.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "--uninstall",
        "uninstall",
        "enterprise"
      ],
      "raw_values": [
        "*--uninstall*",
        "*-r*",
        "*/uninstall*",
        "*/enterprise*"
      ]
    }
  ]
}