{
  "source": "sigma",
  "name": "proc_creation_win_rar_compress_data",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_rar_compress_data.eql",
  "raw_query": "any where process.executable:\"*\\\\rar.exe\" and process.command_line:\"* a *\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "rar.exe"
      ],
      "raw_values": [
        "*\\\\rar.exe"
      ]
    }
  ]
}