{
  "source": "sigma",
  "name": "proc_creation_win_vaultcmd_list_creds",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_vaultcmd_list_creds.eql",
  "raw_query": "any where (process.executable:\"*\\\\VaultCmd.exe\" or process.pe.original_file_name:\"VAULTCMD.EXE\") and process.command_line:\"*/listcreds:*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vaultcmd.exe"
      ],
      "raw_values": [
        "*\\\\VaultCmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "vaultcmd.exe"
      ],
      "raw_values": [
        "VAULTCMD.EXE"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "listcreds:"
      ],
      "raw_values": [
        "*/listcreds:*"
      ]
    }
  ]
}