{
  "source": "sigma",
  "name": "proc_creation_win_cmd_set_prompt_abuse",
  "subtree": "rules-threat-hunting",
  "category": "process",
  "sigma_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_cmd_set_prompt_abuse.eql",
  "raw_query": "any where (process.executable:\"*\\\\cmd.exe\" or process.pe.original_file_name:\"Cmd.Exe\") and (process.command_line like~ (\"*/c set /p=*\", \"*\\\"set /p=*\", \"*>>*set /p=*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "cmd.exe"
      ],
      "raw_values": [
        "Cmd.Exe"
      ]
    }
  ]
}