{
  "source": "sigma",
  "name": "proc_creation_win_werfault_reflect_debugger_exec",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_werfault_reflect_debugger_exec.eql",
  "raw_query": "any where (process.executable:\"*\\\\WerFault.exe\" or process.pe.original_file_name:\"WerFault.exe\") and process.command_line:\"* -pr *\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "werfault.exe"
      ],
      "raw_values": [
        "*\\\\WerFault.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "werfault.exe"
      ],
      "raw_values": [
        "WerFault.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "-pr"
      ],
      "raw_values": [
        "* -pr *"
      ]
    }
  ]
}