{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_runscripthelper",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_runscripthelper.eql",
  "raw_query": "any where process.executable:\"*\\\\Runscripthelper.exe\" and process.command_line:\"*surfacecheck*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "runscripthelper.exe"
      ],
      "raw_values": [
        "*\\\\Runscripthelper.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "surfacecheck"
      ],
      "raw_values": [
        "*surfacecheck*"
      ]
    }
  ]
}