{
  "source": "sigma",
  "name": "proc_creation_win_wmi_persistence_script_event_consumer",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_wmi_persistence_script_event_consumer.eql",
  "raw_query": "any where process.executable:\"C:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe\" and process.parent.executable:\"C:\\\\Windows\\\\System32\\\\svchost.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "scrcons.exe"
      ],
      "raw_values": [
        "C:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\System32\\\\svchost.exe"
      ]
    }
  ]
}