{
  "source": "sigma",
  "name": "proc_creation_win_uac_bypass_wmp",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_uac_bypass_wmp.eql",
  "raw_query": "any where (process.executable:\"C:\\\\Program Files\\\\Windows Media Player\\\\osk.exe\" or (process.executable:\"C:\\\\Windows\\\\System32\\\\cmd.exe\" and process.parent.command_line:\"\\\"C:\\\\Windows\\\\system32\\\\mmc.exe\\\" \\\"C:\\\\Windows\\\\system32\\\\eventvwr.msc\\\" /s\")) and (winlog.event_data.IntegrityLevel like~ (\"High\", \"System\", \"S-1-16-16384\", \"S-1-16-12288\"))",
  "conditions": [
    {
      "field": "winlog.event_data.integritylevel",
      "raw_field": "winlog.event_data.IntegrityLevel",
      "operator": "like~",
      "values": [
        "high",
        "system",
        "s-1-16-16384",
        "s-1-16-12288"
      ],
      "raw_values": [
        "High",
        "System",
        "S-1-16-16384",
        "S-1-16-12288"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "osk.exe",
        "cmd.exe"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Windows Media Player\\\\osk.exe",
        "C:\\\\Windows\\\\System32\\\\cmd.exe"
      ]
    }
  ]
}