{
  "source": "sigma",
  "name": "proc_creation_win_odbcconf_register_dll_regsvr_susp",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_odbcconf_register_dll_regsvr_susp.eql",
  "raw_query": "any where ((process.executable:\"*\\\\odbcconf.exe\" or process.pe.original_file_name:\"odbcconf.exe\") and process.command_line:\"*REGSVR *\") and (not process.command_line:\"*.dll*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "odbcconf.exe"
      ],
      "raw_values": [
        "*\\\\odbcconf.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "odbcconf.exe"
      ],
      "raw_values": [
        "odbcconf.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "regsvr",
        ".dll"
      ],
      "raw_values": [
        "*REGSVR *",
        "*.dll*"
      ]
    }
  ]
}