{
  "source": "sigma",
  "name": "proc_creation_win_wusa_cab_files_extraction",
  "subtree": "rules-threat-hunting",
  "category": "process",
  "sigma_path": "rules-threat-hunting/windows/process_creation/proc_creation_win_wusa_cab_files_extraction.eql",
  "raw_query": "any where process.executable:\"*\\\\wusa.exe\" and process.command_line:\"*/extract:*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wusa.exe"
      ],
      "raw_values": [
        "*\\\\wusa.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "extract:"
      ],
      "raw_values": [
        "*/extract:*"
      ]
    }
  ]
}