{
  "source": "sigma",
  "name": "proc_creation_win_fsi_fsharp_code_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_fsi_fsharp_code_execution.eql",
  "raw_query": "any where (process.executable like~ (\"*\\\\fsi.exe\", \"*\\\\fsianycpu.exe\")) or (process.pe.original_file_name like~ (\"fsi.exe\", \"fsianycpu.exe\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "fsi.exe",
        "fsianycpu.exe"
      ],
      "raw_values": [
        "*\\\\fsi.exe",
        "*\\\\fsianycpu.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "fsi.exe",
        "fsianycpu.exe"
      ],
      "raw_values": [
        "fsi.exe",
        "fsianycpu.exe"
      ]
    }
  ]
}