{
  "source": "sigma",
  "name": "proc_creation_win_dns_susp_child_process",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_dns_susp_child_process.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\dns.exe\" and (not process.executable:\"*\\\\conhost.exe\")",
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "dns.exe"
      ],
      "raw_values": [
        "*\\\\dns.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "conhost.exe"
      ],
      "raw_values": [
        "*\\\\conhost.exe"
      ]
    }
  ]
}