{
  "source": "sigma",
  "name": "proc_creation_win_lolbin_remote",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_lolbin_remote.eql",
  "raw_query": "any where process.executable:\"*\\\\remote.exe\" or process.pe.original_file_name:\"remote.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "remote.exe"
      ],
      "raw_values": [
        "*\\\\remote.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "remote.exe"
      ],
      "raw_values": [
        "remote.exe"
      ]
    }
  ]
}