{
  "source": "sigma",
  "name": "proc_creation_win_office_outlook_susp_child_processes",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\OUTLOOK.EXE\" and (process.executable like~ (\"*\\\\AppVLP.exe\", \"*\\\\bash.exe\", \"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\forfiles.exe\", \"*\\\\hh.exe\", \"*\\\\mftrace.exe\", \"*\\\\msbuild.exe\", \"*\\\\msdt.exe\", \"*\\\\mshta.exe\", \"*\\\\msiexec.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regsvr32.exe\", \"*\\\\schtasks.exe\", \"*\\\\scrcons.exe\", \"*\\\\scriptrunner.exe\", \"*\\\\sh.exe\", \"*\\\\svchost.exe\", \"*\\\\wmic.exe\", \"*\\\\wscript.exe\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "appvlp.exe",
        "bash.exe",
        "cmd.exe",
        "cscript.exe",
        "forfiles.exe",
        "hh.exe",
        "mftrace.exe",
        "msbuild.exe",
        "msdt.exe",
        "mshta.exe",
        "msiexec.exe",
        "powershell.exe",
        "pwsh.exe",
        "regsvr32.exe",
        "schtasks.exe",
        "scrcons.exe",
        "scriptrunner.exe",
        "sh.exe",
        "svchost.exe",
        "wmic.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\AppVLP.exe",
        "*\\\\bash.exe",
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\forfiles.exe",
        "*\\\\hh.exe",
        "*\\\\mftrace.exe",
        "*\\\\msbuild.exe",
        "*\\\\msdt.exe",
        "*\\\\mshta.exe",
        "*\\\\msiexec.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regsvr32.exe",
        "*\\\\schtasks.exe",
        "*\\\\scrcons.exe",
        "*\\\\scriptrunner.exe",
        "*\\\\sh.exe",
        "*\\\\svchost.exe",
        "*\\\\wmic.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "outlook.exe"
      ],
      "raw_values": [
        "*\\\\OUTLOOK.EXE"
      ]
    }
  ]
}