{
  "source": "sigma",
  "name": "proc_creation_win_pua_crassus",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_pua_crassus.eql",
  "raw_query": "any where process.executable:\"*\\\\Crassus.exe\" or process.pe.original_file_name:\"Crassus.exe\" or process.pe.description:\"*Crassus*\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "crassus.exe"
      ],
      "raw_values": [
        "*\\\\Crassus.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "crassus.exe"
      ],
      "raw_values": [
        "Crassus.exe"
      ]
    },
    {
      "field": "process.pe.description",
      "raw_field": "process.pe.description",
      "operator": ":",
      "values": [
        "crassus"
      ],
      "raw_values": [
        "*Crassus*"
      ]
    }
  ]
}