{
  "source": "sigma",
  "name": "proc_creation_win_ping_hex_ip",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_ping_hex_ip.eql",
  "raw_query": "any where process.executable:\"*\\\\ping.exe\" and process.command_line:\"SigmaRegularExpression(regexp=SigmaString(['0x[a-fA-F0-9]{8}']), flags=set())\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "ping.exe"
      ],
      "raw_values": [
        "*\\\\ping.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "sigmaregularexpression(regexp=sigmastring(['0x[a-fa-f0-9]{8}']), flags=set())"
      ],
      "raw_values": [
        "SigmaRegularExpression(regexp=SigmaString(['0x[a-fA-F0-9]{8}']), flags=set())"
      ]
    }
  ]
}