{
  "source": "sigma",
  "name": "proc_creation_win_curl_cookie_hijacking",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_curl_cookie_hijacking.eql",
  "raw_query": "any where (process.executable:\"*\\\\curl.exe\" or process.pe.original_file_name:\"curl.exe\") and (process.command_line like~ (\"SigmaRegularExpression(regexp=SigmaString(['\\\\s-c\\\\s']), flags=set())\", \"*--cookie-jar*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "curl.exe"
      ],
      "raw_values": [
        "*\\\\curl.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "curl.exe"
      ],
      "raw_values": [
        "curl.exe"
      ]
    }
  ]
}