{
  "source": "sigma",
  "name": "proc_creation_win_keyscrambler_susp_child_process",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_keyscrambler_susp_child_process.eql",
  "raw_query": "any where process.parent.executable:\"*\\\\KeyScrambler.exe\" and ((process.executable like~ (\"*\\\\cmd.exe\", \"*\\\\cscript.exe\", \"*\\\\mshta.exe\", \"*\\\\powershell.exe\", \"*\\\\pwsh.exe\", \"*\\\\regsvr32.exe\", \"*\\\\rundll32.exe\", \"*\\\\wscript.exe\")) or (process.pe.original_file_name like~ (\"Cmd.Exe\", \"cscript.exe\", \"mshta.exe\", \"PowerShell.EXE\", \"pwsh.dll\", \"regsvr32.exe\", \"RUNDLL32.EXE\", \"wscript.exe\")))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.exe",
        "regsvr32.exe",
        "rundll32.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "*\\\\cmd.exe",
        "*\\\\cscript.exe",
        "*\\\\mshta.exe",
        "*\\\\powershell.exe",
        "*\\\\pwsh.exe",
        "*\\\\regsvr32.exe",
        "*\\\\rundll32.exe",
        "*\\\\wscript.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "cmd.exe",
        "cscript.exe",
        "mshta.exe",
        "powershell.exe",
        "pwsh.dll",
        "regsvr32.exe",
        "rundll32.exe",
        "wscript.exe"
      ],
      "raw_values": [
        "Cmd.Exe",
        "cscript.exe",
        "mshta.exe",
        "PowerShell.EXE",
        "pwsh.dll",
        "regsvr32.exe",
        "RUNDLL32.EXE",
        "wscript.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "keyscrambler.exe"
      ],
      "raw_values": [
        "*\\\\KeyScrambler.exe"
      ]
    }
  ]
}