{
  "source": "sigma",
  "name": "proc_creation_win_apt_revil_kaseya",
  "subtree": "rules-emerging-threats",
  "category": "any",
  "sigma_path": "rules-emerging-threats/2021/TA/Kaseya-Supply-Chain/proc_creation_win_apt_revil_kaseya.eql",
  "raw_query": "any where (process.command_line like~ (\"*C:\\\\Windows\\\\cert.exe*\", \"*del /q /f c:\\\\kworking\\\\agent.crt*\", \"*Kaseya VSA Agent Hot-fix*\", \"*\\\\AppData\\\\Local\\\\Temp\\\\MsMpEng.exe*\", \"*rmdir /s /q %SystemDrive%\\\\inetpub\\\\logs*\", \"*del /s /q /f %SystemDrive%\\\\*.log*\", \"*c:\\\\kworking1\\\\agent.exe*\", \"*c:\\\\kworking1\\\\agent.crt*\")) or (process.executable like~ (\"C:\\\\Windows\\\\MsMpEng.exe\", \"C:\\\\Windows\\\\cert.exe\", \"C:\\\\kworking\\\\agent.exe\", \"C:\\\\kworking1\\\\agent.exe\")) or (process.command_line:\"*del /s /q /f*\" and process.command_line:\"*WebPages\\\\Errors\\\\webErrorLog.txt*\")",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "cert.exe",
        "agent.crt",
        "kaseya vsa agent hot-fix",
        "msmpeng.exe",
        "logs",
        ".log",
        "agent.exe"
      ],
      "raw_values": [
        "*C:\\\\Windows\\\\cert.exe*",
        "*del /q /f c:\\\\kworking\\\\agent.crt*",
        "*Kaseya VSA Agent Hot-fix*",
        "*\\\\AppData\\\\Local\\\\Temp\\\\MsMpEng.exe*",
        "*rmdir /s /q %SystemDrive%\\\\inetpub\\\\logs*",
        "*del /s /q /f %SystemDrive%\\\\*.log*",
        "*c:\\\\kworking1\\\\agent.exe*",
        "*c:\\\\kworking1\\\\agent.crt*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "msmpeng.exe",
        "cert.exe",
        "agent.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\MsMpEng.exe",
        "C:\\\\Windows\\\\cert.exe",
        "C:\\\\kworking\\\\agent.exe",
        "C:\\\\kworking1\\\\agent.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "weberrorlog.txt"
      ],
      "raw_values": [
        "*del /s /q /f*",
        "*WebPages\\\\Errors\\\\webErrorLog.txt*"
      ]
    }
  ]
}