{
  "source": "sigma",
  "name": "proc_creation_win_sysinternals_procdump",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_sysinternals_procdump.eql",
  "raw_query": "any where process.executable like~ (\"*\\\\procdump.exe\", \"*\\\\procdump64.exe\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "procdump.exe",
        "procdump64.exe"
      ],
      "raw_values": [
        "*\\\\procdump.exe",
        "*\\\\procdump64.exe"
      ]
    }
  ]
}