{
  "source": "sigma",
  "name": "proc_creation_win_winrm_remote_powershell_session_process",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_winrm_remote_powershell_session_process.eql",
  "raw_query": "any where process.executable:\"*\\\\wsmprovhost.exe\" or process.parent.executable:\"*\\\\wsmprovhost.exe\"",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "wsmprovhost.exe"
      ],
      "raw_values": [
        "*\\\\wsmprovhost.exe"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "wsmprovhost.exe"
      ],
      "raw_values": [
        "*\\\\wsmprovhost.exe"
      ]
    }
  ]
}