{
  "source": "sigma",
  "name": "proc_creation_win_iis_appcmd_susp_rewrite_rule",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_iis_appcmd_susp_rewrite_rule.eql",
  "raw_query": "any where (process.executable:\"*\\\\appcmd.exe\" or process.pe.original_file_name:\"appcmd.exe\") and (process.command_line:\"*set*\" and process.command_line:\"*config*\" and process.command_line:\"*section:system.webServer/rewrite/globalRules*\" and process.command_line:\"*commit:*\")",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "appcmd.exe"
      ],
      "raw_values": [
        "*\\\\appcmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "appcmd.exe"
      ],
      "raw_values": [
        "appcmd.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "set",
        "config",
        "globalrules",
        "commit:"
      ],
      "raw_values": [
        "*set*",
        "*config*",
        "*section:system.webServer/rewrite/globalRules*",
        "*commit:*"
      ]
    }
  ]
}