{
  "source": "sigma",
  "name": "proc_creation_win_mode_codepage_russian",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_mode_codepage_russian.eql",
  "raw_query": "any where (process.executable:\"*\\\\mode.com\" or process.pe.original_file_name:\"MODE.COM\") and ((process.command_line:\"* con *\" and process.command_line:\"* cp *\" and process.command_line:\"* select=*\") and (process.command_line like~ (\"*=1251\", \"*=866\")))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "=1251",
        "=866"
      ],
      "raw_values": [
        "*=1251",
        "*=866"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mode.com"
      ],
      "raw_values": [
        "*\\\\mode.com"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "mode.com"
      ],
      "raw_values": [
        "MODE.COM"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "con",
        "select="
      ],
      "raw_values": [
        "* con *",
        "* cp *",
        "* select=*"
      ]
    }
  ]
}