{
  "source": "sigma",
  "name": "proc_creation_win_regasm_regsvcs_uncommon_extension_execution",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_regasm_regsvcs_uncommon_extension_execution.eql",
  "raw_query": "any where ((process.executable like~ (\"*\\\\Regsvcs.exe\", \"*\\\\Regasm.exe\")) or (process.pe.original_file_name like~ (\"RegSvcs.exe\", \"RegAsm.exe\"))) and (process.command_line like~ (\"*.dat*\", \"*.gif*\", \"*.jpeg*\", \"*.jpg*\", \"*.png*\", \"*.txt*\"))",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "regsvcs.exe",
        "regasm.exe"
      ],
      "raw_values": [
        "*\\\\Regsvcs.exe",
        "*\\\\Regasm.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "like~",
      "values": [
        "regsvcs.exe",
        "regasm.exe"
      ],
      "raw_values": [
        "RegSvcs.exe",
        "RegAsm.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        ".dat",
        ".gif",
        ".jpeg",
        ".jpg",
        ".png",
        ".txt"
      ],
      "raw_values": [
        "*.dat*",
        "*.gif*",
        "*.jpeg*",
        "*.jpg*",
        "*.png*",
        "*.txt*"
      ]
    }
  ]
}