{
  "source": "sigma",
  "name": "proc_creation_win_schtasks_reg_loader",
  "subtree": "rules",
  "category": "process",
  "sigma_path": "rules/windows/process_creation/proc_creation_win_schtasks_reg_loader.eql",
  "raw_query": "any where ((process.executable:\"*\\\\schtasks.exe\" or process.pe.original_file_name:\"schtasks.exe\") and process.command_line:\"*/Create*\" and (process.command_line like~ (\"*Get-ItemProperty*\", \"* gp *\")) and (process.command_line like~ (\"*HKCU:*\", \"*HKLM:*\", \"*registry::*\", \"*HKEY_*\"))) and (not (process.command_line like~ (\"*FromBase64String*\", \"*encodedcommand*\")))",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "get-itemproperty",
        "hkcu:",
        "hklm:",
        "registry::",
        "hkey_",
        "frombase64string",
        "encodedcommand"
      ],
      "raw_values": [
        "*Get-ItemProperty*",
        "* gp *",
        "*HKCU:*",
        "*HKLM:*",
        "*registry::*",
        "*HKEY_*",
        "*FromBase64String*",
        "*encodedcommand*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "schtasks.exe"
      ],
      "raw_values": [
        "*\\\\schtasks.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "schtasks.exe"
      ],
      "raw_values": [
        "schtasks.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "create"
      ],
      "raw_values": [
        "*/Create*"
      ]
    }
  ]
}