{
  "source": "sigma",
  "name": "registry_set_asep_reg_keys_modification_currentversion",
  "subtree": "rules",
  "category": "registry",
  "sigma_path": "rules/windows/registry/registry_set/registry_set_asep_reg_keys_modification_currentversion.eql",
  "raw_query": "any where (registry.path:\"*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion*\" and (registry.path like~ (\"*\\\\ShellServiceObjectDelayLoad*\", \"*\\\\Run\\\\*\", \"*\\\\RunOnce\\\\*\", \"*\\\\RunOnceEx\\\\*\", \"*\\\\RunServices\\\\*\", \"*\\\\RunServicesOnce\\\\*\", \"*\\\\Policies\\\\System\\\\Shell*\", \"*\\\\Policies\\\\Explorer\\\\Run*\", \"*\\\\Group Policy\\\\Scripts\\\\Startup*\", \"*\\\\Group Policy\\\\Scripts\\\\Shutdown*\", \"*\\\\Group Policy\\\\Scripts\\\\Logon*\", \"*\\\\Group Policy\\\\Scripts\\\\Logoff*\", \"*\\\\Explorer\\\\ShellServiceObjects*\", \"*\\\\Explorer\\\\ShellIconOverlayIdentifiers*\", \"*\\\\Explorer\\\\ShellExecuteHooks*\", \"*\\\\Explorer\\\\SharedTaskScheduler*\", \"*\\\\Explorer\\\\Browser Helper Objects*\", \"*\\\\Authentication\\\\PLAP Providers*\", \"*\\\\Authentication\\\\Credential Providers*\", \"*\\\\Authentication\\\\Credential Provider Filters*\"))) and (not ((winlog.event_data.Details:\"(Empty)\" or registry.path:\"*\\\\NgcFirst\\\\ConsecutiveSwitchCount\" or (process.executable like~ (\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\Update\\\\OneDriveSetup.exe\", \"*\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe\", \"*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe\")) or (process.executable like~ (\"C:\\\\WINDOWS\\\\system32\\\\devicecensus.exe\", \"C:\\\\Windows\\\\system32\\\\winsat.exe\", \"C:\\\\Program Files\\\\Microsoft OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe\", \"C:\\\\Program Files (x86)\\\\Microsoft OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe\", \"C:\\\\Program Files\\\\Microsoft OneDrive\\\\Update\\\\OneDriveSetup.exe\", \"C:\\\\Program Files (x86)\\\\Microsoft OneDrive\\\\Update\\\\OneDriveSetup.exe\", \"C:\\\\Program Files\\\\Microsoft Office\\\\root\\\\integration\\\\Addons\\\\OneDriveSetup.exe\", \"C:\\\\Program Files (x86)\\\\Microsoft Office\\\\root\\\\integration\\\\Addons\\\\OneDriveSetup.exe\", \"C:\\\\Program Files\\\\KeePass Password Safe 2\\\\ShInstUtil.exe\", \"C:\\\\Program Files\\\\Everything\\\\Everything.exe\", \"C:\\\\Program Files (x86)\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\", \"C:\\\\Program Files\\\\Microsoft Office\\\\root\\\\integration\\\\integrator.exe\"))) or (?winlog.event_data.Details == null) or (process.executable:\"C:\\\\Windows\\\\system32\\\\LogonUI.exe\" and (registry.path like~ (\"*\\\\Authentication\\\\Credential Providers\\\\{D6886603-9D2F-4EB2-B667-1971041FA96B}\\\\*\", \"*\\\\Authentication\\\\Credential Providers\\\\{BEC09223-B018-416D-A0AC-523971B639F5}\\\\*\", \"*\\\\Authentication\\\\Credential Providers\\\\{8AF662BF-65A0-4D0A-A540-A338A999D36F}\\\\*\", \"*\\\\Authentication\\\\Credential Providers\\\\{27FBDB57-B613-4AF2-9D7E-4FA7A66C21AD}\\\\*\"))) or (process.executable like~ (\"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\*\", \"C:\\\\Program Files (x86)\\\\Microsoft\\\\EdgeWebView\\\\*\", \"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe*\")) or process.executable:\"C:\\\\Program Files\\\\Windows Defender\\\\MsMpEng.exe\" or (process.executable:\"*\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and winlog.event_data.Details:\"*\\\\Microsoft\\\\Teams\\\\Update.exe --processStart *\") or (process.executable:\"C:\\\\Windows\\\\system32\\\\userinit.exe\" and winlog.event_data.Details:\"ctfmon.exe /n\"))) and (not ((process.executable:\"C:\\\\Windows\\\\system32\\\\regsvr32.exe\" and registry.path:\"*DropboxExt*\" and winlog.event_data.Details:\"*A251-47B7-93E1-CDD82E34AF8B}\") or (registry.path:\"*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Opera Browser Assistant\" and winlog.event_data.Details:\"C:\\\\Program Files\\\\Opera\\\\assistant\\\\browser_assistant.exe\") or (registry.path:\"*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Opera Stable\" and (winlog.event_data.Details like~ (\"C:\\\\Program Files\\\\Opera\\\\launcher.exe\", \"C:\\\\Program Files (x86)\\\\Opera\\\\launcher.exe\"))) or (registry.path:\"*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\iTunesHelper\" and winlog.event_data.Details:\"\\\"C:\\\\Program Files\\\\iTunes\\\\iTunesHelper.exe\\\"\") or (registry.path:\"*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\zoommsirepair\" and winlog.event_data.Details:\"\\\"C:\\\\Program Files\\\\Zoom\\\\bin\\\\installer.exe\\\" /repair\") or (registry.path:\"*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Greenshot\" and winlog.event_data.Details:\"C:\\\\Program Files\\\\Greenshot\\\\Greenshot.exe\") or (registry.path:\"*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\GoogleDriveFS\" and winlog.event_data.Details:\"C:\\\\Program Files\\\\Google\\\\Drive File Stream\\\\*\" and winlog.event_data.Details:\"*\\\\GoogleDriveFS.exe*\") or (registry.path:\"*GoogleDrive*\" and (winlog.event_data.Details like~ (\"{CFE8B367-77A7-41D7-9C90-75D16D7DC6B6}\", \"{A8E52322-8734-481D-A7E2-27B309EF8D56}\", \"{C973DA94-CBDF-4E77-81D1-E5B794FBD146}\", \"{51EF1569-67EE-4AD6-9646-E726C3FFC8A2}\"))) or ((winlog.event_data.Details like~ (\"C:\\\\Windows\\\\system32\\\\cmd.exe /q /c rmdir /s /q \\\"C:\\\\Users\\\\*\", \"C:\\\\Windows\\\\system32\\\\cmd.exe /q /c del /q \\\"C:\\\\Users\\\\*\")) and winlog.event_data.Details:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*\") or (registry.path:\"*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\{*\" and (winlog.event_data.Details:\"*\\\\AppData\\\\Local\\\\Package Cache\\\\{*\" and winlog.event_data.Details:\"*}\\\\python-*\") and winlog.event_data.Details:\"*.exe\\\" /burn.runonce\") or ((process.executable like~ (\"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\*\", \"C:\\\\Program Files (x86)\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\*\")) and process.executable:\"*\\\\OfficeClickToRun.exe\") or (process.executable:\"*\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and winlog.event_data.Details:\"*\\\\Microsoft\\\\Teams\\\\Update.exe --processStart*\") or ((process.executable like~ (\"*C:\\\\Program Files\\\\AVG\\\\Antivirus\\\\Setup\\\\*\", \"*C:\\\\Program Files (x86)\\\\AVG\\\\Antivirus\\\\Setup\\\\*\", \"*\\\\instup.exe*\")) and (winlog.event_data.Details like~ (\"\\\"C:\\\\Program Files\\\\AVG\\\\Antivirus\\\\AvLaunch.exe\\\" /gui\", \"\\\"C:\\\\Program Files (x86)\\\\AVG\\\\Antivirus\\\\AvLaunch.exe\\\" /gui\", \"{472083B0-C522-11CF-8763-00608CC02F24}\", \"{472083B1-C522-11CF-8763-00608CC02F24}\"))) or ((process.executable like~ (\"*C:\\\\Program Files\\\\Avast Software\\\\Avast\\\\Setup\\\\*\", \"*C:\\\\Program Files (x86)\\\\Avast Software\\\\Avast\\\\Setup\\\\*\", \"*\\\\instup.exe*\")) and (winlog.event_data.Details like~ (\"\\\"C:\\\\Program Files\\\\Avast Software\\\\Avast\\\\AvLaunch.exe\\\" /gui\", \"\\\"C:\\\\Program Files (x86)\\\\Avast Software\\\\Avast\\\\AvLaunch.exe\\\" /gui\"))) or ((process.executable like~ (\"C:\\\\Program Files\\\\AVG\\\\Antivirus\\\\avgToolsSvc.exe\", \"C:\\\\Program Files (x86)\\\\AVG\\\\Antivirus\\\\avgToolsSvc.exe\")) and registry.path:\"*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\StartupApproved\\\\Run\\\\*\" and winlog.event_data.Details:\"Binary Data\") or ((process.executable like~ (\"*\\\\aurora-agent-64.exe\", \"*\\\\aurora-agent.exe\")) and registry.path:\"*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\aurora-dashboard\" and winlog.event_data.Details:\"C:\\\\Program Files\\\\Aurora-Agent\\\\tools\\\\aurora-dashboard.exe\") or (registry.path:\"*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Everything\" and winlog.event_data.Details:\"*\\\\Everything\\\\Everything.exe\\\" -startup\") or (registry.path:\"*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Discord\" and winlog.event_data.Details:\"*\\\\Discord\\\\Update.exe --processStart Discord.exe\")))",
  "conditions": [
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": "like~",
      "values": [
        "\\\\shellserviceobjectdelayload",
        "\\\\run\\\\",
        "\\\\runonce\\\\",
        "\\\\runonceex\\\\",
        "\\\\runservices\\\\",
        "\\\\runservicesonce\\\\",
        "\\\\policies\\\\system\\\\shell",
        "\\\\policies\\\\explorer\\\\run",
        "\\\\group policy\\\\scripts\\\\startup",
        "\\\\group policy\\\\scripts\\\\shutdown",
        "\\\\group policy\\\\scripts\\\\logon",
        "\\\\group policy\\\\scripts\\\\logoff",
        "\\\\explorer\\\\shellserviceobjects",
        "\\\\explorer\\\\shelliconoverlayidentifiers",
        "\\\\explorer\\\\shellexecutehooks",
        "\\\\explorer\\\\sharedtaskscheduler",
        "\\\\explorer\\\\browser helper objects",
        "\\\\authentication\\\\plap providers",
        "\\\\authentication\\\\credential providers",
        "\\\\authentication\\\\credential provider filters",
        "\\\\authentication\\\\credential providers\\\\{d6886603-9d2f-4eb2-b667-1971041fa96b}\\\\",
        "\\\\authentication\\\\credential providers\\\\{bec09223-b018-416d-a0ac-523971b639f5}\\\\",
        "\\\\authentication\\\\credential providers\\\\{8af662bf-65a0-4d0a-a540-a338a999d36f}\\\\",
        "\\\\authentication\\\\credential providers\\\\{27fbdb57-b613-4af2-9d7e-4fa7a66c21ad}\\\\"
      ],
      "raw_values": [
        "*\\\\ShellServiceObjectDelayLoad*",
        "*\\\\Run\\\\*",
        "*\\\\RunOnce\\\\*",
        "*\\\\RunOnceEx\\\\*",
        "*\\\\RunServices\\\\*",
        "*\\\\RunServicesOnce\\\\*",
        "*\\\\Policies\\\\System\\\\Shell*",
        "*\\\\Policies\\\\Explorer\\\\Run*",
        "*\\\\Group Policy\\\\Scripts\\\\Startup*",
        "*\\\\Group Policy\\\\Scripts\\\\Shutdown*",
        "*\\\\Group Policy\\\\Scripts\\\\Logon*",
        "*\\\\Group Policy\\\\Scripts\\\\Logoff*",
        "*\\\\Explorer\\\\ShellServiceObjects*",
        "*\\\\Explorer\\\\ShellIconOverlayIdentifiers*",
        "*\\\\Explorer\\\\ShellExecuteHooks*",
        "*\\\\Explorer\\\\SharedTaskScheduler*",
        "*\\\\Explorer\\\\Browser Helper Objects*",
        "*\\\\Authentication\\\\PLAP Providers*",
        "*\\\\Authentication\\\\Credential Providers*",
        "*\\\\Authentication\\\\Credential Provider Filters*",
        "*\\\\Authentication\\\\Credential Providers\\\\{D6886603-9D2F-4EB2-B667-1971041FA96B}\\\\*",
        "*\\\\Authentication\\\\Credential Providers\\\\{BEC09223-B018-416D-A0AC-523971B639F5}\\\\*",
        "*\\\\Authentication\\\\Credential Providers\\\\{8AF662BF-65A0-4D0A-A540-A338A999D36F}\\\\*",
        "*\\\\Authentication\\\\Credential Providers\\\\{27FBDB57-B613-4AF2-9D7E-4FA7A66C21AD}\\\\*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "onedrivesetup.exe",
        "spotify.exe",
        "webexhost.exe",
        "devicecensus.exe",
        "winsat.exe",
        "avgtoolssvc.exe",
        "aurora-agent-64.exe",
        "aurora-agent.exe"
      ],
      "raw_values": [
        "*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\Update\\\\OneDriveSetup.exe",
        "*\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe",
        "*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe",
        "C:\\\\WINDOWS\\\\system32\\\\devicecensus.exe",
        "C:\\\\Windows\\\\system32\\\\winsat.exe",
        "C:\\\\Program Files\\\\Microsoft OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe",
        "C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\*",
        "*C:\\\\Program Files\\\\AVG\\\\Antivirus\\\\Setup\\\\*",
        "*C:\\\\Program Files\\\\Avast Software\\\\Avast\\\\Setup\\\\*",
        "C:\\\\Program Files\\\\AVG\\\\Antivirus\\\\avgToolsSvc.exe",
        "*\\\\aurora-agent-64.exe",
        "*\\\\aurora-agent.exe"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": "like~",
      "values": [
        "c:\\\\program files\\\\opera\\\\launcher.exe",
        "{cfe8b367-77a7-41d7-9c90-75d16d7dc6b6}",
        "{a8e52322-8734-481d-a7e2-27b309ef8d56}",
        "{c973da94-cbdf-4e77-81d1-e5b794fbd146}",
        "{51ef1569-67ee-4ad6-9646-e726c3ffc8a2}",
        "c:\\\\windows\\\\system32\\\\cmd.exe /q /c rmdir /s /q \\",
        "c:\\\\users\\\\",
        "/gui"
      ],
      "raw_values": [
        "C:\\\\Program Files\\\\Opera\\\\launcher.exe",
        "{CFE8B367-77A7-41D7-9C90-75D16D7DC6B6}",
        "{A8E52322-8734-481D-A7E2-27B309EF8D56}",
        "{C973DA94-CBDF-4E77-81D1-E5B794FBD146}",
        "{51EF1569-67EE-4AD6-9646-E726C3FFC8A2}",
        "C:\\\\Windows\\\\system32\\\\cmd.exe /q /c rmdir /s /q \\",
        ", ",
        "C:\\\\Users\\\\*",
        "\\",
        " /gui"
      ]
    },
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": ":",
      "values": [
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion",
        "\\\\ngcfirst\\\\consecutiveswitchcount",
        "dropboxext",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\opera browser assistant",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\opera stable",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\ituneshelper",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\runonce\\\\zoommsirepair",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\greenshot",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\googledrivefs",
        "googledrive",
        "\\\\microsoft\\\\windows\\\\currentversion\\\\runonce\\\\{",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\explorer\\\\startupapproved\\\\run\\\\",
        "\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\aurora-dashboard",
        "\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\everything",
        "\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run\\\\discord"
      ],
      "raw_values": [
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion*",
        "*\\\\NgcFirst\\\\ConsecutiveSwitchCount",
        "*DropboxExt*",
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Opera Browser Assistant",
        "*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Opera Stable",
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\iTunesHelper",
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\zoommsirepair",
        "*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Greenshot",
        "*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\GoogleDriveFS",
        "*GoogleDrive*",
        "*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\{*",
        "*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\StartupApproved\\\\Run\\\\*",
        "*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\aurora-dashboard",
        "*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Everything",
        "*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Discord"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": ":",
      "values": [
        "(empty)",
        "\\\\microsoft\\\\teams\\\\update.exe --processstart",
        "ctfmon.exe /n",
        "a251-47b7-93e1-cdd82e34af8b}",
        "c:\\\\program files\\\\opera\\\\assistant\\\\browser_assistant.exe",
        "c:\\\\program files\\\\greenshot\\\\greenshot.exe",
        "c:\\\\program files\\\\google\\\\drive file stream\\\\",
        "\\\\googledrivefs.exe",
        "\\\\appdata\\\\local\\\\microsoft\\\\onedrive\\\\",
        "\\\\appdata\\\\local\\\\package cache\\\\{",
        "}\\\\python-",
        ".exe\\",
        "binary data",
        "c:\\\\program files\\\\aurora-agent\\\\tools\\\\aurora-dashboard.exe",
        "\\\\everything\\\\everything.exe\\",
        "\\\\discord\\\\update.exe --processstart discord.exe"
      ],
      "raw_values": [
        "(Empty)",
        "*\\\\Microsoft\\\\Teams\\\\Update.exe --processStart *",
        "ctfmon.exe /n",
        "*A251-47B7-93E1-CDD82E34AF8B}",
        "C:\\\\Program Files\\\\Opera\\\\assistant\\\\browser_assistant.exe",
        "\\",
        "C:\\\\Program Files\\\\Greenshot\\\\Greenshot.exe",
        "C:\\\\Program Files\\\\Google\\\\Drive File Stream\\\\*",
        "*\\\\GoogleDriveFS.exe*",
        "*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*",
        "*\\\\AppData\\\\Local\\\\Package Cache\\\\{*",
        "*}\\\\python-*",
        "*.exe\\",
        "*\\\\Microsoft\\\\Teams\\\\Update.exe --processStart*",
        "Binary Data",
        "C:\\\\Program Files\\\\Aurora-Agent\\\\tools\\\\aurora-dashboard.exe",
        "*\\\\Everything\\\\Everything.exe\\",
        "*\\\\Discord\\\\Update.exe --processStart Discord.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "logonui.exe",
        "msmpeng.exe",
        "teams.exe",
        "userinit.exe",
        "regsvr32.exe",
        "officeclicktorun.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\system32\\\\LogonUI.exe",
        "C:\\\\Program Files\\\\Windows Defender\\\\MsMpEng.exe",
        "*\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe",
        "C:\\\\Windows\\\\system32\\\\userinit.exe",
        "C:\\\\Windows\\\\system32\\\\regsvr32.exe",
        "*\\\\OfficeClickToRun.exe"
      ]
    }
  ]
}