{
  "source": "sigma",
  "name": "registry_set_netsh_helper_dll_potential_persistence",
  "subtree": "rules",
  "category": "registry",
  "sigma_path": "rules/windows/registry/registry_set/registry_set_netsh_helper_dll_potential_persistence.eql",
  "raw_query": "any where (registry.path:\"*\\\\SOFTWARE\\\\Microsoft\\\\NetSh*\" and winlog.event_data.Details:\"*.dll*\") and (not (process.executable:\"C:\\\\Windows\\\\System32\\\\poqexec.exe\" and (winlog.event_data.Details like~ (\"ipmontr.dll\", \"iasmontr.dll\", \"ippromon.dll\"))))",
  "conditions": [
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": "like~",
      "values": [
        "ipmontr.dll",
        "iasmontr.dll",
        "ippromon.dll"
      ],
      "raw_values": [
        "ipmontr.dll",
        "iasmontr.dll",
        "ippromon.dll"
      ]
    },
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": ":",
      "values": [
        "\\\\software\\\\microsoft\\\\netsh"
      ],
      "raw_values": [
        "*\\\\SOFTWARE\\\\Microsoft\\\\NetSh*"
      ]
    },
    {
      "field": "registry.data.strings",
      "raw_field": "winlog.event_data.Details",
      "operator": ":",
      "values": [
        ".dll"
      ],
      "raw_values": [
        "*.dll*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "poqexec.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\System32\\\\poqexec.exe"
      ]
    }
  ]
}