{
  "source": "sigma",
  "name": "registry_event_ssp_added_lsa_config",
  "subtree": "rules",
  "category": "registry",
  "sigma_path": "rules/windows/registry/registry_event/registry_event_ssp_added_lsa_config.eql",
  "raw_query": "any where (registry.path like~ (\"*\\\\Control\\\\Lsa\\\\Security Packages\", \"*\\\\Control\\\\Lsa\\\\OSConfig\\\\Security Packages\")) and (not ((process.executable like~ (\"C:\\\\Windows\\\\system32\\\\msiexec.exe\", \"C:\\\\Windows\\\\syswow64\\\\MsiExec.exe\")) or (?process.executable == null)))",
  "conditions": [
    {
      "field": "registry.path",
      "raw_field": "registry.path",
      "operator": "like~",
      "values": [
        "\\\\control\\\\lsa\\\\security packages",
        "\\\\control\\\\lsa\\\\osconfig\\\\security packages"
      ],
      "raw_values": [
        "*\\\\Control\\\\Lsa\\\\Security Packages",
        "*\\\\Control\\\\Lsa\\\\OSConfig\\\\Security Packages"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "msiexec.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\system32\\\\msiexec.exe",
        "C:\\\\Windows\\\\syswow64\\\\MsiExec.exe"
      ]
    }
  ]
}