{
  "source": "sigma",
  "name": "sysmon_config_modification",
  "subtree": "rules",
  "category": "sysmon",
  "sigma_path": "rules/windows/sysmon/sysmon_config_modification.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-Sysmon/Operational\" and event.code:\"16\"",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-sysmon/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-Sysmon/Operational"
      ]
    }
  ]
}