{
  "source": "sigma",
  "name": "win_security_susp_scheduled_task_creation",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/security/win_security_susp_scheduled_task_creation.eql",
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4698\" and (winlog.event_data.TaskContent like~ (\"*\\\\AppData\\\\Local\\\\Temp\\\\*\", \"*\\\\AppData\\\\Roaming\\\\*\", \"*\\\\Users\\\\Public\\\\*\", \"*\\\\WINDOWS\\\\Temp\\\\*\", \"*C:\\\\Temp\\\\*\", \"*\\\\Desktop\\\\*\", \"*\\\\Downloads\\\\*\", \"*\\\\Temporary Internet*\", \"*C:\\\\ProgramData\\\\*\", \"*C:\\\\Perflogs\\\\*\")) and (winlog.event_data.TaskContent like~ (\"*regsvr32*\", \"*rundll32*\", \"*cmd.exe</Command>*\", \"*cmd</Command>*\", \"*<Arguments>/c *\", \"*<Arguments>/k *\", \"*<Arguments>/r *\", \"*powershell*\", \"*pwsh*\", \"*mshta*\", \"*wscript*\", \"*cscript*\", \"*certutil*\", \"*bitsadmin*\", \"*bash.exe*\", \"*bash *\", \"*scrcons*\", \"*wmic *\", \"*wmic.exe*\", \"*forfiles*\", \"*scriptrunner*\", \"*hh.exe*\")))",
  "conditions": [
    {
      "field": "winlog.event_data.taskcontent",
      "raw_field": "winlog.event_data.TaskContent",
      "operator": "like~",
      "values": [
        "\\\\appdata\\\\local\\\\temp\\\\",
        "\\\\appdata\\\\roaming\\\\",
        "\\\\users\\\\public\\\\",
        "\\\\windows\\\\temp\\\\",
        "c:\\\\temp\\\\",
        "\\\\desktop\\\\",
        "\\\\downloads\\\\",
        "\\\\temporary internet",
        "c:\\\\programdata\\\\",
        "c:\\\\perflogs\\\\",
        "regsvr32",
        "rundll32",
        "cmd.exe</command>",
        "cmd</command>",
        "<arguments>/c",
        "<arguments>/k",
        "<arguments>/r",
        "powershell",
        "pwsh",
        "mshta",
        "wscript",
        "cscript",
        "certutil",
        "bitsadmin",
        "bash.exe",
        "bash",
        "scrcons",
        "wmic",
        "wmic.exe",
        "forfiles",
        "scriptrunner",
        "hh.exe"
      ],
      "raw_values": [
        "*\\\\AppData\\\\Local\\\\Temp\\\\*",
        "*\\\\AppData\\\\Roaming\\\\*",
        "*\\\\Users\\\\Public\\\\*",
        "*\\\\WINDOWS\\\\Temp\\\\*",
        "*C:\\\\Temp\\\\*",
        "*\\\\Desktop\\\\*",
        "*\\\\Downloads\\\\*",
        "*\\\\Temporary Internet*",
        "*C:\\\\ProgramData\\\\*",
        "*C:\\\\Perflogs\\\\*",
        "*regsvr32*",
        "*rundll32*",
        "*cmd.exe</Command>*",
        "*cmd</Command>*",
        "*<Arguments>/c *",
        "*<Arguments>/k *",
        "*<Arguments>/r *",
        "*powershell*",
        "*pwsh*",
        "*mshta*",
        "*wscript*",
        "*cscript*",
        "*certutil*",
        "*bitsadmin*",
        "*bash.exe*",
        "*bash *",
        "*scrcons*",
        "*wmic *",
        "*wmic.exe*",
        "*forfiles*",
        "*scriptrunner*",
        "*hh.exe*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4698"
      ],
      "raw_values": [
        "4698"
      ]
    }
  ]
}