{
  "source": "sigma",
  "name": "win_system_adcs_enrollment_request_denied",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/system/microsoft_windows_certification_authority/win_system_adcs_enrollment_request_denied.eql",
  "raw_query": "any where winlog.channel:\"System\" and (winlog.provider_name:\"Microsoft-Windows-CertificationAuthority\" and event.code:\"53\")",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "microsoft-windows-certificationauthority"
      ],
      "raw_values": [
        "Microsoft-Windows-CertificationAuthority"
      ]
    }
  ]
}