{
  "source": "sigma",
  "name": "win_security_hybridconnectionmgr_svc_installation",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/security/win_security_hybridconnectionmgr_svc_installation.eql",
  "raw_query": "any where winlog.channel:\"Security\" and (event.code:\"4697\" and service.name:\"HybridConnectionManager\" and winlog.event_data.ServiceFileName:\"*HybridConnectionManager*\")",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "security"
      ],
      "raw_values": [
        "Security"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "4697"
      ],
      "raw_values": [
        "4697"
      ]
    },
    {
      "field": "service.name",
      "raw_field": "service.name",
      "operator": ":",
      "values": [
        "hybridconnectionmanager"
      ],
      "raw_values": [
        "HybridConnectionManager"
      ]
    },
    {
      "field": "winlog.event_data.servicefilename",
      "raw_field": "winlog.event_data.ServiceFileName",
      "operator": ":",
      "values": [
        "hybridconnectionmanager"
      ],
      "raw_values": [
        "*HybridConnectionManager*"
      ]
    }
  ]
}