{
  "source": "sigma",
  "name": "win_appxdeployment_server_policy_block",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_policy_block.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-AppXDeploymentServer/Operational\" and (event.code like~ (\"441\", \"442\", \"453\", \"454\"))",
  "conditions": [
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "like~",
      "values": [
        "441",
        "442",
        "453",
        "454"
      ],
      "raw_values": [
        "441",
        "442",
        "453",
        "454"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-appxdeploymentserver/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-AppXDeploymentServer/Operational"
      ]
    }
  ]
}