{
  "source": "sigma",
  "name": "win_appxdeployment_server_appx_downloaded_from_file_sharing_domains",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/appxdeployment_server/win_appxdeployment_server_appx_downloaded_from_file_sharing_domains.eql",
  "raw_query": "any where winlog.channel:\"Microsoft-Windows-AppXDeploymentServer/Operational\" and (event.code:\"854\" and (winlog.event_data.Path like~ (\"*.githubusercontent.com*\", \"*anonfiles.com*\", \"*cdn.discordapp.com*\", \"*ddns.net*\", \"*dl.dropboxusercontent.com*\", \"*ghostbin.co*\", \"*github.com*\", \"*glitch.me*\", \"*gofile.io*\", \"*hastebin.com*\", \"*mediafire.com*\", \"*mega.nz*\", \"*onrender.com*\", \"*pages.dev*\", \"*paste.ee*\", \"*pastebin.com*\", \"*pastebin.pl*\", \"*pastetext.net*\", \"*privatlab.com*\", \"*privatlab.net*\", \"*send.exploit.in*\", \"*sendspace.com*\", \"*storage.googleapis.com*\", \"*storjshare.io*\", \"*supabase.co*\", \"*temp.sh*\", \"*transfer.sh*\", \"*trycloudflare.com*\", \"*ufile.io*\", \"*w3spaces.com*\", \"*workers.dev*\")))",
  "conditions": [
    {
      "field": "winlog.event_data.path",
      "raw_field": "winlog.event_data.Path",
      "operator": "like~",
      "values": [
        ".githubusercontent.com",
        "anonfiles.com",
        "cdn.discordapp.com",
        "ddns.net",
        "dl.dropboxusercontent.com",
        "ghostbin.co",
        "github.com",
        "glitch.me",
        "gofile.io",
        "hastebin.com",
        "mediafire.com",
        "mega.nz",
        "onrender.com",
        "pages.dev",
        "paste.ee",
        "pastebin.com",
        "pastebin.pl",
        "pastetext.net",
        "privatlab.com",
        "privatlab.net",
        "send.exploit.in",
        "sendspace.com",
        "storage.googleapis.com",
        "storjshare.io",
        "supabase.co",
        "temp.sh",
        "transfer.sh",
        "trycloudflare.com",
        "ufile.io",
        "w3spaces.com",
        "workers.dev"
      ],
      "raw_values": [
        "*.githubusercontent.com*",
        "*anonfiles.com*",
        "*cdn.discordapp.com*",
        "*ddns.net*",
        "*dl.dropboxusercontent.com*",
        "*ghostbin.co*",
        "*github.com*",
        "*glitch.me*",
        "*gofile.io*",
        "*hastebin.com*",
        "*mediafire.com*",
        "*mega.nz*",
        "*onrender.com*",
        "*pages.dev*",
        "*paste.ee*",
        "*pastebin.com*",
        "*pastebin.pl*",
        "*pastetext.net*",
        "*privatlab.com*",
        "*privatlab.net*",
        "*send.exploit.in*",
        "*sendspace.com*",
        "*storage.googleapis.com*",
        "*storjshare.io*",
        "*supabase.co*",
        "*temp.sh*",
        "*transfer.sh*",
        "*trycloudflare.com*",
        "*ufile.io*",
        "*w3spaces.com*",
        "*workers.dev*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "microsoft-windows-appxdeploymentserver/operational"
      ],
      "raw_values": [
        "Microsoft-Windows-AppXDeploymentServer/Operational"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "854"
      ],
      "raw_values": [
        "854"
      ]
    }
  ]
}