{
  "source": "sigma",
  "name": "win_system_susp_service_installation_script",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/system/service_control_manager/win_system_susp_service_installation_script.eql",
  "raw_query": "any where winlog.channel:\"System\" and ((winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\") and (winlog.event_data.ImagePath like~ (\"* -c *\", \"* /c *\", \"* \u2013c *\", \"* \u2014c *\", \"* \u2015c *\") or winlog.event_data.ImagePath like~ (\"* -r *\", \"* /r *\", \"* \u2013r *\", \"* \u2014r *\", \"* \u2015r *\") or winlog.event_data.ImagePath like~ (\"* -k *\", \"* /k *\", \"* \u2013k *\", \"* \u2014k *\", \"* \u2015k *\")) and (winlog.event_data.ImagePath like~ (\"*cscript*\", \"*mshta*\", \"*powershell*\", \"*pwsh*\", \"*regsvr32*\", \"*rundll32*\", \"*wscript*\")))",
  "conditions": [
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": "like~",
      "values": [
        "cscript",
        "mshta",
        "powershell",
        "pwsh",
        "regsvr32",
        "rundll32",
        "wscript"
      ],
      "raw_values": [
        "* -c *",
        "* /c *",
        "* \u2013c *",
        "* \u2014c *",
        "* \u2015c *",
        "* -r *",
        "* /r *",
        "* \u2013r *",
        "* \u2014r *",
        "* \u2015r *",
        "* -k *",
        "* /k *",
        "* \u2013k *",
        "* \u2014k *",
        "* \u2015k *",
        "*cscript*",
        "*mshta*",
        "*powershell*",
        "*pwsh*",
        "*regsvr32*",
        "*rundll32*",
        "*wscript*"
      ]
    },
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    }
  ]
}