{
  "source": "sigma",
  "name": "win_system_service_install_tacticalrmm",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/system/service_control_manager/win_system_service_install_tacticalrmm.eql",
  "raw_query": "any where winlog.channel:\"System\" and ((winlog.provider_name:\"Service Control Manager\" and event.code:\"7045\") and (winlog.event_data.ImagePath:\"*tacticalrmm.exe*\" or winlog.event_data.ServiceName:\"*TacticalRMM Agent Service*\"))",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "system"
      ],
      "raw_values": [
        "System"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "service control manager"
      ],
      "raw_values": [
        "Service Control Manager"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "7045"
      ],
      "raw_values": [
        "7045"
      ]
    },
    {
      "field": "winlog.event_data.imagepath",
      "raw_field": "winlog.event_data.ImagePath",
      "operator": ":",
      "values": [
        "tacticalrmm.exe"
      ],
      "raw_values": [
        "*tacticalrmm.exe*"
      ]
    },
    {
      "field": "winlog.event_data.servicename",
      "raw_field": "winlog.event_data.ServiceName",
      "operator": ":",
      "values": [
        "tacticalrmm agent service"
      ],
      "raw_values": [
        "*TacticalRMM Agent Service*"
      ]
    }
  ]
}