{
  "source": "sigma",
  "name": "win_mssql_failed_logon",
  "subtree": "rules",
  "category": "builtin",
  "sigma_path": "rules/windows/builtin/application/mssqlserver/win_mssql_failed_logon.eql",
  "raw_query": "any where winlog.channel:\"Application\" and (winlog.provider_name:\"*MSSQL*\" and event.code:\"18456\")",
  "conditions": [
    {
      "field": "winlog.channel",
      "raw_field": "winlog.channel",
      "operator": ":",
      "values": [
        "application"
      ],
      "raw_values": [
        "Application"
      ]
    },
    {
      "field": "winlog.provider_name",
      "raw_field": "winlog.provider_name",
      "operator": ":",
      "values": [
        "mssql"
      ],
      "raw_values": [
        "*MSSQL*"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": ":",
      "values": [
        "18456"
      ],
      "raw_values": [
        "18456"
      ]
    }
  ]
}