{
  "source": "elastic",
  "name": "Dumping of Keychain Content via Security Command",
  "slug": "credential_access_dumping_keychain_security",
  "category": "process",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Data Source: Elastic Defend",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/macos/credential_access_dumping_keychain_security.toml",
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and \n process.args like~ \"dump-keychain\" and process.args == \"-d\"\n",
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like~",
      "values": [
        "dump-keychain"
      ],
      "raw_values": [
        "dump-keychain"
      ]
    }
  ]
}