{
  "source": "elastic",
  "name": "Mimikatz Memssp Log File Detected",
  "slug": "credential_access_mimikatz_memssp_default_logs",
  "category": "file",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Resources: Investigation Guide",
    "Data Source: Elastic Endgame",
    "Data Source: Elastic Defend",
    "Data Source: Sysmon",
    "Data Source: SentinelOne",
    "Data Source: Microsoft Defender for Endpoint",
    "Data Source: Crowdstrike"
  ],
  "elastic_path": "rules/windows/credential_access_mimikatz_memssp_default_logs.toml",
  "raw_query": "file where host.os.type == \"windows\" and file.name : \"mimilsa.log\" and process.name : \"lsass.exe\"\n",
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "mimilsa.log"
      ],
      "raw_values": [
        "mimilsa.log"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "lsass.exe"
      ],
      "raw_values": [
        "lsass.exe"
      ]
    }
  ]
}