{
  "source": "elastic",
  "name": "Potential OpenSSH Backdoor Logging Activity",
  "slug": "credential_access_ssh_backdoor_log",
  "category": "file",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Tactic: Credential Access",
    "Data Source: Elastic Endgame",
    "Data Source: Elastic Defend",
    "Data Source: SentinelOne",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/credential_access_ssh_backdoor_log.toml",
  "raw_query": "file where host.os.type == \"linux\" and event.type == \"creation\" and process.name in (\"ssh\", \"sshd\") and\n  (\n    (\n      file.name : (\".*\", \"~*\", \"*~\") and not file.name : (\n        \".cache\", \".viminfo\", \".bash_history\", \".google_authenticator\", \".jelenv\", \".csvignore\", \".rtreport\", \".git*\"\n      )\n    ) or\n    file.extension : (\"in\", \"out\", \"ini\", \"h\", \"gz\", \"so\", \"sock\", \"sync\", \"0\", \"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\") or\n    file.path :\n    (\n      \"/tmp/*\",\n      \"/var/tmp/*\",\n      \"/dev/shm/*\",\n      \"/usr/share/*\",\n      \"/usr/include/*\",\n      \"/usr/local/include/*\",\n      \"/usr/share/man/*\",\n      \"/usr/local/share/*\",\n      \"/usr/lib/*.so.*\",\n      \"/usr/bin/ssd\",\n      \"/var/run/sshd/sshd.pid\",\n      \"/var/run/nscd/ns.pid\",\n      \"/var/run/udev/ud.pid\",\n      \"/var/run/udevd.pid\"\n    )\n  )\n",
  "conditions": [
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        ".cache",
        ".viminfo",
        ".bash_history",
        ".google_authenticator",
        ".jelenv",
        ".csvignore",
        ".rtreport",
        ".git"
      ],
      "raw_values": [
        ".*",
        "~*",
        "*~",
        ".cache",
        ".viminfo",
        ".bash_history",
        ".google_authenticator",
        ".jelenv",
        ".csvignore",
        ".rtreport",
        ".git*"
      ]
    },
    {
      "field": "file.extension",
      "raw_field": "file.extension",
      "operator": ":",
      "values": [
        "out",
        "ini",
        "sock",
        "sync"
      ],
      "raw_values": [
        "in",
        "out",
        "ini",
        "h",
        "gz",
        "so",
        "sock",
        "sync",
        "0",
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".so.",
        "ssd",
        "sshd.pid",
        "ns.pid",
        "ud.pid",
        "udevd.pid"
      ],
      "raw_values": [
        "/tmp/*",
        "/var/tmp/*",
        "/dev/shm/*",
        "/usr/share/*",
        "/usr/include/*",
        "/usr/local/include/*",
        "/usr/share/man/*",
        "/usr/local/share/*",
        "/usr/lib/*.so.*",
        "/usr/bin/ssd",
        "/var/run/sshd/sshd.pid",
        "/var/run/nscd/ns.pid",
        "/var/run/udev/ud.pid",
        "/var/run/udevd.pid"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "ssh",
        "sshd"
      ],
      "raw_values": [
        "ssh",
        "sshd"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "creation"
      ],
      "raw_values": [
        "creation"
      ]
    }
  ]
}