{
  "source": "elastic",
  "name": "Potential Evasion via Windows Filtering Platform",
  "slug": "defense_evasion_windows_filtering_platform",
  "category": "any",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Data Source: Elastic Defend",
    "Data Source: Windows Security Event Logs",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/windows/defense_evasion_windows_filtering_platform.toml",
  "raw_query": "sequence by winlog.computer_name with maxspan=1m\n [network where host.os.type == \"windows\" and\n  event.action : (\"windows-firewall-packet-block\", \"windows-firewall-packet-drop\") and\n  process.name : (\n        \"bdagent.exe\", \"bdreinit.exe\", \"pdscan.exe\", \"pdiface.exe\", \"BDSubWiz.exe\", \"ProductAgentService.exe\",\n        \"ProductAgentUI.exe\", \"WatchDog.exe\", \"CarbonBlackClientSetup.exe\", \"TrGUI.exe\", \"TracCAPI.exe\", \"cpmsi_tool.exe\",\n        \"trac.exe\", \"vna_install64.exe\", \"vna_utils.exe\", \"TracSrvWrapper.exe\", \"vsmon.exe\", \"p95tray.exe\",\n        \"CybereasonRansomFreeServiceHost.exe\", \"CrAmTray.exe\", \"minionhost.exe\", \"CybereasonSensor.exe\", \"CylanceUI.exe\",\n        \"CylanceProtectSetup.exe\", \"cylancesvc.exe\", \"cyupdate.exe\", \"elastic-agent.exe\", \"elastic-endpoint.exe\",\n        \"egui.exe\", \"minodlogin.exe\", \"emu-rep.exe\", \"emu_install.exe\", \"emu-cci.exe\", \"emu-gui.exe\", \"emu-uninstall.exe\",\n        \"ndep.exe\", \"spike.exe\", \"ecls.exe\", \"ecmd.exe\", \"ecomserver.exe\", \"eeclnt.exe\", \"eh64.exe\", \"EHttpSrv.exe\",\n        \"xagt.exe\", \"collectoragent.exe\", \"FSAEConfig.exe\", \"uninstalldcagent.exe\", \"rmon.exe\", \"fccomint.exe\",\n        \"fclanguageselector.exe\", \"fortifw.exe\", \"fcreg.exe\", \"fortitray.exe\", \"fcappdb.exe\", \"fcwizard.exe\", \"submitv.exe\",\n        \"av_task.exe\", \"fortiwf.exe\", \"fortiwadbd.exe\", \"fcauth.exe\", \"fcdblog.exe\", \"fcmgr.exe\", \"fortiwad.exe\",\n        \"fortiproxy.exe\", \"fortiscand.exe\", \"fortivpnst.exe\", \"ipsec.exe\", \"fcwscd7.exe\", \"fcasc.exe\", \"fchelper.exe\",\n        \"forticlient.exe\",\"fcwsc.exe\", \"FortiClient.exe\", \"fmon.exe\", \"FSSOMA.exe\", \"FCVbltScan.exe\", \"FortiESNAC.exe\",\n        \"EPCUserAvatar.exe\", \"FortiAvatar.exe\", \"FortiClient_Diagnostic_Tool.exe\", \"FortiSSLVPNdaemon.exe\", \"avp.exe\",\n        \"FCConfig.exe\", \"avpsus.exe\", \"klnagent.exe\", \"klnsacwsrv.exe\", \"kl_platf.exe\", \"stpass.exe\", \"klnagwds.exe\",\n        \"mbae.exe\", \"mbae64.exe\", \"mbae-svc.exe\", \"mbae-uninstaller.exe\", \"mbaeLoader32.exe\", \"mbaeloader64.exe\",\n        \"mbam-dor.exe\", \"mbamgui.exe\", \"mbamservice.exe\", \"mbamtrayctrl.exe\", \"mbampt.exe\", \"mbamscheduler.exe\",\n        \"Coreinst.exe\", \"mbae-setup.exe\", \"mcupdate.exe\", \"ProtectedModuleHost.exe\", \"ESConfigTool.exe\", \"FWInstCheck.exe\",\n        \"FwWindowsFirewallHandler.exe\", \"mfeesp.exe\", \"mfefw.exe\", \"mfeProvisionModeUtility.exe\", \"mfetp.exe\", \"avpui.exe\",\n        \"WscAVExe.exe\", \"mcshield.exe\", \"McChHost.exe\", \"mfewc.exe\", \"mfewch.exe\", \"mfewcui.exe\", \"fwinfo.exe\",\n        \"mfecanary.exe\", \"mfefire.exe\", \"mfehidin.exe\", \"mfemms.exe\", \"mfevtps.exe\", \"mmsinfo.exe\", \"vtpinfo.exe\",\n        \"MarSetup.exe\", \"mctray.exe\", \"masvc.exe\", \"macmnsvc.exe\", \"McAPExe.exe\", \"McPvTray.exe\", \"mcods.exe\",\n        \"mcuicnt.exe\", \"mcuihost.exe\", \"xtray.exe\", \"McpService.exe\", \"epefprtrainer.exe\", \"mfeffcoreservice.exe\",\n        \"MfeEpeSvc.exe\", \"qualysagent.exe\", \"QualysProxy.exe\", \"QualysAgentUI.exe\", \"SVRTgui.exe\", \"SVRTcli.exe\",\n        \"SVRTcli.exe\", \"SVRTgui.exe\", \"SCTCleanupService.exe\", \"SVRTservice.exe\", \"native.exe\", \"SCTBootTasks.exe\",\n        \"ALMon.exe\", \"SAA.exe\", \"SUMService.exe\", \"ssp.exe\", \"SCFService.exe\", \"SCFManager.exe\", \"spa.exe\", \"cabarc.exe\",\n        \"sargui.exe\", \"sntpservice.exe\", \"McsClient.exe\", \"McsAgent.exe\", \"McsHeartbeat.exe\", \"SAVAdminService.exe\",\n        \"sav32cli.exe\", \"ForceUpdateAlongSideSGN.exe\", \"SAVCleanupService.exe\", \"SavMain.exe\", \"SavProgress.exe\",\n        \"SavProxy.exe\", \"SavService.exe\", \"swc_service.exe\", \"swi_di.exe\", \"swi_service.exe\", \"swi_filter.exe\",\n        \"ALUpdate.exe\", \"SophosUpdate.exe\", \"ALsvc.exe\", \"SophosAlert.exe\", \"osCheck.exe\", \"N360Downloader.exe\",\n        \"InstWrap.exe\", \"symbos.exe\", \"nss.exe\", \"symcorpui.exe\", \"isPwdSvc.exe\", \"ccsvchst.exe\", \"ntrmv.exe\",\n        \"pccntmon.exe\", \"AosUImanager.exe\", \"NTRTScan.exe\", \"TMAS_OL.exe\", \"TMAS_OLImp.exe\", \"TMAS_OLSentry.exe\",\n        \"ufnavi.exe\", \"Clnrbin.exe\", \"vizorhtmldialog.exe\", \"pwmConsole.exe\", \"PwmSvc.exe\", \"coreServiceShell.exe\",\n        \"ds_agent.exe\", \"SfCtlCom.exe\", \"MBAMHelper.exe\", \"cb.exe\", \"smc.exe\", \"tda.exe\", \"xagtnotif.exe\", \"ekrn.exe\",\n        \"dsa.exe\", \"Notifier.exe\", \"rphcp.exe\", \"lc_sensor.exe\", \"CSFalconService.exe\", \"CSFalconController.exe\",\n        \"SenseSampleUploader.exe\", \"windefend.exe\", \"MSASCui.exe\", \"MSASCuiL.exe\", \"msmpeng.exe\", \"msmpsvc.exe\",\n        \"MsSense.exe\", \"esensor.exe\", \"sentinelone.exe\", \"tmccsf.exe\", \"csfalconcontainer.exe\", \"sensecncproxy.exe\",\n        \"splunk.exe\", \"sysmon.exe\", \"sysmon64.exe\", \"taniumclient.exe\"\n    )] with runs=5\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": ":",
      "values": [
        "windows-firewall-packet-block",
        "windows-firewall-packet-drop"
      ],
      "raw_values": [
        "windows-firewall-packet-block",
        "windows-firewall-packet-drop"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "bdagent.exe",
        "bdreinit.exe",
        "pdscan.exe",
        "pdiface.exe",
        "bdsubwiz.exe",
        "productagentservice.exe",
        "productagentui.exe",
        "watchdog.exe",
        "carbonblackclientsetup.exe",
        "trgui.exe",
        "traccapi.exe",
        "cpmsi_tool.exe",
        "trac.exe",
        "vna_install64.exe",
        "vna_utils.exe",
        "tracsrvwrapper.exe",
        "vsmon.exe",
        "p95tray.exe",
        "cybereasonransomfreeservicehost.exe",
        "cramtray.exe",
        "minionhost.exe",
        "cybereasonsensor.exe",
        "cylanceui.exe",
        "cylanceprotectsetup.exe",
        "cylancesvc.exe",
        "cyupdate.exe",
        "elastic-agent.exe",
        "elastic-endpoint.exe",
        "egui.exe",
        "minodlogin.exe",
        "emu-rep.exe",
        "emu_install.exe",
        "emu-cci.exe",
        "emu-gui.exe",
        "emu-uninstall.exe",
        "ndep.exe",
        "spike.exe",
        "ecls.exe",
        "ecmd.exe",
        "ecomserver.exe",
        "eeclnt.exe",
        "eh64.exe",
        "ehttpsrv.exe",
        "xagt.exe",
        "collectoragent.exe",
        "fsaeconfig.exe",
        "uninstalldcagent.exe",
        "rmon.exe",
        "fccomint.exe",
        "fclanguageselector.exe",
        "fortifw.exe",
        "fcreg.exe",
        "fortitray.exe",
        "fcappdb.exe",
        "fcwizard.exe",
        "submitv.exe",
        "av_task.exe",
        "fortiwf.exe",
        "fortiwadbd.exe",
        "fcauth.exe",
        "fcdblog.exe",
        "fcmgr.exe",
        "fortiwad.exe",
        "fortiproxy.exe",
        "fortiscand.exe",
        "fortivpnst.exe",
        "ipsec.exe",
        "fcwscd7.exe",
        "fcasc.exe",
        "fchelper.exe",
        "forticlient.exe",
        "fcwsc.exe",
        "fmon.exe",
        "fssoma.exe",
        "fcvbltscan.exe",
        "fortiesnac.exe",
        "epcuseravatar.exe",
        "fortiavatar.exe",
        "forticlient_diagnostic_tool.exe",
        "fortisslvpndaemon.exe",
        "avp.exe",
        "fcconfig.exe",
        "avpsus.exe",
        "klnagent.exe",
        "klnsacwsrv.exe",
        "kl_platf.exe",
        "stpass.exe",
        "klnagwds.exe",
        "mbae.exe",
        "mbae64.exe",
        "mbae-svc.exe",
        "mbae-uninstaller.exe",
        "mbaeloader32.exe",
        "mbaeloader64.exe",
        "mbam-dor.exe",
        "mbamgui.exe",
        "mbamservice.exe",
        "mbamtrayctrl.exe",
        "mbampt.exe",
        "mbamscheduler.exe",
        "coreinst.exe",
        "mbae-setup.exe",
        "mcupdate.exe",
        "protectedmodulehost.exe",
        "esconfigtool.exe",
        "fwinstcheck.exe",
        "fwwindowsfirewallhandler.exe",
        "mfeesp.exe",
        "mfefw.exe",
        "mfeprovisionmodeutility.exe",
        "mfetp.exe",
        "avpui.exe",
        "wscavexe.exe",
        "mcshield.exe",
        "mcchhost.exe",
        "mfewc.exe",
        "mfewch.exe",
        "mfewcui.exe",
        "fwinfo.exe",
        "mfecanary.exe",
        "mfefire.exe",
        "mfehidin.exe",
        "mfemms.exe",
        "mfevtps.exe",
        "mmsinfo.exe",
        "vtpinfo.exe",
        "marsetup.exe",
        "mctray.exe",
        "masvc.exe",
        "macmnsvc.exe",
        "mcapexe.exe",
        "mcpvtray.exe",
        "mcods.exe",
        "mcuicnt.exe",
        "mcuihost.exe",
        "xtray.exe",
        "mcpservice.exe",
        "epefprtrainer.exe",
        "mfeffcoreservice.exe",
        "mfeepesvc.exe",
        "qualysagent.exe",
        "qualysproxy.exe",
        "qualysagentui.exe",
        "svrtgui.exe",
        "svrtcli.exe",
        "sctcleanupservice.exe",
        "svrtservice.exe",
        "native.exe",
        "sctboottasks.exe",
        "almon.exe",
        "saa.exe",
        "sumservice.exe",
        "ssp.exe",
        "scfservice.exe",
        "scfmanager.exe",
        "spa.exe",
        "cabarc.exe",
        "sargui.exe",
        "sntpservice.exe",
        "mcsclient.exe",
        "mcsagent.exe",
        "mcsheartbeat.exe",
        "savadminservice.exe",
        "sav32cli.exe",
        "forceupdatealongsidesgn.exe",
        "savcleanupservice.exe",
        "savmain.exe",
        "savprogress.exe",
        "savproxy.exe",
        "savservice.exe",
        "swc_service.exe",
        "swi_di.exe",
        "swi_service.exe",
        "swi_filter.exe",
        "alupdate.exe",
        "sophosupdate.exe",
        "alsvc.exe",
        "sophosalert.exe",
        "oscheck.exe",
        "n360downloader.exe",
        "instwrap.exe",
        "symbos.exe",
        "nss.exe",
        "symcorpui.exe",
        "ispwdsvc.exe",
        "ccsvchst.exe",
        "ntrmv.exe",
        "pccntmon.exe",
        "aosuimanager.exe",
        "ntrtscan.exe",
        "tmas_ol.exe",
        "tmas_olimp.exe",
        "tmas_olsentry.exe",
        "ufnavi.exe",
        "clnrbin.exe",
        "vizorhtmldialog.exe",
        "pwmconsole.exe",
        "pwmsvc.exe",
        "coreserviceshell.exe",
        "ds_agent.exe",
        "sfctlcom.exe",
        "mbamhelper.exe",
        "cb.exe",
        "smc.exe",
        "tda.exe",
        "xagtnotif.exe",
        "ekrn.exe",
        "dsa.exe",
        "notifier.exe",
        "rphcp.exe",
        "lc_sensor.exe",
        "csfalconservice.exe",
        "csfalconcontroller.exe",
        "sensesampleuploader.exe",
        "windefend.exe",
        "msascui.exe",
        "msascuil.exe",
        "msmpeng.exe",
        "msmpsvc.exe",
        "mssense.exe",
        "esensor.exe",
        "sentinelone.exe",
        "tmccsf.exe",
        "csfalconcontainer.exe",
        "sensecncproxy.exe",
        "splunk.exe",
        "sysmon.exe",
        "sysmon64.exe",
        "taniumclient.exe"
      ],
      "raw_values": [
        "bdagent.exe",
        "bdreinit.exe",
        "pdscan.exe",
        "pdiface.exe",
        "BDSubWiz.exe",
        "ProductAgentService.exe",
        "ProductAgentUI.exe",
        "WatchDog.exe",
        "CarbonBlackClientSetup.exe",
        "TrGUI.exe",
        "TracCAPI.exe",
        "cpmsi_tool.exe",
        "trac.exe",
        "vna_install64.exe",
        "vna_utils.exe",
        "TracSrvWrapper.exe",
        "vsmon.exe",
        "p95tray.exe",
        "CybereasonRansomFreeServiceHost.exe",
        "CrAmTray.exe",
        "minionhost.exe",
        "CybereasonSensor.exe",
        "CylanceUI.exe",
        "CylanceProtectSetup.exe",
        "cylancesvc.exe",
        "cyupdate.exe",
        "elastic-agent.exe",
        "elastic-endpoint.exe",
        "egui.exe",
        "minodlogin.exe",
        "emu-rep.exe",
        "emu_install.exe",
        "emu-cci.exe",
        "emu-gui.exe",
        "emu-uninstall.exe",
        "ndep.exe",
        "spike.exe",
        "ecls.exe",
        "ecmd.exe",
        "ecomserver.exe",
        "eeclnt.exe",
        "eh64.exe",
        "EHttpSrv.exe",
        "xagt.exe",
        "collectoragent.exe",
        "FSAEConfig.exe",
        "uninstalldcagent.exe",
        "rmon.exe",
        "fccomint.exe",
        "fclanguageselector.exe",
        "fortifw.exe",
        "fcreg.exe",
        "fortitray.exe",
        "fcappdb.exe",
        "fcwizard.exe",
        "submitv.exe",
        "av_task.exe",
        "fortiwf.exe",
        "fortiwadbd.exe",
        "fcauth.exe",
        "fcdblog.exe",
        "fcmgr.exe",
        "fortiwad.exe",
        "fortiproxy.exe",
        "fortiscand.exe",
        "fortivpnst.exe",
        "ipsec.exe",
        "fcwscd7.exe",
        "fcasc.exe",
        "fchelper.exe",
        "forticlient.exe",
        "fcwsc.exe",
        "FortiClient.exe",
        "fmon.exe",
        "FSSOMA.exe",
        "FCVbltScan.exe",
        "FortiESNAC.exe",
        "EPCUserAvatar.exe",
        "FortiAvatar.exe",
        "FortiClient_Diagnostic_Tool.exe",
        "FortiSSLVPNdaemon.exe",
        "avp.exe",
        "FCConfig.exe",
        "avpsus.exe",
        "klnagent.exe",
        "klnsacwsrv.exe",
        "kl_platf.exe",
        "stpass.exe",
        "klnagwds.exe",
        "mbae.exe",
        "mbae64.exe",
        "mbae-svc.exe",
        "mbae-uninstaller.exe",
        "mbaeLoader32.exe",
        "mbaeloader64.exe",
        "mbam-dor.exe",
        "mbamgui.exe",
        "mbamservice.exe",
        "mbamtrayctrl.exe",
        "mbampt.exe",
        "mbamscheduler.exe",
        "Coreinst.exe",
        "mbae-setup.exe",
        "mcupdate.exe",
        "ProtectedModuleHost.exe",
        "ESConfigTool.exe",
        "FWInstCheck.exe",
        "FwWindowsFirewallHandler.exe",
        "mfeesp.exe",
        "mfefw.exe",
        "mfeProvisionModeUtility.exe",
        "mfetp.exe",
        "avpui.exe",
        "WscAVExe.exe",
        "mcshield.exe",
        "McChHost.exe",
        "mfewc.exe",
        "mfewch.exe",
        "mfewcui.exe",
        "fwinfo.exe",
        "mfecanary.exe",
        "mfefire.exe",
        "mfehidin.exe",
        "mfemms.exe",
        "mfevtps.exe",
        "mmsinfo.exe",
        "vtpinfo.exe",
        "MarSetup.exe",
        "mctray.exe",
        "masvc.exe",
        "macmnsvc.exe",
        "McAPExe.exe",
        "McPvTray.exe",
        "mcods.exe",
        "mcuicnt.exe",
        "mcuihost.exe",
        "xtray.exe",
        "McpService.exe",
        "epefprtrainer.exe",
        "mfeffcoreservice.exe",
        "MfeEpeSvc.exe",
        "qualysagent.exe",
        "QualysProxy.exe",
        "QualysAgentUI.exe",
        "SVRTgui.exe",
        "SVRTcli.exe",
        "SCTCleanupService.exe",
        "SVRTservice.exe",
        "native.exe",
        "SCTBootTasks.exe",
        "ALMon.exe",
        "SAA.exe",
        "SUMService.exe",
        "ssp.exe",
        "SCFService.exe",
        "SCFManager.exe",
        "spa.exe",
        "cabarc.exe",
        "sargui.exe",
        "sntpservice.exe",
        "McsClient.exe",
        "McsAgent.exe",
        "McsHeartbeat.exe",
        "SAVAdminService.exe",
        "sav32cli.exe",
        "ForceUpdateAlongSideSGN.exe",
        "SAVCleanupService.exe",
        "SavMain.exe",
        "SavProgress.exe",
        "SavProxy.exe",
        "SavService.exe",
        "swc_service.exe",
        "swi_di.exe",
        "swi_service.exe",
        "swi_filter.exe",
        "ALUpdate.exe",
        "SophosUpdate.exe",
        "ALsvc.exe",
        "SophosAlert.exe",
        "osCheck.exe",
        "N360Downloader.exe",
        "InstWrap.exe",
        "symbos.exe",
        "nss.exe",
        "symcorpui.exe",
        "isPwdSvc.exe",
        "ccsvchst.exe",
        "ntrmv.exe",
        "pccntmon.exe",
        "AosUImanager.exe",
        "NTRTScan.exe",
        "TMAS_OL.exe",
        "TMAS_OLImp.exe",
        "TMAS_OLSentry.exe",
        "ufnavi.exe",
        "Clnrbin.exe",
        "vizorhtmldialog.exe",
        "pwmConsole.exe",
        "PwmSvc.exe",
        "coreServiceShell.exe",
        "ds_agent.exe",
        "SfCtlCom.exe",
        "MBAMHelper.exe",
        "cb.exe",
        "smc.exe",
        "tda.exe",
        "xagtnotif.exe",
        "ekrn.exe",
        "dsa.exe",
        "Notifier.exe",
        "rphcp.exe",
        "lc_sensor.exe",
        "CSFalconService.exe",
        "CSFalconController.exe",
        "SenseSampleUploader.exe",
        "windefend.exe",
        "MSASCui.exe",
        "MSASCuiL.exe",
        "msmpeng.exe",
        "msmpsvc.exe",
        "MsSense.exe",
        "esensor.exe",
        "sentinelone.exe",
        "tmccsf.exe",
        "csfalconcontainer.exe",
        "sensecncproxy.exe",
        "splunk.exe",
        "sysmon.exe",
        "sysmon64.exe",
        "taniumclient.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    }
  ]
}