{
  "source": "elastic",
  "name": "Data Encrypted via OpenSSL Utility",
  "slug": "defense_evasion_data_encrypted_via_openssl",
  "category": "process",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "OS: Windows",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Tactic: Collection",
    "Data Source: Elastic Defend",
    "Data Source: Elastic Endgame",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne",
    "Data Source: Auditd Manager",
    "Data Source: Windows Security Event Logs",
    "Data Source: Sysmon",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/cross-platform/defense_evasion_data_encrypted_via_openssl.toml",
  "raw_query": "process where event.type == \"start\" and event.action in (\"start\", \"exec\", \"executed\", \"exec_event\", \"ProcessRollup2\") and\nprocess.name : \"openssl*\" and process.args : \"enc\" and process.args : \"-in\" and process.args : \"-out\"\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "start",
        "exec",
        "executed",
        "exec_event",
        "processrollup2"
      ],
      "raw_values": [
        "start",
        "exec",
        "executed",
        "exec_event",
        "ProcessRollup2"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "openssl"
      ],
      "raw_values": [
        "openssl*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "enc",
        "-in",
        "-out"
      ],
      "raw_values": [
        "enc",
        "-in",
        "-out"
      ]
    }
  ]
}