{
  "source": "elastic",
  "name": "Unusual Kill Signal",
  "slug": "defense_evasion_unsual_kill_signal",
  "category": "process",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Data Source: Auditd Manager",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/defense_evasion_unsual_kill_signal.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.action == \"killed-pid\" and auditd.data.syscall == \"kill\" and\nauditd.data.a1 in (\n  \"21\", \"22\", \"23\", \"24\", \"25\", \"26\", \"27\", \"28\", \"29\", \"2a\", \"2b\", \"2c\", \"2d\", \"2e\", \"2f\", \"30\",\n  \"31\", \"32\", \"33\", \"34\", \"35\", \"36\", \"37\", \"38\", \"39\", \"3a\", \"3b\", \"3c\", \"3d\", \"3e\", \"3f\", \"40\",\n  \"41\", \"42\", \"43\", \"44\", \"45\", \"46\", \"47\"\n)\n",
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "killed-pid"
      ],
      "raw_values": [
        "killed-pid"
      ]
    },
    {
      "field": "auditd.data.syscall",
      "raw_field": "auditd.data.syscall",
      "operator": "==",
      "values": [
        "kill"
      ],
      "raw_values": [
        "kill"
      ]
    }
  ]
}