{
  "source": "elastic",
  "name": "PowerShell Obfuscation via Negative Index String Reversal",
  "slug": "defense_evasion_posh_obfuscation_index_reversal",
  "category": "any",
  "language": "esql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Data Source: PowerShell Logs",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/windows/defense_evasion_posh_obfuscation_index_reversal.toml",
  "raw_query": "from logs-windows.powershell_operational* metadata _id, _version, _index\n| where event.code == \"4104\"\n\n// Filter out smaller scripts that are unlikely to implement obfuscation using the patterns we are looking for\n| eval Esql.script_block_length = length(powershell.file.script_block_text)\n| where Esql.script_block_length > 500\n\n// replace the patterns we are looking for with the \ud83d\udd25 emoji to enable counting them\n// The emoji is used because it's unlikely to appear in scripts and has a consistent character length of 1\n| eval Esql.script_block_tmp = replace(\n    powershell.file.script_block_text,\n    \"\"\"\\$\\w+\\[\\-\\s?1\\.\\.\"\"\",\n    \"\ud83d\udd25\"\n)\n\n// count how many patterns were detected by calculating the number of \ud83d\udd25 characters inserted\n| eval Esql.script_block_pattern_count = length(Esql.script_block_tmp) - length(replace(Esql.script_block_tmp, \"\ud83d\udd25\", \"\"))\n\n// keep the fields relevant to the query, although this is not needed as the alert is populated using _id\n| keep\n    Esql.script_block_pattern_count,\n    Esql.script_block_length,\n    Esql.script_block_tmp,\n    powershell.file.*,\n    file.name,\n    file.path,\n    powershell.sequence,\n    powershell.total,\n    _id,\n    _version,\n    _index,\n    host.name,\n    host.id,\n    agent.id,\n    user.id\n\n// Filter for scripts that match the pattern at least once\n| where Esql.script_block_pattern_count >= 1\n\n// FP Patterns\n| where not powershell.file.script_block_text like \"*GENESIS-5654*\"\n\n| where file.name not like (\"PSFzf.psm1\", \"Tenable_API_AssetLists_IPv6Seeder.ps1\", \"Utility.ps1\")\n  // ESQL requires this condition, otherwise it only returns matches where file.name exists.\n  or file.name is null\n",
  "conditions": [
    {
      "field": "not",
      "raw_field": "not",
      "operator": ":",
      "values": [
        "psfzf.psm1",
        "tenable_api_assetlists_ipv6seeder.ps1",
        "utility.ps1"
      ],
      "raw_values": [
        "PSFzf.psm1",
        "Tenable_API_AssetLists_IPv6Seeder.ps1",
        "Utility.ps1"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "4104"
      ],
      "raw_values": [
        "4104"
      ]
    },
    {
      "field": "powershell.file.script_block_text",
      "raw_field": "powershell.file.script_block_text",
      "operator": "like",
      "values": [
        "genesis-5654"
      ],
      "raw_values": [
        "*GENESIS-5654*"
      ]
    }
  ]
}