{
  "source": "elastic",
  "name": "GitHub Exfiltration via High Number of Repository Clones by User",
  "slug": "exfiltration_high_number_of_cloning_by_user",
  "category": "any",
  "language": "esql",
  "risk_score": 47,
  "tags": [
    "Domain: Cloud",
    "Use Case: Threat Detection",
    "Tactic: Exfiltration",
    "Data Source: Github",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/integrations/github/exfiltration_high_number_of_cloning_by_user.toml",
  "raw_query": "from logs-github.audit-* metadata _id, _index, _version\n| where\n  data_stream.dataset == \"github.audit\" and event.type == \"change\" and event.action == \"git.clone\"\n| stats\n  Esql.event_count = COUNT(*),\n  Esql.github_org_values = values(github.org),\n  Esql.github_repo_values = values(github.repo),\n  Esql.github_repository_public_values = values(github.repository_public),\n  Esql.github_token_id_values = values(github.token_id),\n  Esql.github_user_agent_values = values(github.user_agent),\n  Esql.user_name_values = values(user.name),\n  Esql.agent_id_values = values(agent.id),\n  Esql.data_stream_dataset_values = values(data_stream.dataset),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n\n  by user.name\n\n| keep Esql.*\n\n| where\n  Esql.event_count >= 25\n",
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "github.audit"
      ],
      "raw_values": [
        "github.audit"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change"
      ],
      "raw_values": [
        "change"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "git.clone"
      ],
      "raw_values": [
        "git.clone"
      ]
    }
  ]
}