{
  "source": "elastic",
  "name": "Potential Data Exfiltration Through Wget",
  "slug": "exfiltration_potential_wget_data_exfiltration",
  "category": "process",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Exfiltration",
    "Data Source: Auditd Manager",
    "Data Source: Elastic Defend",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne",
    "Data Source: Elastic Endgame",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/exfiltration_potential_wget_data_exfiltration.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\", \"process_started\") and\nprocess.name == \"wget\" and ?process.parent.executable != null and (\n  process.args like (\"--post-file*\", \"--post-data*\", \"--body-file*\") or\n  (\n    process.command_line like (\"*cat*\", \"*base64*\") and\n    process.command_line like (\n      \"*/etc/passwd*\", \"*/etc/shadow*\", \"*~/.ssh/*\", \"*.env*\", \"*credentials*\", \"*/tmp/*\",\n      \"*/var/tmp/*\", \"*/dev/shm/*\", \"*/home/*/*\", \"*/root/*\"\n    )\n  )\n) and\n(\n  process.command_line like (\"*http:*\", \"*https:*\") or\n  process.command_line regex \".*[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}.*\"\n)\n",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "--post-file",
        "--post-data",
        "--body-file",
        "cat",
        "base64",
        "passwd",
        "shadow",
        ".env",
        "credentials",
        "http:",
        "https:"
      ],
      "raw_values": [
        "--post-file*",
        "--post-data*",
        "--body-file*",
        "*cat*",
        "*base64*",
        "*/etc/passwd*",
        "*/etc/shadow*",
        "*~/.ssh/*",
        "*.env*",
        "*credentials*",
        "*/tmp/*",
        "*/var/tmp/*",
        "*/dev/shm/*",
        "*/home/*/*",
        "*/root/*",
        "*http:*",
        "*https:*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "wget"
      ],
      "raw_values": [
        "wget"
      ]
    }
  ]
}