{
  "source": "elastic",
  "name": "Potential Data Exfiltration Through Curl",
  "slug": "exfiltration_potential_curl_data_exfiltration",
  "category": "process",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "OS: Windows",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Exfiltration",
    "Resources: Investigation Guide",
    "Data Source: Elastic Defend",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne",
    "Data Source: Sysmon",
    "Data Source: Auditd Manager",
    "Data Source: Windows Security Event Logs"
  ],
  "elastic_path": "rules/cross-platform/exfiltration_potential_curl_data_exfiltration.toml",
  "raw_query": "process where event.type == \"start\" and \nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\", \"process_started\") and\nprocess.name : (\"curl\", \"curl.exe\") and \n(\n  process.args in (\"-T\", \"--upload-file\") or\n  (\n    (process.args in (\"-F\", \"-d\", \"--form\") or process.args like \"--data*\") and process.command_line like \"*@*\"\n  )\n) and\n(\n  process.command_line like (\"*http:*\", \"*https:*\", \"*ftp:*\", \"*ftps:*\") or\n  process.command_line regex \".*[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}.*\"\n) and \nnot process.args : (\"https://*/ap/fleet/*\", \"https://*/api/saved_objects/*\", \"http*localhost:*\", \"http*127.0.0.*\", \"*ApiKey*\", \"http*.us-central1.run.app/*\", \"*Authorization*\", \"*session.id*\", \"http*.elastic-cloud.com*\", \"http*.elastic.dev*\", \"http*.elastic.cloud*\", \"http*.aws.found.io*\", \"http*.gcp.cloud.es.io*\", \"http*.cisco.com/api/*\", \"-u\", \"http://192.168*\")\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "curl",
        "curl.exe"
      ],
      "raw_values": [
        "curl",
        "curl.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "http:",
        "https:",
        "ftp:",
        "ftps:",
        "http*localhost:",
        "http*127.0.0.",
        "apikey",
        "authorization",
        "session.id",
        "http*.elastic-cloud.com",
        "http*.elastic.dev",
        "http*.elastic.cloud",
        "http*.aws.found.io",
        "http*.gcp.cloud.es.io",
        "192.168"
      ],
      "raw_values": [
        "*http:*",
        "*https:*",
        "*ftp:*",
        "*ftps:*",
        "https://*/ap/fleet/*",
        "https://*/api/saved_objects/*",
        "http*localhost:*",
        "http*127.0.0.*",
        "*ApiKey*",
        "http*.us-central1.run.app/*",
        "*Authorization*",
        "*session.id*",
        "http*.elastic-cloud.com*",
        "http*.elastic.dev*",
        "http*.elastic.cloud*",
        "http*.aws.found.io*",
        "http*.gcp.cloud.es.io*",
        "http*.cisco.com/api/*",
        "-u",
        "http://192.168*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "--upload-file",
        "--form"
      ],
      "raw_values": [
        "-T",
        "--upload-file",
        "-F",
        "-d",
        "--form"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like",
      "values": [
        "--data"
      ],
      "raw_values": [
        "--data*",
        "*@*"
      ]
    }
  ]
}