{
  "source": "elastic",
  "name": "Kernel Driver Load",
  "slug": "persistence_kernel_driver_load",
  "category": "driver",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Data Source: Auditd Manager",
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Tactic: Defense Evasion",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/persistence_kernel_driver_load.toml",
  "raw_query": "driver where host.os.type == \"linux\" and event.action == \"loaded-kernel-module\" and\nauditd.data.syscall in (\"init_module\", \"finit_module\")\n",
  "conditions": [
    {
      "field": "auditd.data.syscall",
      "raw_field": "auditd.data.syscall",
      "operator": "in",
      "values": [
        "init_module",
        "finit_module"
      ],
      "raw_values": [
        "init_module",
        "finit_module"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "loaded-kernel-module"
      ],
      "raw_values": [
        "loaded-kernel-module"
      ]
    }
  ]
}