{
  "source": "elastic",
  "name": "Linux User Added to Privileged Group",
  "slug": "persistence_linux_user_added_to_privileged_group",
  "category": "process",
  "language": "eql",
  "risk_score": 21,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Data Source: Elastic Endgame",
    "Resources: Investigation Guide",
    "Data Source: Elastic Defend",
    "Data Source: Auditd Manager",
    "Data Source: Crowdstrike",
    "Data Source: SentinelOne"
  ],
  "elastic_path": "rules/linux/persistence_linux_user_added_to_privileged_group.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\", \"process_started\") and\nprocess.executable != null and process.args in (\n  \"root\", \"admin\", \"wheel\", \"staff\", \"sudo\",\"disk\", \"video\", \"shadow\", \"lxc\", \"lxd\"\n) and\n(\n  process.name in (\"usermod\", \"adduser\") or\n  (process.name == \"gpasswd\" and process.args in (\"-a\", \"--add\", \"-M\", \"--members\"))\n)\n",
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "root",
        "admin",
        "wheel",
        "staff",
        "sudo",
        "disk",
        "video",
        "shadow",
        "lxc",
        "lxd",
        "--add",
        "--members"
      ],
      "raw_values": [
        "root",
        "admin",
        "wheel",
        "staff",
        "sudo",
        "disk",
        "video",
        "shadow",
        "lxc",
        "lxd",
        "-a",
        "--add",
        "-M",
        "--members"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "usermod",
        "adduser"
      ],
      "raw_values": [
        "usermod",
        "adduser"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "gpasswd"
      ],
      "raw_values": [
        "gpasswd"
      ]
    }
  ]
}