{
  "source": "elastic",
  "name": "Message-of-the-Day (MOTD) File Creation",
  "slug": "persistence_message_of_the_day_creation",
  "category": "file",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Persistence",
    "Resources: Investigation Guide",
    "Data Source: Elastic Defend"
  ],
  "elastic_path": "rules/linux/persistence_message_of_the_day_creation.toml",
  "raw_query": "file where host.os.type == \"linux\" and event.action == \"creation\" and file.path like \"/etc/update-motd.d/*\" and\nnot (\n  process.executable in (\n    \"/bin/dpkg\", \"/usr/bin/dpkg\", \"/bin/dockerd\", \"/usr/bin/dockerd\", \"/usr/sbin/dockerd\", \"/bin/microdnf\",\n    \"/usr/bin/microdnf\", \"/bin/rpm\", \"/usr/bin/rpm\", \"/bin/snapd\", \"/usr/bin/snapd\", \"/bin/yum\", \"/usr/bin/yum\",\n    \"/bin/dnf\", \"/usr/bin/dnf\", \"/bin/podman\", \"/usr/bin/podman\", \"/bin/dnf-automatic\", \"/usr/bin/dnf-automatic\",\n    \"/bin/pacman\", \"/usr/bin/pacman\", \"/usr/bin/dpkg-divert\", \"/bin/dpkg-divert\", \"/sbin/apk\", \"/usr/sbin/apk\",\n    \"/usr/local/sbin/apk\", \"/usr/bin/apt\", \"/usr/sbin/pacman\", \"/bin/podman\", \"/usr/bin/podman\", \"/usr/bin/puppet\",\n    \"/bin/puppet\", \"/opt/puppetlabs/puppet/bin/puppet\", \"/usr/bin/chef-client\", \"/bin/chef-client\", \"/usr/bin/buildah\",\n    \"/bin/autossl_check\", \"/usr/bin/autossl_check\", \"/proc/self/exe\", \"/usr/bin/pamac-daemon\", \"/.envbuilder/bin/envbuilder\",\n    \"/bin/pamac-daemon\", \"/usr/lib/snapd/snapd\", \"/usr/local/bin/dockerd\", \"./usr/bin/podman\", \"/opt/saltstack/salt/bin/python3.10\",\n    \"/opt/puppetlabs/puppet/bin/ruby\", \"/usr/bin/crio\"\n  ) or\n  file.extension in (\"swp\", \"swpx\", \"swx\", \"dpkg-remove\") or\n  file.Ext.original.extension == \"dpkg-new\" or\n  process.executable : (\n    \"/nix/store/*\", \"/var/lib/dpkg/*\", \"/tmp/vmis.*\", \"/snap/*\", \"/dev/fd/*\", \"/usr/lib/virtualbox/*\"\n  ) or\n  process.executable == null or\n  process.name in (\"executor\", \"dockerd\", \"crio\") or\n  (process.name == \"sed\" and file.name : \"sed*\") or\n  (process.name == \"perl\" and file.name : \"e2scrub_all.tmp*\")\n)\n",
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vmis."
      ],
      "raw_values": [
        "/nix/store/*",
        "/var/lib/dpkg/*",
        "/tmp/vmis.*",
        "/snap/*",
        "/dev/fd/*",
        "/usr/lib/virtualbox/*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "in",
      "values": [
        "dpkg",
        "dockerd",
        "microdnf",
        "rpm",
        "snapd",
        "yum",
        "dnf",
        "podman",
        "dnf-automatic",
        "pacman",
        "dpkg-divert",
        "apk",
        "apt",
        "puppet",
        "chef-client",
        "buildah",
        "autossl_check",
        "exe",
        "pamac-daemon",
        "envbuilder",
        "python3.10",
        "ruby",
        "crio",
        "executor"
      ],
      "raw_values": [
        "/bin/dpkg",
        "/usr/bin/dpkg",
        "/bin/dockerd",
        "/usr/bin/dockerd",
        "/usr/sbin/dockerd",
        "/bin/microdnf",
        "/usr/bin/microdnf",
        "/bin/rpm",
        "/usr/bin/rpm",
        "/bin/snapd",
        "/usr/bin/snapd",
        "/bin/yum",
        "/usr/bin/yum",
        "/bin/dnf",
        "/usr/bin/dnf",
        "/bin/podman",
        "/usr/bin/podman",
        "/bin/dnf-automatic",
        "/usr/bin/dnf-automatic",
        "/bin/pacman",
        "/usr/bin/pacman",
        "/usr/bin/dpkg-divert",
        "/bin/dpkg-divert",
        "/sbin/apk",
        "/usr/sbin/apk",
        "/usr/local/sbin/apk",
        "/usr/bin/apt",
        "/usr/sbin/pacman",
        "/usr/bin/puppet",
        "/bin/puppet",
        "/opt/puppetlabs/puppet/bin/puppet",
        "/usr/bin/chef-client",
        "/bin/chef-client",
        "/usr/bin/buildah",
        "/bin/autossl_check",
        "/usr/bin/autossl_check",
        "/proc/self/exe",
        "/usr/bin/pamac-daemon",
        "/.envbuilder/bin/envbuilder",
        "/bin/pamac-daemon",
        "/usr/lib/snapd/snapd",
        "/usr/local/bin/dockerd",
        "./usr/bin/podman",
        "/opt/saltstack/salt/bin/python3.10",
        "/opt/puppetlabs/puppet/bin/ruby",
        "/usr/bin/crio",
        "executor",
        "dockerd",
        "crio"
      ]
    },
    {
      "field": "file.extension",
      "raw_field": "file.extension",
      "operator": "in",
      "values": [
        "swp",
        "swpx",
        "swx",
        "dpkg-remove"
      ],
      "raw_values": [
        "swp",
        "swpx",
        "swx",
        "dpkg-remove"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "creation"
      ],
      "raw_values": [
        "creation"
      ]
    },
    {
      "field": "file.ext.original.extension",
      "raw_field": "file.Ext.original.extension",
      "operator": "==",
      "values": [
        "dpkg-new"
      ],
      "raw_values": [
        "dpkg-new"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sed",
        "perl"
      ],
      "raw_values": [
        "sed",
        "perl"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "sed",
        "e2scrub_all.tmp"
      ],
      "raw_values": [
        "sed*",
        "e2scrub_all.tmp*"
      ]
    }
  ]
}