{
  "source": "elastic",
  "name": "Potential notify_on_release Container Escape Detected via Defend for Containers",
  "slug": "privilege_escalation_potential_container_escape_via_modified_notify_on_release_file",
  "category": "file",
  "language": "eql",
  "risk_score": 47,
  "tags": [
    "Data Source: Elastic Defend for Containers",
    "Domain: Container",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/integrations/cloud_defend/privilege_escalation_potential_container_escape_via_modified_notify_on_release_file.toml",
  "raw_query": "file where host.os.type == \"linux\" and event.type == \"change\" and event.action == \"open\" and\nfile.name == \"notify_on_release\" and process.interactive == true and container.id like \"*\"\n",
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change"
      ],
      "raw_values": [
        "change"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "open"
      ],
      "raw_values": [
        "open"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": "==",
      "values": [
        "notify_on_release"
      ],
      "raw_values": [
        "notify_on_release"
      ]
    }
  ]
}