{
  "source": "elastic",
  "name": "Potential CVE-2025-32463 Sudo Chroot Execution Attempt",
  "slug": "privilege_escalation_cve_2025_32463_sudo_chroot_execution",
  "category": "process",
  "language": "eql",
  "risk_score": 73,
  "tags": [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Data Source: Elastic Defend",
    "Data Source: SentinelOne",
    "Data Source: Crowdstrike",
    "Data Source: Elastic Endgame",
    "Data Source: Auditd Manager",
    "Use Case: Vulnerability",
    "Resources: Investigation Guide"
  ],
  "elastic_path": "rules/linux/privilege_escalation_cve_2025_32463_sudo_chroot_execution.toml",
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"executed\", \"process_started\", \"ProcessRollup2\") and\nprocess.name == \"sudo\" and process.args like (\"-R\", \"--chroot*\") and\n// To enforce the -R and --chroot arguments to be for sudo specifically, while wildcarding potential full sudo paths\nprocess.command_line like (\"*sudo -R*\", \"*sudo --chroot*\") \n",
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "--chroot",
        "sudo -r",
        "sudo --chroot"
      ],
      "raw_values": [
        "-R",
        "--chroot*",
        "*sudo -R*",
        "*sudo --chroot*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "executed",
        "process_started",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "executed",
        "process_started",
        "ProcessRollup2"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sudo"
      ],
      "raw_values": [
        "sudo"
      ]
    }
  ]
}