{
  "id": "03fc4cd6-da1e-5c9d-8212-f541450f1ce9",
  "catalog": "elastic",
  "name": "Python Site or User Customize File Creation",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.persistence",
    "attack.execution",
    "attack.defense-evasion"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "sitecustomize.py",
        "usercustomize.py"
      ],
      "raw_values": [
        "/usr/lib/python*/sitecustomize.py",
        "/usr/local/lib/python*/sitecustomize.py",
        "/usr/lib/python*/dist-packages/sitecustomize.py",
        "/usr/local/lib/python*/dist-packages/sitecustomize.py",
        "/opt/*/lib/python*/sitecustomize.py",
        "/home/*/.local/lib/python*/site-packages/usercustomize.py",
        "/home/*/.config/python/usercustomize.py"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "like~",
      "values": [
        "dockerd"
      ],
      "raw_values": [
        "/nix/store/*libexec/docker/dockerd",
        "/snap/docker/*dockerd"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "in",
      "values": [
        "restic",
        "pacman",
        "dockerd",
        "podman",
        "pamac-daemon",
        "mamba",
        "_conda",
        "executor",
        "crio",
        "systemd-executor"
      ],
      "raw_values": [
        "/usr/bin/restic",
        "/usr/bin/pacman",
        "/usr/bin/dockerd",
        "/usr/bin/podman",
        "/usr/bin/pamac-daemon",
        "./usr/bin/podman",
        "/opt/miniforge3/bin/mamba",
        "/usr/sbin/dockerd",
        "/opt/conda/_conda",
        "/kaniko/executor",
        "/usr/bin/crio",
        "/usr/lib/systemd/systemd-executor"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "creation"
      ],
      "raw_values": [
        "creation"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"linux\" and event.type == \"creation\" and process.executable != null and\nfile.path like (\n  \"/usr/lib/python*/sitecustomize.py\",\n  \"/usr/local/lib/python*/sitecustomize.py\",\n  \"/usr/lib/python*/dist-packages/sitecustomize.py\",\n  \"/usr/local/lib/python*/dist-packages/sitecustomize.py\",\n  \"/opt/*/lib/python*/sitecustomize.py\",\n  \"/home/*/.local/lib/python*/site-packages/usercustomize.py\",\n  \"/home/*/.config/python/usercustomize.py\"\n) and not (\n  process.executable in (\n    \"/usr/bin/restic\", \"/usr/bin/pacman\", \"/usr/bin/dockerd\", \"/usr/bin/podman\", \"/usr/bin/pamac-daemon\",\n    \"./usr/bin/podman\", \"/opt/miniforge3/bin/mamba\", \"/usr/sbin/dockerd\", \"/opt/conda/_conda\", \"/kaniko/executor\",\n    \"/usr/bin/crio\", \"/usr/lib/systemd/systemd-executor\"\n  ) or\n  process.executable like~ (\"/nix/store/*libexec/docker/dockerd\", \"/snap/docker/*dockerd\")\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_site_and_user_customize_file_creation.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Execution",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}