{
  "id": "05a0a958-776f-55cb-b53a-8407f3d2f063",
  "catalog": "elastic",
  "name": "Potential Computer Account NTLM Relay Activity",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "authentication"
  ],
  "conditions": [
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "in",
      "values": [
        "4624",
        "4625"
      ],
      "raw_values": [
        "4624",
        "4625"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "winlog.logon.type",
      "raw_field": "winlog.logon.type",
      "operator": "==",
      "values": [
        "network"
      ],
      "raw_values": [
        "Network"
      ]
    },
    {
      "field": "winlog.event_data.authenticationpackagename",
      "raw_field": "winlog.event_data.AuthenticationPackageName",
      "operator": "==",
      "values": [
        "ntlm"
      ],
      "raw_values": [
        "NTLM"
      ]
    },
    {
      "field": "source.ip",
      "raw_field": "source.ip",
      "operator": "!=",
      "values": [
        "::1",
        "127.0.0.1"
      ],
      "raw_values": [
        "::1",
        "127.0.0.1"
      ]
    }
  ],
  "raw_query": "authentication where host.os.type == \"windows\" and event.code in (\"4624\", \"4625\") and\n winlog.logon.type == \"Network\" and winlog.event_data.AuthenticationPackageName == \"NTLM\" and\n endswith~(user.name, \"$\") and user.name != \"$\" and\n source.ip != null and source.ip != \"::1\" and source.ip != \"127.0.0.1\" and\n\n /* Filter for a machine account that matches the hostname */\n startswith~(host.name, substring(user.name, 0, -1)) and\n\n /* Verify if the Source IP belongs to the host */\n not endswith(string(source.ip), string(host.ip)) and\n not stringContains(string(host.ip), string(source.ip))\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_dollar_account_relay.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Data Source: Active Directory",
      "Use Case: Active Directory Monitoring",
      "Data Source: Windows Security Event Logs",
      "Resources: Investigation Guide"
    ]
  }
}