{
  "id": "05d31a5b-6c7a-5fd2-b17a-134520decf94",
  "catalog": "elastic",
  "name": "AWS IAM AdministratorAccess Policy Attached to User",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.privilege-escalation",
    "attack.persistence"
  ],
  "event_categories": [
    "iam"
  ],
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "aws.cloudtrail"
      ],
      "raw_values": [
        "aws.cloudtrail"
      ]
    },
    {
      "field": "event.provider",
      "raw_field": "event.provider",
      "operator": "==",
      "values": [
        "iam.amazonaws.com"
      ],
      "raw_values": [
        "iam.amazonaws.com"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "attachuserpolicy"
      ],
      "raw_values": [
        "AttachUserPolicy"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "success"
      ],
      "raw_values": [
        "success"
      ]
    }
  ],
  "raw_query": "iam where data_stream.dataset == \"aws.cloudtrail\"\n   and event.provider == \"iam.amazonaws.com\"\n   and event.action == \"AttachUserPolicy\"\n   and event.outcome == \"success\"\n   and stringContains(aws.cloudtrail.request_parameters, \"policyArn=arn:aws:iam::aws:policy/AdministratorAccess\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/integrations/aws/privilege_escalation_iam_administratoraccess_policy_attached_to_user.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Cloud",
      "Data Source: AWS",
      "Data Source: Amazon Web Services",
      "Data Source: AWS IAM",
      "Use Case: Identity and Access Audit",
      "Tactic: Privilege Escalation",
      "Tactic: Persistence",
      "Resources: Investigation Guide"
    ]
  }
}