{
  "id": "087d16bf-1a09-5f4e-b107-03db2aac7a88",
  "catalog": "elastic",
  "name": "Potential Credential Access via LSASS Memory Dump",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.calltrace",
      "raw_field": "winlog.event_data.CallTrace",
      "operator": ":",
      "values": [
        "dbghelp",
        "dbgcore"
      ],
      "raw_values": [
        "*dbghelp*",
        "*dbgcore*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "werfault.exe",
        "werfaultsecure.exe"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\WerFault.exe",
        "?:\\\\Windows\\\\SysWOW64\\\\WerFault.exe",
        "?:\\\\Windows\\\\System32\\\\WerFaultSecure.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": ":",
      "values": [
        ":\\\\windows\\\\system32\\\\lsass.exe"
      ],
      "raw_values": [
        "?:\\\\WINDOWS\\\\system32\\\\lsass.exe"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.code == \"10\" and\n  winlog.event_data.TargetImage : \"?:\\\\WINDOWS\\\\system32\\\\lsass.exe\" and\n\n   /* DLLs exporting MiniDumpWriteDump API to create an lsass mdmp*/\n  winlog.event_data.CallTrace : (\"*dbghelp*\", \"*dbgcore*\") and\n\n   /* case of lsass crashing */\n  not process.executable : (\n        \"?:\\\\Windows\\\\System32\\\\WerFault.exe\",\n        \"?:\\\\Windows\\\\SysWOW64\\\\WerFault.exe\",\n        \"?:\\\\Windows\\\\System32\\\\WerFaultSecure.exe\"\n      )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_suspicious_lsass_access_memdump.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Tactic:Execution",
      "Data Source: Sysmon",
      "Resources: Investigation Guide"
    ]
  }
}