{
  "id": "09b857ea-459f-5afd-b2f0-f07e8069e895",
  "catalog": "elastic",
  "name": "Initramfs Unpacking via unmkinitramfs",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.persistence"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "unmkinitramfs"
      ],
      "raw_values": [
        "unmkinitramfs"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "==",
      "values": [
        "lsinitramfs"
      ],
      "raw_values": [
        "/usr/bin/lsinitramfs"
      ]
    },
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": "==",
      "values": [
        "/usr/local/nutanix/ngt/python/bin"
      ],
      "raw_values": [
        "/usr/local/nutanix/ngt/python/bin"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\") and\nprocess.name == \"unmkinitramfs\" and not (\n  ?process.parent.executable == \"/usr/bin/lsinitramfs\" or\n  ?process.working_directory == \"/usr/local/nutanix/ngt/python/bin\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_unpack_initramfs_via_unmkinitramfs.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Auditd Manager",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}