{
  "id": "0a089124-e76d-5eb8-a020-a3ed93d7ffcb",
  "catalog": "elastic",
  "name": "Suspicious Microsoft Antimalware Service Execution",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        ".exe",
        "msmpeng.exe"
      ],
      "raw_values": [
        "?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*.exe",
        "?:\\\\Program Files\\\\Windows Defender\\\\*.exe",
        "MsMpEng.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "==",
      "values": [
        "msmpeng.exe"
      ],
      "raw_values": [
        "MsMpEng.exe"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n(\n  (process.pe.original_file_name == \"MsMpEng.exe\" and not process.name : \"MsMpEng.exe\") or\n  (\n    process.name : \"MsMpEng.exe\" and\n    not process.executable : (\n            \"?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*.exe\",\n            \"?:\\\\Program Files\\\\Windows Defender\\\\*.exe\",\n            \"?:\\\\Program Files (x86)\\\\Windows Defender\\\\*.exe\",\n            \"?:\\\\Program Files\\\\Microsoft Security Client\\\\*.exe\",\n            \"?:\\\\Program Files (x86)\\\\Microsoft Security Client\\\\*.exe\",\n\n            /* Crowdstrike specific exclusion as it uses NT Object paths */\n            \"\\\\Device\\\\HarddiskVolume*\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\*.exe\",\n            \"\\\\Device\\\\HarddiskVolume*\\\\Program Files\\\\Windows Defender\\\\*.exe\",\n            \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\Windows Defender\\\\*.exe\",\n            \"\\\\Device\\\\HarddiskVolume*\\\\Program Files\\\\Microsoft Security Client\\\\*.exe\",\n            \"\\\\Device\\\\HarddiskVolume*\\\\Program Files (x86)\\\\Microsoft Security Client\\\\*.exe\"\n    )\n  )\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_execution_windefend_unusual_path.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Endgame",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}