{
  "id": "0c9ade53-2efc-5685-9c48-468d75b4a64f",
  "catalog": "elastic",
  "name": "WebServer Access Logs Deleted",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.defense-evasion"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".log",
        "access.log",
        "access_log"
      ],
      "raw_values": [
        "C:\\\\inetpub\\\\logs\\\\LogFiles\\\\*.log",
        "/var/log/apache*/access.log",
        "/etc/httpd/logs/access_log",
        "/var/log/httpd/access_log",
        "/var/www/*/logs/access.log"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "deletion"
      ],
      "raw_values": [
        "deletion"
      ]
    }
  ],
  "raw_query": "file where event.type == \"deletion\" and\n  file.path : (\"C:\\\\inetpub\\\\logs\\\\LogFiles\\\\*.log\",\n               \"/var/log/apache*/access.log\",\n               \"/etc/httpd/logs/access_log\",\n               \"/var/log/httpd/access_log\",\n               \"/var/www/*/logs/access.log\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/cross-platform/defense_evasion_deleting_websvr_access_logs.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "OS: Windows",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Resources: Investigation Guide"
    ]
  }
}