{
  "id": "0e7e4bdc-bed5-52b8-ab36-93356e63f8e3",
  "catalog": "elastic",
  "name": "Proxy Execution via Console Window Host",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "powershell",
        "cmd",
        "cmd.exe",
        "script",
        "mshta",
        "curl",
        "curl.exe",
        "^*^*^",
        ".bat",
        ".cmd",
        "schtasks",
        "@ssl",
        "http",
        ".vbs",
        ".js",
        "mhsta",
        "--headless"
      ],
      "raw_values": [
        "*powershell*",
        "*cmd *",
        "*cmd.exe *",
        "*script*",
        "*mshta*",
        "*curl *",
        "*curl.exe *",
        "*^*^*^*",
        "*.bat*",
        "*.cmd*",
        "*schtasks*",
        "*@SSL*",
        "*http*",
        "* \\\\\\\\*",
        "*.vbs*",
        "*.js*",
        "*mhsta*",
        "--headless"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "conhost.exe"
      ],
      "raw_values": [
        "conhost.exe"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n process.name : \"conhost.exe\" and process.args : \"--headless\" and\n  process.command_line : (\"*powershell*\", \"*cmd *\", \"*cmd.exe *\", \"*script*\", \"*mshta*\", \"*curl *\", \"*curl.exe *\", \"*^*^*^*\", \"*.bat*\", \"*.cmd*\", \"*schtasks*\", \"*@SSL*\", \"*http*\", \"* \\\\\\\\*\", \"*.vbs*\", \"*.js*\", \"*mhsta*\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_indirect_exec_conhost.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}