{
  "id": "0f6eae8e-9f57-5ab7-b400-0d99728193c2",
  "catalog": "elastic",
  "name": "Sensitive Keys Or Passwords Searched For Inside A Container",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "begin private",
        "begin openssh private",
        "begin rsa private",
        "begin dsa private",
        "begin ec private",
        "id_rsa",
        "id_dsa"
      ],
      "raw_values": [
        "*BEGIN PRIVATE*",
        "*BEGIN OPENSSH PRIVATE*",
        "*BEGIN RSA PRIVATE*",
        "*BEGIN DSA PRIVATE*",
        "*BEGIN EC PRIVATE*",
        "*id_rsa*",
        "*id_dsa*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "grep",
        "egrep",
        "fgrep",
        "find",
        "locate",
        "mlocate"
      ],
      "raw_values": [
        "grep",
        "egrep",
        "fgrep",
        "find",
        "locate",
        "mlocate"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.entry_leader.entry_meta.type",
      "raw_field": "process.entry_leader.entry_meta.type",
      "operator": "==",
      "values": [
        "container"
      ],
      "raw_values": [
        "container"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\nprocess.entry_leader.entry_meta.type == \"container\" and\nprocess.name in (\"grep\", \"egrep\", \"fgrep\", \"find\", \"locate\", \"mlocate\") and\nprocess.command_line like~ (\n  \"*BEGIN PRIVATE*\", \"*BEGIN OPENSSH PRIVATE*\", \"*BEGIN RSA PRIVATE*\", \"*BEGIN DSA PRIVATE*\", \"*BEGIN EC PRIVATE*\",\n  \"*id_rsa*\", \"*id_dsa*\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/credential_access_sensitive_keys_or_passwords_search_inside_container.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Container",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}