{
  "id": "10857001-9a2d-510f-b820-a4800f702985",
  "catalog": "elastic",
  "name": "Root Certificate Installation",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "ca-certificates.postinst",
        "ca-certificates-*.trigger",
        "pacman",
        "pamac-daemon",
        "autofirma.postinst",
        "ipa-client-install",
        "platform-python",
        "python",
        "kesl",
        "execd",
        "systemd",
        "flock"
      ],
      "raw_values": [
        "ca-certificates.postinst",
        "ca-certificates-*.trigger",
        "pacman",
        "pamac-daemon",
        "autofirma.postinst",
        "ipa-client-install",
        "su",
        "platform-python",
        "python*",
        "kesl",
        "execd",
        "systemd",
        "flock"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": ":",
      "values": [
        "/entrypoint.sh",
        "/entrypoint",
        "./bootstrap-rhel",
        "lib/apk/exec/ca-certificates-*trigger"
      ],
      "raw_values": [
        "/entrypoint.sh",
        "/entrypoint",
        "./bootstrap-RHEL*",
        "lib/apk/exec/ca-certificates-*trigger"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "update-ca-trust",
        "update-ca-certificates"
      ],
      "raw_values": [
        "update-ca-trust",
        "update-ca-certificates"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "bash",
        "zsh",
        "update-cert-trust.sh",
        "puppet",
        "ruby",
        "start-haproxy",
        "entrypoint.sh",
        "crun"
      ],
      "raw_values": [
        "sh",
        "bash",
        "zsh",
        "/app/update-cert-trust.sh",
        "/opt/puppetlabs/puppet/bin/puppet",
        "/opt/puppetlabs/puppet/bin/ruby",
        "/start-haproxy",
        "/usr/bin/entrypoint.sh",
        "/usr/bin/crun"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": "like",
      "values": [
        "/var/tmp/rpm"
      ],
      "raw_values": [
        "/var/tmp/rpm*"
      ]
    },
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": "==",
      "values": [
        "/var/lib/rancher"
      ],
      "raw_values": [
        "/var/lib/rancher"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"exec_event\", \"start\") and\nprocess.name in (\"update-ca-trust\", \"update-ca-certificates\") and not (\n  process.parent.name like (\n    \"ca-certificates.postinst\", \"ca-certificates-*.trigger\", \"pacman\", \"pamac-daemon\", \"autofirma.postinst\",\n    \"ipa-client-install\", \"su\", \"platform-python\", \"python*\", \"kesl\", \"execd\", \"systemd\", \"flock\"\n  ) or\n  process.parent.args like \"/var/tmp/rpm*\" or\n  (process.parent.name in (\"sh\", \"bash\", \"zsh\") and process.args == \"-e\") or\n  process.parent.executable in (\n    \"/app/update-cert-trust.sh\", \"/opt/puppetlabs/puppet/bin/puppet\", \"/opt/puppetlabs/puppet/bin/ruby\",\n    \"/start-haproxy\", \"/usr/bin/entrypoint.sh\", \"/usr/bin/crun\"\n  ) or\n  process.parent.args like (\n    \"/entrypoint.sh\", \"/entrypoint\", \"./bootstrap-RHEL*\", \"lib/apk/exec/ca-certificates-*trigger\"\n  ) or\n  ?process.working_directory == \"/var/lib/rancher\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/defense_evasion_root_certificate_installation.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne",
      "Data Source: Elastic Endgame",
      "Resources: Investigation Guide"
    ]
  }
}