{
  "id": "1866da05-b9b9-5746-aff9-9e2686f84048",
  "catalog": "elastic",
  "name": "Potential Protocol Tunneling via EarthWorm",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "start",
        "exec_event",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "start",
        "exec_event",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "rssocks"
      ],
      "raw_values": [
        "-s",
        "-d",
        "rssocks"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"start\", \"exec_event\", \"ProcessRollup2\", \"executed\", \"exec_event\", \"process_started\") and\nprocess.args : \"-s\" and process.args : \"-d\" and process.args : \"rssocks\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/command_and_control_tunneling_via_earthworm.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Data Source: Auditd Manager",
      "Resources: Investigation Guide"
    ]
  }
}