{
  "id": "1944d320-8dee-5839-8d0a-cd7181752ad7",
  "catalog": "elastic",
  "name": "Pluggable Authentication Module or Configuration Creation",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access",
    "attack.persistence"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "pam_*.so"
      ],
      "raw_values": [
        "/lib/security/*",
        "/lib64/security/*",
        "/usr/lib/security/*",
        "/usr/lib64/security/*",
        "/lib/x86_64-linux-gnu/security/*",
        "/usr/lib/x86_64-linux-gnu/security/*",
        "/tmp/snap.rootfs_*/pam_*.so",
        "/tmp/newroot/lib/*/pam_*.so",
        "/tmp/newroot/usr/lib64/security/pam_*.so"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "python",
        "platform-python",
        "snap-update-ns",
        "dockerd"
      ],
      "raw_values": [
        "/nix/store/*",
        "/var/lib/dpkg/*",
        "/snap/*",
        "/dev/fd/*",
        "/usr/lib/virtualbox/*",
        "/usr/bin/python*",
        "/opt/alt/python*/bin/python*",
        "/usr/libexec/platform-python*",
        "./snap/snapd/*/usr/lib/snapd/snap-update-ns",
        "python*",
        "platform-python*",
        "dockerd"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "in",
      "values": [
        "dpkg",
        "dockerd",
        "microdnf",
        "rpm",
        "snapd",
        "yum",
        "dnf",
        "podman",
        "dnf-automatic",
        "pacman",
        "dpkg-divert",
        "apk",
        "apt",
        "puppet",
        "chef-client",
        "autossl_check",
        "exe",
        "pamac-daemon",
        "pam-auth-update",
        "systemd",
        "packagekitd",
        "bsdtar",
        "dnf5",
        "ruby",
        "crio",
        "authconfig",
        "yum-cron",
        "dnf_install",
        "jumpcloud-agent",
        "executor",
        "buildah",
        "pam-config",
        "snap-update-ns",
        "install",
        "env"
      ],
      "raw_values": [
        "/bin/dpkg",
        "/usr/bin/dpkg",
        "/bin/dockerd",
        "/usr/bin/dockerd",
        "/usr/sbin/dockerd",
        "/bin/microdnf",
        "/usr/bin/microdnf",
        "/bin/rpm",
        "/usr/bin/rpm",
        "/bin/snapd",
        "/usr/bin/snapd",
        "/bin/yum",
        "/usr/bin/yum",
        "/bin/dnf",
        "/usr/bin/dnf",
        "/bin/podman",
        "/usr/bin/podman",
        "/bin/dnf-automatic",
        "/usr/bin/dnf-automatic",
        "/bin/pacman",
        "/usr/bin/pacman",
        "/usr/bin/dpkg-divert",
        "/bin/dpkg-divert",
        "/sbin/apk",
        "/usr/sbin/apk",
        "/usr/local/sbin/apk",
        "/usr/bin/apt",
        "/usr/sbin/pacman",
        "/usr/bin/puppet",
        "/bin/puppet",
        "/opt/puppetlabs/puppet/bin/puppet",
        "/usr/bin/chef-client",
        "/bin/chef-client",
        "/bin/autossl_check",
        "/usr/bin/autossl_check",
        "/proc/self/exe",
        "/usr/bin/pamac-daemon",
        "/bin/pamac-daemon",
        "/usr/lib/snapd/snapd",
        "/usr/local/bin/dockerd",
        "/usr/sbin/pam-auth-update",
        "/usr/lib/systemd/systemd",
        "/usr/libexec/packagekitd",
        "/usr/bin/bsdtar",
        "/sbin/pam-auth-update",
        "./user/bin/podman",
        "/usr/bin/dnf5",
        "/opt/puppetlabs/puppet/bin/ruby",
        "/usr/bin/crio",
        "/sbin/authconfig",
        "/usr/sbin/yum-cron",
        "/sbin/yum-cron",
        "/usr/local/psa/bin/dnf_install",
        "/opt/jc/bin/jumpcloud-agent",
        "./usr/bin/podman",
        "/kaniko/executor",
        "/opt/kaniko/executor",
        "/usr/bin/buildah",
        "/usr/sbin/pam-config",
        "./usr/lib/snapd/snap-update-ns",
        "/usr/bin/install",
        "/usr/bin/env"
      ]
    },
    {
      "field": "file.extension",
      "raw_field": "file.extension",
      "operator": "in",
      "values": [
        "swp",
        "swpx",
        "swx",
        "dpkg-remove"
      ],
      "raw_values": [
        "swp",
        "swpx",
        "swx",
        "dpkg-remove"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "creation",
        "rename"
      ],
      "raw_values": [
        "creation",
        "rename"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like",
      "values": [
        "pam_"
      ],
      "raw_values": [
        "/etc/pam.d/*",
        "/etc/security/pam_*"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "==",
      "values": [
        "pam.conf"
      ],
      "raw_values": [
        "/etc/pam.conf"
      ]
    },
    {
      "field": "file.ext.original.extension",
      "raw_field": "file.Ext.original.extension",
      "operator": "==",
      "values": [
        "dpkg-new"
      ],
      "raw_values": [
        "dpkg-new"
      ]
    },
    {
      "field": "file.ext.original.name",
      "raw_field": "file.Ext.original.name",
      "operator": "like",
      "values": [
        ".pam-new"
      ],
      "raw_values": [
        "*.pam-new"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sed",
        "perl",
        "vim.basic"
      ],
      "raw_values": [
        "sed",
        "perl",
        "vim.basic"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": "like~",
      "values": [
        "sed",
        "e2scrub_all.tmp"
      ],
      "raw_values": [
        "sed*",
        "e2scrub_all.tmp*"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"linux\" and event.action == \"creation\" and process.executable != null and (\n  (file.path like (\n    \"/lib/security/*\", \"/lib64/security/*\", \"/usr/lib/security/*\", \"/usr/lib64/security/*\",\n    \"/lib/x86_64-linux-gnu/security/*\", \"/usr/lib/x86_64-linux-gnu/security/*\"\n  ) and file.extension == \"so\") or\n  (file.path like \"/etc/pam.d/*\" and file.extension == null) or\n  (file.path like \"/etc/security/pam_*\" or file.path == \"/etc/pam.conf\")\n) and not (\n  process.executable in (\n    \"/bin/dpkg\", \"/usr/bin/dpkg\", \"/bin/dockerd\", \"/usr/bin/dockerd\", \"/usr/sbin/dockerd\", \"/bin/microdnf\",\n    \"/usr/bin/microdnf\", \"/bin/rpm\", \"/usr/bin/rpm\", \"/bin/snapd\", \"/usr/bin/snapd\", \"/bin/yum\", \"/usr/bin/yum\",\n    \"/bin/dnf\", \"/usr/bin/dnf\", \"/bin/podman\", \"/usr/bin/podman\", \"/bin/dnf-automatic\", \"/usr/bin/dnf-automatic\",\n    \"/bin/pacman\", \"/usr/bin/pacman\", \"/usr/bin/dpkg-divert\", \"/bin/dpkg-divert\", \"/sbin/apk\", \"/usr/sbin/apk\",\n    \"/usr/local/sbin/apk\", \"/usr/bin/apt\", \"/usr/sbin/pacman\", \"/bin/podman\", \"/usr/bin/podman\", \"/usr/bin/puppet\",\n    \"/bin/puppet\", \"/opt/puppetlabs/puppet/bin/puppet\", \"/usr/bin/chef-client\", \"/bin/chef-client\",\n    \"/bin/autossl_check\", \"/usr/bin/autossl_check\", \"/proc/self/exe\", \"/usr/bin/pamac-daemon\",\n    \"/bin/pamac-daemon\", \"/usr/lib/snapd/snapd\", \"/usr/local/bin/dockerd\", \"/usr/sbin/pam-auth-update\",\n    \"/usr/lib/systemd/systemd\", \"/usr/libexec/packagekitd\", \"/usr/bin/bsdtar\", \"/sbin/pam-auth-update\", \"./user/bin/podman\",\n    \"/usr/bin/dnf5\", \"/opt/puppetlabs/puppet/bin/ruby\", \"/usr/bin/crio\", \"/sbin/authconfig\", \"/usr/sbin/yum-cron\",\n    \"/sbin/yum-cron\", \"/usr/local/psa/bin/dnf_install\", \"/opt/jc/bin/jumpcloud-agent\", \"./usr/bin/podman\",\n    \"/kaniko/executor\", \"/opt/kaniko/executor\", \"/usr/bin/buildah\", \"/usr/sbin/pam-config\",\n    \"./usr/lib/snapd/snap-update-ns\", \"/usr/bin/install\", \"/usr/bin/env\"\n  ) or\n  file.path like (\n    \"/tmp/snap.rootfs_*/pam_*.so\", \"/tmp/newroot/lib/*/pam_*.so\", \"/tmp/newroot/usr/lib64/security/pam_*.so\"\n  ) or\n  file.extension in (\"swp\", \"swpx\", \"swx\", \"dpkg-remove\") or\n  file.Ext.original.extension == \"dpkg-new\" or\n  file.Ext.original.name like \"*.pam-new\" or\n  process.executable like (\n    \"/nix/store/*\", \"/var/lib/dpkg/*\", \"/snap/*\", \"/dev/fd/*\", \"/usr/lib/virtualbox/*\", \"/usr/bin/python*\",\n    \"/opt/alt/python*/bin/python*\", \"/usr/libexec/platform-python*\", \"./snap/snapd/*/usr/lib/snapd/snap-update-ns\"\n  ) or\n  (process.name == \"sed\" and file.name like~ \"sed*\") or\n  (process.name == \"perl\" and file.name like~ \"e2scrub_all.tmp*\") or\n  (process.name == \"perl\" and event.action == \"rename\" and file.Ext.original.name like \"*.pam-new\") or\n  process.name like (\"python*\", \"platform-python*\", \"dockerd\") or\n  (process.name == \"vim.basic\" and file.name like \"*~\")\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_pluggable_authentication_module_creation.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Tactic: Persistence",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}