{
  "id": "1c1cac03-3d91-5895-8bf7-8a8927e59bc4",
  "catalog": "elastic",
  "name": "Privilege Escalation via GDB CAP_SYS_PTRACE",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "gdb"
      ],
      "raw_values": [
        "gdb"
      ]
    },
    {
      "field": "process.thread.capabilities.effective",
      "raw_field": "process.thread.capabilities.effective",
      "operator": ":",
      "values": [
        "cap_sys_ptrace"
      ],
      "raw_values": [
        "CAP_SYS_PTRACE"
      ]
    },
    {
      "field": "process.thread.capabilities.permitted",
      "raw_field": "process.thread.capabilities.permitted",
      "operator": ":",
      "values": [
        "cap_sys_ptrace"
      ],
      "raw_values": [
        "CAP_SYS_PTRACE"
      ]
    }
  ],
  "raw_query": "sequence by host.id, process.entry_leader.entity_id with maxspan=1m\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.name == \"gdb\" and\n   (process.thread.capabilities.effective : \"CAP_SYS_PTRACE\" or process.thread.capabilities.permitted : \"CAP_SYS_PTRACE\") and\n   user.id != \"0\"]\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\n   process.name != null and user.id == \"0\"]\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/privilege_escalation_gdb_sys_ptrace_elevation.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}