{
  "id": "29813d99-c012-56f9-bdfa-2953adcacd92",
  "catalog": "elastic",
  "name": "Veeam Backup Library Loaded by Unusual Process",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "powershell.exe",
        "pwsh.exe",
        "powershell_ise.exe"
      ],
      "raw_values": [
        "powershell.exe",
        "pwsh.exe",
        "powershell_ise.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "load"
      ],
      "raw_values": [
        "load"
      ]
    },
    {
      "field": "dll.name",
      "raw_field": "dll.name",
      "operator": ":",
      "values": [
        "veeam.backup.common.dll"
      ],
      "raw_values": [
        "Veeam.Backup.Common.dll"
      ]
    },
    {
      "field": "dll.pe.original_file_name",
      "raw_field": "dll.pe.original_file_name",
      "operator": ":",
      "values": [
        "veeam.backup.common.dll"
      ],
      "raw_values": [
        "Veeam.Backup.Common.dll"
      ]
    }
  ],
  "raw_query": "library where host.os.type == \"windows\" and event.action == \"load\" and\n  (dll.name : \"Veeam.Backup.Common.dll\" or dll.pe.original_file_name : \"Veeam.Backup.Common.dll\") and\n  (\n    process.code_signature.trusted == false or\n    process.code_signature.exists == false or\n    process.name : (\"powershell.exe\", \"pwsh.exe\", \"powershell_ise.exe\")\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_veeam_backup_dll_imageload.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}