{
  "id": "2ad67b3a-cb81-5c84-8c92-a55ec9bf7ca2",
  "catalog": "elastic",
  "name": "Microsoft Management Console File from Unusual Path",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mmc.exe"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\mmc.exe",
        "\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\mmc.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        ".msc",
        "compmgmt.msc"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\*.msc",
        "?:\\\\Windows\\\\SysWOW64\\\\*.msc",
        "?:\\\\Program files\\\\*.msc",
        "C:\\\\Windows\\\\system32\\\\mmc.exe eventvwr.msc /s",
        "mmc.exe eventvwr.msc /s",
        "\\",
        " CompMgmt.msc*",
        "*.msc"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.executable : (\n    \"?:\\\\Windows\\\\System32\\\\mmc.exe\",\n\n    /* Crowdstrike specific condition as it uses NT Object paths */\n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\mmc.exe\"\n  ) and\n  process.args : \"*.msc\" and\n  not process.args : (\n        \"?:\\\\Windows\\\\System32\\\\*.msc\",\n        \"?:\\\\Windows\\\\SysWOW64\\\\*.msc\",\n        \"?:\\\\Program files\\\\*.msc\",\n        \"?:\\\\Program Files (x86)\\\\*.msc\",\n        \"?:\\\\Windows\\\\ADFS\\\\Microsoft.IdentityServer.msc\"\n  ) and\n  not process.command_line : (\n    \"C:\\\\Windows\\\\system32\\\\mmc.exe eventvwr.msc /s\",\n    \"mmc.exe eventvwr.msc /s\",\n    \"\\\"C:\\\\Windows\\\\System32\\\\mmc.exe\\\" CompMgmt.msc*\"\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/execution_via_mmc_console_file_unusual_path.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Windows Security Event Logs",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide",
      "Data Source: Sysmon"
    ]
  }
}