{
  "id": "2ce597b5-9369-52df-bf5b-960c82d50fe2",
  "catalog": "elastic",
  "name": "AWS S3 Static Site JavaScript File Uploaded",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "aws.cloudtrail.user_identity.type",
      "raw_field": "aws.cloudtrail.user_identity.type",
      "operator": "in",
      "values": [
        "iamuser",
        "assumedrole"
      ],
      "raw_values": [
        "IAMUser",
        "AssumedRole"
      ]
    },
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "aws.cloudtrail"
      ],
      "raw_values": [
        "aws.cloudtrail"
      ]
    },
    {
      "field": "event.provider",
      "raw_field": "event.provider",
      "operator": "==",
      "values": [
        "s3.amazonaws.com"
      ],
      "raw_values": [
        "s3.amazonaws.com"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "putobject"
      ],
      "raw_values": [
        "PutObject"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "success"
      ],
      "raw_values": [
        "success"
      ]
    },
    {
      "field": "aws.cloudtrail.request_parameters",
      "raw_field": "aws.cloudtrail.request_parameters",
      "operator": "like",
      "values": [
        "static/js/*.js"
      ],
      "raw_values": [
        "*static/js/*.js*"
      ]
    },
    {
      "field": "user_agent.original",
      "raw_field": "user_agent.original",
      "operator": "like",
      "values": [
        "terraform",
        "ansible",
        "pulumi"
      ],
      "raw_values": [
        "*Terraform*",
        "*Ansible*",
        "*Pulumi*"
      ]
    }
  ],
  "raw_query": "from logs-aws.cloudtrail* metadata _id, _version, _index\n\n| where\n    // S3 object write activity\n    data_stream.dataset == \"aws.cloudtrail\"\n    and event.provider == \"s3.amazonaws.com\"\n    and event.action == \"PutObject\"\n    and event.outcome == \"success\"\n\n    // IAM users or assumed roles only\n    and aws.cloudtrail.user_identity.type in (\"IAMUser\", \"AssumedRole\")\n\n    // Requests for static site bundles\n    and aws.cloudtrail.request_parameters like \"*static/js/*.js*\"\n\n    // Exclude IaC and automation tools\n    and not (\n        user_agent.original like \"*Terraform*\"\n        or user_agent.original like \"*Ansible*\"\n        or user_agent.original like \"*Pulumi*\"\n    )\n\n// Extract fields from request parameters\n| dissect aws.cloudtrail.request_parameters\n    \"%{{?bucket.name.key}=%{Esql.aws_cloudtrail_request_parameters_bucket_name}, %{?host.key}=%{Esql_priv.aws_cloudtrail_request_parameters_host}, %{?bucket.object.location.key}=%{Esql.aws_cloudtrail_request_parameters_bucket_object_location}}\"\n\n// Extract file name portion from full object path\n| dissect Esql.aws_cloudtrail_request_parameters_bucket_object_location \"%{}static/js/%{Esql.aws_cloudtrail_request_parameters_object_key}\"\n\n// Match on JavaScript files\n| where ends_with(Esql.aws_cloudtrail_request_parameters_object_key, \".js\")\n\n// Retain relevant ECS and dissected fields\n| keep\n    aws.cloudtrail.user_identity.arn,\n    aws.cloudtrail.user_identity.access_key_id,\n    aws.cloudtrail.user_identity.type,\n    aws.cloudtrail.request_parameters,\n    Esql.aws_cloudtrail_request_parameters_bucket_name,\n    Esql.aws_cloudtrail_request_parameters_object_key,\n    user_agent.original,\n    source.ip,\n    event.action,\n    @timestamp,\n    _id,\n    _version,\n    _index\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/integrations/aws/impact_s3_static_site_js_file_uploaded.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Cloud",
      "Data Source: AWS",
      "Data Source: Amazon Web Services",
      "Data Source: AWS S3",
      "Tactic: Impact",
      "Use Case: Web Application Compromise",
      "Use Case: Cloud Threat Detection",
      "Resources: Investigation Guide"
    ]
  }
}