{
  "id": "2ef2eb8f-7476-5ddf-8b95-0d440793ec8a",
  "catalog": "elastic",
  "name": "SSH Key Generated via ssh-keygen",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "creation",
        "file_create_event"
      ],
      "raw_values": [
        "creation",
        "file_create_event"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "==",
      "values": [
        "ssh-keygen"
      ],
      "raw_values": [
        "/usr/bin/ssh-keygen"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "known_hosts."
      ],
      "raw_values": [
        "known_hosts.*"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"linux\" and event.action in (\"creation\", \"file_create_event\") and\nprocess.executable == \"/usr/bin/ssh-keygen\" and file.path : (\"/home/*/.ssh/*\", \"/root/.ssh/*\", \"/etc/ssh/*\") and\nnot file.name : \"known_hosts.*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_ssh_key_generation.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Lateral Movement",
      "Tactic: Persistence",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}