{
  "id": "2f08c83d-ec8c-5e2f-ad3e-772aa3480775",
  "catalog": "elastic",
  "name": "Suspicious Kernel Feature Activity",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.defense-evasion",
    "attack.discovery"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "sysctl.conf",
        "nmi_watchdog",
        "nr_hugepages",
        "ptrace_scope",
        "randomize_va_space",
        "drop_caches",
        "sysrq",
        "grsecurity",
        "exec-shield",
        "kernel.randomize_va_space",
        "kernel.yama.ptrace_scope",
        "kernel.nmi_watchdog",
        "vm.nr_hugepages",
        "vm.drop_caches",
        "kernel.sysrq",
        "--write",
        "echo"
      ],
      "raw_values": [
        "*/etc/sysctl.conf*",
        "*/etc/sysctl.d/*",
        "*/proc/sys/kernel/nmi_watchdog*",
        "*/proc/sys/vm/nr_hugepages*",
        "*/proc/sys/kernel/yama/ptrace_scope*",
        "*/proc/sys/kernel/randomize_va_space*",
        "*/proc/sys/vm/drop_caches*",
        "*/proc/sys/kernel/sysrq*",
        "*grsecurity*",
        "*exec-shield*",
        "*kernel.randomize_va_space*",
        "*kernel.yama.ptrace_scope*",
        "*kernel.nmi_watchdog*",
        "*vm.nr_hugepages*",
        "*vm.drop_caches*",
        "*kernel.sysrq*",
        "*-w*",
        "*--write*",
        "*=*",
        "*echo *"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "ProcessRollup2"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "gwia",
        "gwmta",
        "gwpoa",
        "illumio-firewall",
        "oracle-database-preinstall-19c-verify",
        "make",
        "qualys-scan-util",
        "crond",
        "cron"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "/opt/novell/groupwise/agents/bin/gwia",
        "/opt/novell/groupwise/agents/bin/gwmta",
        "/opt/novell/groupwise/agents/bin/gwpoa",
        "/opt/illumio_ven/system/etc/init.d/illumio-firewall",
        "/usr/bin/oracle-database-preinstall-19c-verify",
        "/usr/bin/make",
        "/usr/local/qualys/cloud-agent/bin/qualys-scan-util",
        "crond",
        "cron"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "tee",
        "cat",
        "grep",
        "sysctl"
      ],
      "raw_values": [
        "tee",
        "cat",
        "grep",
        "sysctl"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like",
      "values": [
        "-*a",
        "drop_caches"
      ],
      "raw_values": [
        "-*a*",
        "*drop_caches*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "like",
      "values": [
        "checkmemlock.sh"
      ],
      "raw_values": [
        "/tmp/CVU_19_resource*/checkmemlock.sh"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": "==",
      "values": [
        "/usr/share/mysql/mysql-systemd-start"
      ],
      "raw_values": [
        "/usr/share/mysql/mysql-systemd-start"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": "like",
      "values": [
        "ansible"
      ],
      "raw_values": [
        "*ansible*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"ProcessRollup2\") and\nprocess.command_line : (\n  \"*/etc/sysctl.conf*\", \"*/etc/sysctl.d/*\", \"*/proc/sys/kernel/nmi_watchdog*\",\n  \"*/proc/sys/vm/nr_hugepages*\", \"*/proc/sys/kernel/yama/ptrace_scope*\",\n  \"*/proc/sys/kernel/randomize_va_space*\", \"*/proc/sys/vm/drop_caches*\",\n  \"*/proc/sys/kernel/sysrq*\", \"*grsecurity*\", \"*exec-shield*\",\n  \"*kernel.randomize_va_space*\", \"*kernel.yama.ptrace_scope*\",\n  \"*kernel.nmi_watchdog*\", \"*vm.nr_hugepages*\", \"*vm.drop_caches*\",\n  \"*kernel.sysrq*\"\n) and\n?process.parent.executable != null and \n(\n  (process.name == \"tee\" and process.args like \"-*a*\") or // also detects --append\n  (process.name == \"cat\" and not process.parent.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\")) or\n  (process.name == \"grep\" and process.args_count == 3 and not process.parent.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\")) or\n  (process.name == \"sysctl\" and process.args like (\"*-w*\", \"*--write*\", \"*=*\")) or\n  (process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\") and process.args == \"-c\" and process.args : \"*echo *\")\n) and\nnot (\n  process.parent.executable in (\n    \"/opt/novell/groupwise/agents/bin/gwia\", \"/opt/novell/groupwise/agents/bin/gwmta\", \"/opt/novell/groupwise/agents/bin/gwpoa\",\n    \"/opt/illumio_ven/system/etc/init.d/illumio-firewall\", \"/usr/bin/oracle-database-preinstall-19c-verify\", \"/usr/bin/make\",\n    \"/usr/local/qualys/cloud-agent/bin/qualys-scan-util\"\n  ) or\n  process.parent.executable like \"/tmp/CVU_19_resource*/checkmemlock.sh\" or\n  process.parent.args == \"/usr/share/mysql/mysql-systemd-start\" or\n  process.parent.command_line like \"*ansible*\" or\n  (process.parent.name in (\"crond\", \"cron\") and process.command_line like \"*drop_caches*\")\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/defense_evasion_sysctl_kernel_feature_activity.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Discovery",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide",
      "Data Source: Crowdstrike"
    ]
  }
}