{
  "id": "2fe3d25f-3f7d-5035-9e33-92b34ef40f78",
  "catalog": "elastic",
  "name": "Connection to Commonly Abused Web Services",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": ":",
      "values": [
        "raw.githubusercontent.",
        "pastebin.",
        "paste4btc.com",
        "paste.ee",
        "ghostbin.com",
        "drive.google.com",
        ".docs.live.net",
        "api.dropboxapi.",
        "content.dropboxapi.",
        "dl.dropboxusercontent.",
        "api.onedrive.com",
        ".onedrive.org",
        "onedrive.live.com",
        "filebin.net",
        ".ngrok.io",
        "ngrok.com",
        ".portmap.",
        "serveo.net",
        "localtunnel.me",
        "pagekite.me",
        "localxpose.io",
        "notabug.org",
        "rawcdn.githack.",
        "paste.nrecom.net",
        "zerobin.net",
        "controlc.com",
        "requestbin.net",
        "slack.com",
        "api.slack.com",
        "slack-redir.net",
        "slack-files.com",
        "cdn.discordapp.com",
        "discordapp.com",
        "discord.com",
        "apis.azureedge.net",
        "cdn.sql.gg",
        ".top4top.io",
        "top4top.io",
        "www.uplooder.net",
        ".cdnmegafiles.com",
        "transfer.sh",
        "gofile.io",
        "updates.peer2profit.com",
        "api.telegram.org",
        "t.me",
        "meacz.gq",
        "rwrd.org",
        ".publicvm.com",
        ".blogspot.com",
        "api.mylnikov.org",
        "file.io",
        "stackoverflow.com",
        "files.1drv.com",
        "api.anonfile.com",
        "hosting-profi.de",
        "ipbase.com",
        "ipfs.io",
        "up.freeo*.space",
        "script.google.com",
        "script.googleusercontent.com",
        "api.notion.com",
        "graph.microsoft.com",
        ".sharepoint.com",
        "mbasic.facebook.com",
        "login.live.com",
        "api.gofile.io",
        "api.anonfiles.com",
        "api.trello.com",
        "gist.githubusercontent.com",
        "files.pythonhosted.org",
        "g.live.com",
        ".zulipchat.com",
        "webhook.site",
        "run.mocky.io",
        "mockbin.org",
        "googleapis.com",
        "global.rel.tunnels.api.visualstudio.com",
        ".devtunnels.ms",
        "api.github.com",
        ".blob.core.windows.net",
        ".blob.storage.azure.net",
        "files.catbox.moe",
        ".supabase.co",
        ".elastic-cloud.com",
        ".cloud.es.io",
        "icp0.io",
        "skyapi.onedrive.live.com",
        "raw.githubusercontent.com",
        "www.googleapis.com"
      ],
      "raw_values": [
        "raw.githubusercontent.*",
        "pastebin.*",
        "paste4btc.com",
        "paste.ee",
        "ghostbin.com",
        "drive.google.com",
        "?.docs.live.net",
        "api.dropboxapi.*",
        "content.dropboxapi.*",
        "dl.dropboxusercontent.*",
        "api.onedrive.com",
        "*.onedrive.org",
        "onedrive.live.com",
        "filebin.net",
        "*.ngrok.io",
        "ngrok.com",
        "*.portmap.*",
        "*serveo.net",
        "*localtunnel.me",
        "*pagekite.me",
        "*localxpose.io",
        "*notabug.org",
        "rawcdn.githack.*",
        "paste.nrecom.net",
        "zerobin.net",
        "controlc.com",
        "requestbin.net",
        "slack.com",
        "api.slack.com",
        "slack-redir.net",
        "slack-files.com",
        "cdn.discordapp.com",
        "discordapp.com",
        "discord.com",
        "apis.azureedge.net",
        "cdn.sql.gg",
        "?.top4top.io",
        "top4top.io",
        "www.uplooder.net",
        "*.cdnmegafiles.com",
        "transfer.sh",
        "gofile.io",
        "updates.peer2profit.com",
        "api.telegram.org",
        "t.me",
        "meacz.gq",
        "rwrd.org",
        "*.publicvm.com",
        "*.blogspot.com",
        "api.mylnikov.org",
        "file.io",
        "stackoverflow.com",
        "*files.1drv.com",
        "api.anonfile.com",
        "*hosting-profi.de",
        "ipbase.com",
        "ipfs.io",
        "*up.freeo*.space",
        "script.google.com",
        "script.googleusercontent.com",
        "api.notion.com",
        "graph.microsoft.com",
        "*.sharepoint.com",
        "mbasic.facebook.com",
        "login.live.com",
        "api.gofile.io",
        "api.anonfiles.com",
        "api.trello.com",
        "gist.githubusercontent.com",
        "files.pythonhosted.org",
        "g.live.com",
        "*.zulipchat.com",
        "webhook.site",
        "run.mocky.io",
        "mockbin.org",
        "*googleapis.com",
        "global.rel.tunnels.api.visualstudio.com",
        "*.devtunnels.ms",
        "api.github.com",
        "*.blob.core.windows.net",
        "*.blob.storage.azure.net",
        "files.catbox.moe",
        "*.supabase.co",
        "*.elastic-cloud.com",
        "*.cloud.es.io",
        "*icp0.io",
        "skyapi.onedrive.live.com",
        "raw.githubusercontent.com",
        "www.googleapis.com"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        ".exe",
        "microsoft.sharepoint.exe",
        "onedrive.sync.service.exe",
        "discord.exe",
        "obsidian.exe",
        "webexperiencehostapp.exe",
        "zoom.exe",
        "code.exe",
        "terraform-provider*.exe"
      ],
      "raw_values": [
        "?:\\\\Program Files\\\\*.exe",
        "Microsoft.SharePoint.exe",
        "OneDrive.Sync.Service.exe",
        "Discord.exe",
        "Obsidian.exe",
        "WebExperienceHostApp.exe",
        "Zoom.exe",
        "Code.exe",
        "terraform-provider*.exe"
      ]
    },
    {
      "field": "process.code_signature.subject_name",
      "raw_field": "process.code_signature.subject_name",
      "operator": ":",
      "values": [
        "python software foundation",
        "anaconda, inc.",
        "zoom video communications, inc.",
        "zoom communications, inc.",
        "johannes schindelin",
        "redis inc.",
        "slack technologies, llc",
        "cisco systems, inc.",
        "dropbox, inc",
        "amazon.com services llc",
        "island technology inc.",
        "github, inc.",
        "red hat, inc",
        "mozilla corporation",
        "discord inc.",
        "microsoft corporation",
        "dynalist inc",
        "microsoft windows",
        "jetbrains s.r.o.",
        "microsoft",
        "hashicorp, inc."
      ],
      "raw_values": [
        "Python Software Foundation",
        "Anaconda, Inc.",
        "Zoom Video Communications, Inc.",
        "Zoom Communications, Inc.",
        "Johannes Schindelin",
        "Redis Inc.",
        "Slack Technologies, LLC",
        "Cisco Systems, Inc.",
        "Dropbox, Inc",
        "Amazon.com Services LLC",
        "Island Technology Inc.",
        "GitHub, Inc.",
        "Red Hat, Inc",
        "Mozilla Corporation",
        "Discord Inc.",
        "Microsoft Corporation",
        "Dynalist Inc",
        "Microsoft Windows",
        "JetBrains s.r.o.",
        "Microsoft *",
        "HashiCorp, Inc."
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": "in",
      "values": [
        "s-1-5-18",
        "s-1-5-19",
        "s-1-5-20"
      ],
      "raw_values": [
        "S-1-5-18",
        "S-1-5-19",
        "S-1-5-20"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "user.domain",
      "raw_field": "user.domain",
      "operator": "==",
      "values": [
        "nt authority"
      ],
      "raw_values": [
        "NT AUTHORITY"
      ]
    }
  ],
  "raw_query": "network where host.os.type == \"windows\" and\n    dns.question.name != null and process.name != null and\n    not (?user.id in (\"S-1-5-18\", \"S-1-5-19\", \"S-1-5-20\") or user.domain == \"NT AUTHORITY\") and\n    /* Add new WebSvc domains here */\n    dns.question.name :\n       (\n        \"raw.githubusercontent.*\",\n        \"pastebin.*\",\n        \"paste4btc.com\",\n        \"paste.ee\",\n        \"ghostbin.com\",\n        \"drive.google.com\",\n        \"?.docs.live.net\",\n        \"api.dropboxapi.*\",\n        \"content.dropboxapi.*\",\n        \"dl.dropboxusercontent.*\",\n        \"api.onedrive.com\",\n        \"*.onedrive.org\",\n        \"onedrive.live.com\",\n        \"filebin.net\",\n        \"*.ngrok.io\",\n        \"ngrok.com\",\n        \"*.portmap.*\",\n        \"*serveo.net\",\n        \"*localtunnel.me\",\n        \"*pagekite.me\",\n        \"*localxpose.io\",\n        \"*notabug.org\",\n        \"rawcdn.githack.*\",\n        \"paste.nrecom.net\",\n        \"zerobin.net\",\n        \"controlc.com\",\n        \"requestbin.net\",\n        \"slack.com\",\n        \"api.slack.com\",\n        \"slack-redir.net\",\n        \"slack-files.com\",\n        \"cdn.discordapp.com\",\n        \"discordapp.com\",\n        \"discord.com\",\n        \"apis.azureedge.net\",\n        \"cdn.sql.gg\",\n        \"?.top4top.io\",\n        \"top4top.io\",\n        \"www.uplooder.net\",\n        \"*.cdnmegafiles.com\",\n        \"transfer.sh\",\n        \"gofile.io\",\n        \"updates.peer2profit.com\",\n        \"api.telegram.org\",\n        \"t.me\",\n        \"meacz.gq\",\n        \"rwrd.org\",\n        \"*.publicvm.com\",\n        \"*.blogspot.com\",\n        \"api.mylnikov.org\",\n        \"file.io\",\n        \"stackoverflow.com\",\n        \"*files.1drv.com\",\n        \"api.anonfile.com\",\n        \"*hosting-profi.de\",\n        \"ipbase.com\",\n        \"ipfs.io\",\n        \"*up.freeo*.space\",\n        \"api.mylnikov.org\",\n        \"script.google.com\",\n        \"script.googleusercontent.com\",\n        \"api.notion.com\",\n        \"graph.microsoft.com\",\n        \"*.sharepoint.com\",\n        \"mbasic.facebook.com\",\n        \"login.live.com\",\n        \"api.gofile.io\",\n        \"api.anonfiles.com\",\n        \"api.notion.com\",\n        \"api.trello.com\",\n        \"gist.githubusercontent.com\",\n        \"files.pythonhosted.org\",\n        \"g.live.com\",\n        \"*.zulipchat.com\",\n        \"webhook.site\",\n        \"run.mocky.io\",\n        \"mockbin.org\",\n        \"*googleapis.com\",\n        \"global.rel.tunnels.api.visualstudio.com\",\n        \"*.devtunnels.ms\",\n        \"api.github.com\",\n        \"*.blob.core.windows.net\",\n        \"*.blob.storage.azure.net\",\n        \"files.catbox.moe\",\n        \"*.supabase.co\",\n        \"*.elastic-cloud.com\",\n        \"*.cloud.es.io\",\n        \"*icp0.io\") and\n\n    /* Insert noisy false positives here */\n    not (\n      (\n        process.executable : (\n          \"?:\\\\Program Files\\\\*.exe\",\n          \"?:\\\\Program Files (x86)\\\\*.exe\",\n          \"?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\*\\\\MsMpEng.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\BraveSoftware\\\\*\\\\Application\\\\brave.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\Opera*\\\\opera.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\Fiddler\\\\Fiddler.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\PowerToys\\\\PowerToys.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Vivaldi\\\\Application\\\\vivaldi.exe\",\n          \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Zen Browser\\\\zen.exe\",\n          \"?:\\\\Users\\\\*\\\\Wavesor Software\\\\WaveBrowser\\\\wavebrowser.exe\",\n          \"?:\\\\Windows\\\\System32\\\\MicrosoftEdgeCP.exe\",\n          \"?:\\\\Windows\\\\system32\\\\mobsync.exe\",\n          \"?:\\\\Windows\\\\SysWOW64\\\\mobsync.exe\",\n          \"?:\\\\Windows\\\\system32\\\\svchost.exe\",\n          \"?:\\\\Windows\\\\System32\\\\smartscreen.exe\",\n          \"?:\\\\Windows\\\\System32\\\\wsl.exe\",\n          \"?:\\\\Windows\\\\System32\\\\WWAHost.exe\"\n        )\n      ) or\n\n      /* Discord App */\n      (process.name : \"Discord.exe\" and (process.code_signature.subject_name : \"Discord Inc.\" and\n       process.code_signature.trusted == true) and dns.question.name : (\"discord.com\", \"cdn.discordapp.com\", \"discordapp.com\")\n      ) or\n\n      /* MS Sharepoint / OneDrive */\n      (process.name : (\"Microsoft.SharePoint.exe\", \"OneDrive.Sync.Service.exe\") and dns.question.name : \"onedrive.live.com\" and\n       (process.code_signature.subject_name : \"Microsoft Corporation\" and process.code_signature.trusted == true)\n      ) or\n\n      /* Obsidian - Plugins are stored on raw.githubusercontent.com */\n      (process.name : \"Obsidian.exe\" and (process.code_signature.subject_name : \"Dynalist Inc\" and\n       process.code_signature.trusted == true) and dns.question.name : \"raw.githubusercontent.com\"\n      ) or\n\n      /* WebExperienceHostApp */\n      (process.name : \"WebExperienceHostApp.exe\" and (process.code_signature.subject_name : \"Microsoft Windows\" and\n       process.code_signature.trusted == true) and dns.question.name : (\"onedrive.live.com\", \"skyapi.onedrive.live.com\")\n      ) or\n\n      /* IntelliJ IDEA connecting to raw.githubusercontent.com */\n      (process.code_signature.subject_name : \"JetBrains s.r.o.\" and\n       process.code_signature.trusted == true and dns.question.name : (\"api.github.com\", \"raw.githubusercontent.com\")\n      ) or\n\n      (process.code_signature.subject_name : \"Microsoft *\" and process.code_signature.trusted == true and\n       dns.question.name : (\"*.sharepoint.com\", \"graph.microsoft.com\", \"g.live.com\", \"login.live.com\",\n                            \"*.blob.core.windows.net\", \"*.blob.storage.azure.net\")\n      ) or\n\n      (process.code_signature.subject_name : (\"Python Software Foundation\", \"Anaconda, Inc.\") and\n       process.code_signature.trusted == true and dns.question.name : \"files.pythonhosted.org\"\n      ) or\n\n      /* Zoom */\n      (process.name : \"Zoom.exe\" and (\n       process.code_signature.subject_name : (\"Zoom Video Communications, Inc.\", \"Zoom Communications, Inc.\") and\n       process.code_signature.trusted == true) and dns.question.name : (\"www.googleapis.com\", \"graph.microsoft.com\")\n      ) or\n\n      /* VSCode */\n      (process.name : \"Code.exe\" and (process.code_signature.subject_name : \"Microsoft Corporation\" and\n       process.code_signature.trusted == true) and dns.question.name : (\"api.github.com\", \"raw.githubusercontent.com\")\n      ) or\n\n      /* Terraform */\n      (process.name : \"terraform-provider*.exe\" and (process.code_signature.subject_name : \"HashiCorp, Inc.\" and\n       process.code_signature.trusted == true) and dns.question.name : \"graph.microsoft.com\"\n      ) or\n\n      (\n        process.code_signature.trusted == true and\n        process.code_signature.subject_name : (\n                              \"Johannes Schindelin\",\n                              \"Redis Inc.\",\n                              \"Slack Technologies, LLC\",\n                              \"Cisco Systems, Inc.\",\n                              \"Dropbox, Inc\",\n                              \"Amazon.com Services LLC\",\n                              \"Island Technology Inc.\",\n                              \"GitHub, Inc.\",\n                              \"Red Hat, Inc\",\n                              \"Mozilla Corporation\"\n        )\n      )\n    )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/command_and_control_common_webservices.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Resources: Investigation Guide",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne"
    ]
  }
}