{
  "id": "32ea5d2f-52a9-55cc-9ef3-4fe11fe17791",
  "catalog": "elastic",
  "name": "Lateral Movement - Remote Service",
  "description": "Detects service creation for lateral movement",
  "severity": "high",
  "mitre_techniques": [
    "attack.t1021.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sc.exe"
      ],
      "raw_values": [
        "sc.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "*create*"
      ],
      "raw_values": [
        "*create*"
      ]
    }
  ],
  "raw_query": "process where process.name == \"sc.exe\" and process.command_line like~ \"*create*\"",
  "language": "eql",
  "translated_query": null,
  "source_path": "demo",
  "metadata": {}
}