{
  "id": "3f9bd61e-4d04-5ed0-a23a-7126aa0319b3",
  "catalog": "elastic",
  "name": "Curl or Wget Egress Network Connection via LoLBin",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "fail2ban_cluster.sh",
        "downloadartifacts.sh",
        "rkhunter",
        "bbb-conf",
        "sos",
        "make",
        "spamassassin",
        "run-crons",
        "spamassassin-maint",
        "oracle-libs-update"
      ],
      "raw_values": [
        "/usr/local/bin/fail2ban_cluster.sh",
        "/script/downloadArtifacts.sh",
        "/etc/cron.daily/rkhunter",
        "/usr/bin/bbb-conf",
        "/usr/sbin/sos",
        "/usr/bin/make",
        "/var/lib/amagent/*",
        "/etc/cron.daily/spamassassin",
        "/usr/lib/cron/run-crons",
        "/usr/sbin/spamassassin-maint",
        "/usr/sbin/oracle-libs-update"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "homebrew",
        "webhook",
        "provision-*.sh",
        "update-certificates.sh",
        "update_mmdb.sh"
      ],
      "raw_values": [
        "*/home/linuxbrew/.linuxbrew/*",
        "*Homebrew*",
        "*webhook*",
        "/usr/lib/jvm/*",
        "/root/.forge/provision-*.sh",
        "/usr/src/ucrm/scripts/update-certificates.sh",
        "/etc/periodic/weekly/update_mmdb.sh"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "aa-exec",
        "aoss",
        "awk",
        "run-parts",
        "bundle",
        "bundler",
        "busctl",
        "busybox",
        "byebug",
        "c89",
        "c99",
        "cabal",
        "capsh",
        "cdist",
        "certbot",
        "check_by_ssh",
        "choom",
        "cobc",
        "cowsay",
        "cowthink",
        "cpio",
        "cpulimit",
        "csvtool",
        "distcc",
        "easy_install",
        "emacs",
        "enscript",
        "expect",
        "find",
        "flock",
        "gawk",
        "gcc",
        "gdb",
        "gem",
        "genie",
        "ghc",
        "ghci",
        "gimp",
        "grc",
        "gtester",
        "ionice",
        "irb",
        "jjs",
        "jrunscript",
        "knife",
        "latex",
        "latexmk",
        "lftp",
        "logsave",
        "ltrace",
        "mail",
        "mawk",
        "msgfilter",
        "multitime",
        "mysql",
        "nawk",
        "neofetch",
        "nice",
        "nohup",
        "npm",
        "nroff",
        "nsenter",
        "octave",
        "openvpn",
        "pandoc",
        "pdb",
        "pdflatex",
        "pdftex",
        "perf",
        "pexec",
        "pip",
        "rake",
        "rlwrap",
        "rpmdb",
        "rpmquery",
        "rpmverify",
        "rsync",
        "rtorrent",
        "runscript",
        "rview",
        "rvim",
        "script",
        "scrot",
        "sed",
        "service",
        "setarch",
        "setlock",
        "socat",
        "softlimit",
        "split",
        "sqlite3",
        "sqlmap",
        "sshpass",
        "start-stop-daemon",
        "stdbuf",
        "tar",
        "taskset",
        "tasksh",
        "tex",
        "time",
        "tmate",
        "torify",
        "torsocks",
        "tshark",
        "valgrind",
        "view",
        "vim",
        "vimdiff",
        "watch",
        "xdg-user-dir",
        "xdotool",
        "xelatex",
        "xetex",
        "yarn",
        "zip",
        "zypper",
        "wget",
        "curl"
      ],
      "raw_values": [
        "aa-exec",
        "aoss",
        "awk",
        "run-parts",
        "bundle",
        "bundler",
        "busctl",
        "busybox",
        "byebug",
        "c89",
        "c99",
        "cabal",
        "capsh",
        "cdist",
        "certbot",
        "check_by_ssh",
        "choom",
        "cobc",
        "cowsay",
        "cowthink",
        "cpio",
        "cpulimit",
        "csvtool",
        "dc",
        "distcc",
        "easy_install",
        "emacs",
        "enscript",
        "expect",
        "find",
        "flock",
        "gawk",
        "gcc",
        "gdb",
        "gem",
        "genie",
        "ghc",
        "ghci",
        "gimp",
        "grc",
        "gtester",
        "ionice",
        "irb",
        "jjs",
        "jrunscript",
        "knife",
        "latex",
        "latexmk",
        "lftp",
        "logsave",
        "ltrace",
        "mail",
        "mawk",
        "msgfilter",
        "multitime",
        "mysql",
        "nawk",
        "neofetch",
        "nice",
        "nohup",
        "npm",
        "nroff",
        "nsenter",
        "octave",
        "openvpn",
        "pandoc",
        "pdb",
        "pdflatex",
        "pdftex",
        "perf",
        "pexec",
        "pip",
        "rake",
        "rc",
        "rlwrap",
        "rpmdb",
        "rpmquery",
        "rpmverify",
        "rsync",
        "rtorrent",
        "runscript",
        "rview",
        "rvim",
        "script",
        "scrot",
        "sed",
        "service",
        "setarch",
        "setlock",
        "sg",
        "socat",
        "softlimit",
        "split",
        "sqlite3",
        "sqlmap",
        "sshpass",
        "start-stop-daemon",
        "stdbuf",
        "tar",
        "taskset",
        "tasksh",
        "tex",
        "time",
        "tmate",
        "torify",
        "torsocks",
        "tshark",
        "valgrind",
        "vi",
        "view",
        "vim",
        "vimdiff",
        "watch",
        "xdg-user-dir",
        "xdotool",
        "xelatex",
        "xetex",
        "yarn",
        "zip",
        "zypper",
        "wget",
        "curl"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": "in",
      "values": [
        "/etc/.agent/server_agent.sh",
        "/nessus/update2.sh",
        "/etc/cron.daily/spamassassin",
        "/etc/cron.daily/rkhunter",
        "buildkit-runc",
        "/usr/sbin/spamassassin-maint"
      ],
      "raw_values": [
        "/etc/.agent/server_agent.sh",
        "/nessus/update2.sh",
        "/etc/cron.daily/spamassassin",
        "/etc/cron.daily/rkhunter",
        "buildkit-runc",
        "/usr/sbin/spamassassin-maint"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "rkhunter",
        "vivaldi-stable.postinst",
        "runc"
      ],
      "raw_values": [
        "rkhunter",
        "vivaldi-stable.postinst",
        "runc"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "in",
      "values": [
        "update",
        "xargs -n 1 curl -o lpsc -l",
        "rake run:server_hooks",
        "update2.sh"
      ],
      "raw_values": [
        "nice -10 /opt/aws/discovery/update",
        "xargs -n 1 curl -o lpsc -L",
        "/usr/bin/ruby /usr/bin/rake run:server_hooks",
        "nohup ./update2.sh"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": "in",
      "values": [
        "null 2>&1",
        "rkhunter"
      ],
      "raw_values": [
        "/bin/sh -c nice -n 15 $HOME/bin/cron.pl > /dev/null 2>&1",
        "/bin/sh /etc/cron.daily/rkhunter"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec",
        "connection_attempted"
      ],
      "raw_values": [
        "exec",
        "connection_attempted"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "==",
      "values": [
        "unshare",
        "nohup",
        "julia"
      ],
      "raw_values": [
        "/tmp/newroot/unshare",
        "nohup",
        "julia"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": "==",
      "values": [
        "runc init"
      ],
      "raw_values": [
        "runc init"
      ]
    },
    {
      "field": "process.parent.command_line",
      "raw_field": "process.parent.command_line",
      "operator": "like",
      "values": [
        "downloadexchangefiles_mcx"
      ],
      "raw_values": [
        "/home/*/bin/DownloadExchangeFiles_mcx*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like",
      "values": [
        ".sh"
      ],
      "raw_values": [
        "nohup /usr/*/*.sh"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "==",
      "values": [
        "julia"
      ],
      "raw_values": [
        "julia"
      ]
    },
    {
      "field": "destination.ip",
      "raw_field": "destination.ip",
      "operator": "==",
      "values": [
        "0.0.0.0"
      ],
      "raw_values": [
        "0.0.0.0"
      ]
    }
  ],
  "raw_query": "sequence with maxspan=3s\n  [process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.name in (\n     \"aa-exec\", \"aoss\", \"awk\", \"run-parts\", \"bundle\", \"bundler\", \"busctl\", \"busybox\", \"byebug\", \"c89\", \"c99\", \"cabal\",\n     \"capsh\", \"cdist\", \"certbot\", \"check_by_ssh\", \"choom\", \"cobc\", \"cowsay\", \"cowthink\", \"cpio\", \"cpulimit\", \"csvtool\",\n     \"dc\", \"distcc\", \"easy_install\", \"emacs\", \"enscript\", \"expect\", \"find\", \"flock\", \"gawk\", \"gcc\", \"gdb\", \"gem\",\n     \"genie\", \"ghc\", \"ghci\", \"gimp\", \"grc\", \"gtester\", \"ionice\", \"irb\", \"jjs\", \"jrunscript\", \"knife\", \"latex\",\n     \"latexmk\", \"lftp\", \"logsave\", \"ltrace\", \"mail\", \"mawk\", \"msgfilter\", \"multitime\", \"mysql\", \"nawk\", \"neofetch\",\n     \"nice\", \"nohup\", \"npm\", \"nroff\", \"nsenter\", \"octave\", \"openvpn\", \"pandoc\", \"pdb\", \"pdflatex\", \"pdftex\", \"perf\",\n     \"pexec\", \"pip\", \"rake\", \"rc\", \"rlwrap\", \"rpmdb\", \"rpmquery\", \"rpmverify\", \"rsync\", \"rtorrent\", \"runscript\",\n     \"rview\", \"rvim\", \"script\", \"scrot\", \"sed\", \"service\", \"setarch\", \"setlock\", \"sg\", \"socat\", \"softlimit\", \"split\",\n     \"sqlite3\", \"sqlmap\", \"sshpass\", \"start-stop-daemon\", \"stdbuf\", \"tar\", \"taskset\",\n     \"tasksh\", \"tex\", \"time\", \"tmate\", \"torify\", \"torsocks\", \"tshark\", \"valgrind\", \"vi\", \"view\",\n     \"vim\", \"vimdiff\", \"watch\", \"xdg-user-dir\", \"xdotool\", \"xelatex\", \"xetex\", \"yarn\", \"zip\", \"zypper\"\n   ) and not (\n     process.executable == \"/tmp/newroot/unshare\" or\n     process.parent.args in (\n       \"/etc/.agent/server_agent.sh\", \"/nessus/update2.sh\", \"/etc/cron.daily/spamassassin\", \"/etc/cron.daily/rkhunter\",\n       \"buildkit-runc\", \"/usr/sbin/spamassassin-maint\"\n     ) or\n     process.parent.executable like (\n       \"/usr/local/bin/fail2ban_cluster.sh\", \"/script/downloadArtifacts.sh\", \"/etc/cron.daily/rkhunter\",\n       \"/usr/bin/bbb-conf\", \"/usr/sbin/sos\", \"/usr/bin/make\", \"/var/lib/amagent/*\", \"/etc/cron.daily/spamassassin\",\n       \"/usr/lib/cron/run-crons\", \"/usr/sbin/spamassassin-maint\", \"/usr/sbin/oracle-libs-update\"\n     ) or\n     process.parent.name in (\"rkhunter\", \"vivaldi-stable.postinst\", \"runc\") or\n     process.parent.command_line == \"runc init\" or\n     process.parent.command_line like \"/home/*/bin/DownloadExchangeFiles_mcx*\" or\n     process.command_line in (\n       \"nice -10 /opt/aws/discovery/update\", \"xargs -n 1 curl -o lpsc -L\", \"/usr/bin/ruby /usr/bin/rake run:server_hooks\",\n       \"nohup ./update2.sh\"\n     ) or\n     process.parent.command_line in (\"/bin/sh -c nice -n 15 $HOME/bin/cron.pl > /dev/null 2>&1\", \"/bin/sh /etc/cron.daily/rkhunter\") or\n     process.command_line like (\"*/home/linuxbrew/.linuxbrew/*\", \"*Homebrew*\", \"*webhook*\") or\n     process.args like (\"/usr/lib/jvm/*\", \"/root/.forge/provision-*.sh\", \"/usr/src/ucrm/scripts/update-certificates.sh\", \"/etc/periodic/weekly/update_mmdb.sh\") or\n     (process.name == \"nohup\" and process.command_line like \"nohup /usr/*/*.sh\") or\n     (process.name == \"julia\" and process.parent.name == \"julia\")\n   )\n  ] by process.entity_id\n  [network where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"connection_attempted\" and\n   process.name in (\"wget\", \"curl\") and not (\n     destination.ip == null or destination.ip == \"0.0.0.0\" or cidrmatch(\n       destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\", \"192.0.0.0/29\",\n       \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\", \"192.0.2.0/24\",\n       \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\",\n       \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\", \"FE80::/10\",\n       \"FF00::/8\"\n     )\n   )\n  ] by process.parent.entity_id\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/defense_evasion_curl_or_wget_executed_via_lolbin.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Execution",
      "Tactic: Command and Control",
      "Tactic: Exfiltration",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}