{
  "id": "401541a1-338e-5224-8b74-1ac657992c35",
  "catalog": "elastic",
  "name": "WDAC Policy File by an Unusual Process",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.defense-evasion"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.extension",
      "raw_field": "file.extension",
      "operator": ":",
      "values": [
        "p7b",
        "cip"
      ],
      "raw_values": [
        "p7b",
        "cip"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".p7b",
        ".cip"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\System32\\\\CodeIntegrity\\\\*.p7b",
        "?:\\\\Windows\\\\System32\\\\CodeIntegrity\\\\CiPolicies\\\\Active\\\\*.cip",
        "\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\CodeIntegrity\\\\*.p7b",
        "\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\CodeIntegrity\\\\CiPolicies\\\\Active\\\\*.cip"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "poqexec.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\System32\\\\poqexec.exe",
        "\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\poqexec.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "!=",
      "values": [
        "deletion"
      ],
      "raw_values": [
        "deletion"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"windows\" and event.action != \"deletion\" and\n  file.extension : (\"p7b\", \"cip\") and\n  file.path : (\n    \"?:\\\\Windows\\\\System32\\\\CodeIntegrity\\\\*.p7b\",\n    \"?:\\\\Windows\\\\System32\\\\CodeIntegrity\\\\CiPolicies\\\\Active\\\\*.cip\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\CodeIntegrity\\\\*.p7b\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\CodeIntegrity\\\\CiPolicies\\\\Active\\\\*.cip\"\n  ) and\n  not process.executable : (\n    \"C:\\\\Windows\\\\System32\\\\poqexec.exe\",\n    \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\System32\\\\poqexec.exe\"\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_wdac_policy_by_unusual_process.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Endgame",
      "Resources: Investigation Guide",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike"
    ]
  }
}