{
  "id": "41a0f394-4066-5d1c-9c39-9f41c1449b6a",
  "catalog": "elastic",
  "name": "High Number of Closed Pull Requests by User",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.impact",
    "attack.exfiltration"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "github.audit"
      ],
      "raw_values": [
        "github.audit"
      ]
    },
    {
      "field": "github.category",
      "raw_field": "github.category",
      "operator": "==",
      "values": [
        "pull_request"
      ],
      "raw_values": [
        "pull_request"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change"
      ],
      "raw_values": [
        "change"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "pull_request.close"
      ],
      "raw_values": [
        "pull_request.close"
      ]
    }
  ],
  "raw_query": "from logs-github.audit-* metadata _id, _index, _version\n| where\n  data_stream.dataset == \"github.audit\" and\n  github.category == \"pull_request\" and\n  event.type == \"change\" and\n  event.action == \"pull_request.close\"\n| stats\n  Esql.document_count = COUNT(*),\n  Esql.github_org_values = values(github.org),\n  Esql.github_repo_values = values(github.repo),\n  Esql.github_user_agent_values = values(github.user_agent),\n  Esql.github_pull_request_url_values = values(github.pull_request_url),\n  Esql.user_name_values = values(user.name),\n  Esql.agent_id_values = values(agent.id),\n  Esql.data_stream_dataset_values = values(data_stream.dataset),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n\n  by user.name\n\n| keep Esql.*\n\n| where\n  Esql.document_count >= 10\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/integrations/github/impact_high_number_of_closed_pull_requests_by_user.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Cloud",
      "Use Case: Threat Detection",
      "Tactic: Impact",
      "Tactic: Exfiltration",
      "Data Source: Github",
      "Resources: Investigation Guide"
    ]
  }
}