{
  "id": "46305d20-7b2b-5376-a9f8-63b4ae599c9d",
  "catalog": "elastic",
  "name": "Suspicious Child Process of Adobe Acrobat Reader Update Service",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.privilege-escalation"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "com.adobe.armdc.smjobblesshelper",
        "codesign",
        "armdchammer",
        "pkgutil",
        "shasum",
        "perl",
        "spctl",
        "installer",
        "csrutil"
      ],
      "raw_values": [
        "/Library/PrivilegedHelperTools/com.adobe.ARMDC.SMJobBlessHelper",
        "/usr/bin/codesign",
        "/private/var/folders/zz/*/T/download/ARMDCHammer",
        "/usr/sbin/pkgutil",
        "/usr/bin/shasum",
        "/usr/bin/perl*",
        "/usr/sbin/spctl",
        "/usr/sbin/installer",
        "/usr/bin/csrutil"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "like",
      "values": [
        "com.adobe.armdc.smjobblesshelper"
      ],
      "raw_values": [
        "com.adobe.ARMDC.SMJobBlessHelper"
      ]
    },
    {
      "field": "user.name",
      "raw_field": "user.name",
      "operator": "==",
      "values": [
        "root"
      ],
      "raw_values": [
        "root"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n  process.parent.name like \"com.adobe.ARMDC.SMJobBlessHelper\" and\n  user.name == \"root\" and\n  not process.executable like (\"/Library/PrivilegedHelperTools/com.adobe.ARMDC.SMJobBlessHelper\",\n                               \"/usr/bin/codesign\",\n                               \"/private/var/folders/zz/*/T/download/ARMDCHammer\",\n                               \"/usr/sbin/pkgutil\",\n                               \"/usr/bin/shasum\",\n                               \"/usr/bin/perl*\",\n                               \"/usr/sbin/spctl\",\n                               \"/usr/sbin/installer\",\n                               \"/usr/bin/csrutil\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/privilege_escalation_exploit_adobe_acrobat_updater.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Use Case: Vulnerability",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}