{
  "id": "476bee08-d977-5bd2-8151-e6e22a797c72",
  "catalog": "elastic",
  "name": "Potential Hidden Process via Mount Hidepid",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "mount"
      ],
      "raw_values": [
        "mount"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "==",
      "values": [
        "proc"
      ],
      "raw_values": [
        "/proc",
        "-o"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "hidepid=2"
      ],
      "raw_values": [
        "*hidepid=2*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"executed\", \"process_started\") and\nprocess.name == \"mount\" and process.args == \"/proc\" and process.args == \"-o\" and process.args : \"*hidepid=2*\" and\nnot process.parent.command_line like \"/opt/cloudlinux/*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/defense_evasion_mount_execution.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Auditd Manager",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}