{
  "id": "47ef6096-d6e6-5eb6-a156-d3c617b37085",
  "catalog": "elastic",
  "name": "Potential External Linux SSH Brute Force Detected",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "ssh_login",
        "user_login"
      ],
      "raw_values": [
        "ssh_login",
        "user_login"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "failure"
      ],
      "raw_values": [
        "failure"
      ]
    }
  ],
  "raw_query": "sequence by host.id, source.ip, user.name with maxspan=30s\n  [ authentication where host.os.type == \"linux\" and \n   event.action in (\"ssh_login\", \"user_login\") and event.outcome == \"failure\" and\n   not cidrmatch(source.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",\n       \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\", \"192.0.0.171/32\",\n       \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\", \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\",\n       \"100.64.0.0/10\", \"192.175.48.0/24\",\"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \n       \"::1\", \"FE80::/10\", \"FF00::/8\") ] with runs = 60\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/credential_access_potential_linux_ssh_bruteforce_external.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Resources: Investigation Guide"
    ]
  }
}