{
  "id": "4897b926-b0ce-5b4f-9354-d04da13c3832",
  "catalog": "elastic",
  "name": "Active Directory Forced Authentication from Linux Host - SMB Named Pipes",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "spoolss",
        "netdfs",
        "lsarpc",
        "lsass",
        "netlogon",
        "samr",
        "efsrpc",
        "fssagentrpc"
      ],
      "raw_values": [
        "Spoolss",
        "netdfs",
        "lsarpc",
        "lsass",
        "netlogon",
        "samr",
        "efsrpc",
        "FssagentRpc"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux",
        "windows"
      ],
      "raw_values": [
        "linux",
        "windows"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "connection_attempted"
      ],
      "raw_values": [
        "connection_attempted"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "5145"
      ],
      "raw_values": [
        "5145"
      ]
    }
  ],
  "raw_query": "sequence with maxspan=15s\n[network where host.os.type == \"linux\" and event.action == \"connection_attempted\" and destination.port == 445 and not startswith~(string(destination.ip), string(host.ip))] by host.ip, data_stream.namespace\n[file where host.os.type == \"windows\" and event.code == \"5145\" and file.name : (\"Spoolss\", \"netdfs\", \"lsarpc\", \"lsass\", \"netlogon\", \"samr\", \"efsrpc\", \"FssagentRpc\")] by source.ip, data_stream.namespace\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/cross-platform/credential_access_forced_authentication_pipes.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Data Source: Active Directory",
      "Use Case: Active Directory Monitoring",
      "Data Source: Windows Security Event Logs",
      "Resources: Investigation Guide"
    ]
  }
}