{
  "id": "4d77251d-7083-5158-851f-36bce42002aa",
  "catalog": "elastic",
  "name": "FortiGate Administrator Login from Multiple IP Addresses",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "fortinet_fortigate.log"
      ],
      "raw_values": [
        "fortinet_fortigate.log"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "authentication"
      ],
      "raw_values": [
        "authentication"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "login"
      ],
      "raw_values": [
        "login"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "success"
      ],
      "raw_values": [
        "success"
      ]
    },
    {
      "field": "source.user.roles",
      "raw_field": "source.user.roles",
      "operator": "==",
      "values": [
        "administrator"
      ],
      "raw_values": [
        "Administrator"
      ]
    }
  ],
  "raw_query": "FROM logs-fortinet_fortigate.*, filebeat-* metadata _id\n\n| WHERE data_stream.dataset == \"fortinet_fortigate.log\" and\n        event.category == \"authentication\" and event.action == \"login\" and\n        event.outcome == \"success\" and source.user.roles == \"Administrator\" and\n        source.user.name is not null and source.ip is not null\n| stats Esql.logon_count = count(*),\n        Esql.source_ip_count_distinct = COUNT_DISTINCT(source.ip),\n        Esql.max_timestamp = MAX(@timestamp),\n        Esql.source_ip_values = VALUES(source.ip),\n        Esql.message_values = VALUES(message),\n        Esql.source_geo_country_name_values = VALUES(source.geo.country_name) by source.user.name\n\n// last logon event timestamp is within 6m of the rule execution time to avoid duplicates\n| eval Esql.recent = DATE_DIFF(\"minute\", Esql.max_timestamp, now())\n| where Esql.recent <= 6 and Esql.logon_count >= 2 and Esql.source_ip_count_distinct >= 2\n\n// move dynamic fields to ECS equivalent for rule exceptions\n| eval source.ip = MV_FIRST(Esql.source_ip_values)\n\n| keep source.ip, source.user.name, Esql.*\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/network/initial_access_fortigate_admin_login_multi_srcip.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Use Case: Threat Detection",
      "Tactic: Initial Access",
      "Resources: Investigation Guide",
      "Domain: Network",
      "Domain: Identity",
      "Data Source: Fortinet",
      "Data Source: Fortinet FortiGate"
    ]
  }
}