{
  "id": "4fb6d731-be33-5dfa-a87f-0da330008821",
  "catalog": "elastic",
  "name": "Processes with Trailing Spaces",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where event.type == \"start\" and event.action in (\"exec\", \"exec_event\", \"executed\", \"process_started\") and\nprocess.name : \"* \"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/cross-platform/defense_evasion_processes_with_trailing_spaces.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: Auditd Manager",
      "Resources: Investigation Guide"
    ]
  }
}