{
  "id": "50b2e57b-14bc-56d9-82c9-706a76f86eb9",
  "catalog": "elastic",
  "name": "Linux Telegram API Request",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.command-and-control"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "start",
        "exec_event",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "start",
        "exec_event",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "curl",
        "wget"
      ],
      "raw_values": [
        "curl",
        "wget"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like",
      "values": [
        "api.telegram.org"
      ],
      "raw_values": [
        "*api.telegram.org*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"start\", \"exec_event\", \"ProcessRollup2\", \"executed\", \"exec_event\", \"process_started\") and\nprocess.name in (\"curl\", \"wget\") and process.command_line like \"*api.telegram.org*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/command_and_control_telegram_api_request.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Data Source: Auditd Manager",
      "Resources: Investigation Guide"
    ]
  }
}