{
  "id": "548530ec-40b5-504c-b5bc-afb0fb3517be",
  "catalog": "elastic",
  "name": "Yum Package Manager Plugin File Creation",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vmis."
      ],
      "raw_values": [
        "/nix/store/*",
        "/var/lib/dpkg/*",
        "/tmp/vmis.*",
        "/snap/*",
        "/dev/fd/*",
        "/usr/lib/*",
        "/usr/libexec/*",
        "/etc/kernel/*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "rename",
        "creation"
      ],
      "raw_values": [
        "rename",
        "creation"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "in",
      "values": [
        "dockerd",
        "microdnf",
        "rpm",
        "snapd",
        "yum",
        "dnf",
        "podman",
        "dnf-automatic",
        "apk",
        "puppet",
        "chef-client",
        "autossl_check",
        "exe",
        "generate",
        "yumbackend.py",
        "crio"
      ],
      "raw_values": [
        "/bin/dockerd",
        "/usr/bin/dockerd",
        "/usr/sbin/dockerd",
        "/bin/microdnf",
        "/usr/bin/microdnf",
        "/bin/rpm",
        "/usr/bin/rpm",
        "/bin/snapd",
        "/usr/bin/snapd",
        "/bin/yum",
        "/usr/bin/yum",
        "/bin/dnf",
        "/usr/bin/dnf",
        "/bin/podman",
        "/usr/bin/podman",
        "/bin/dnf-automatic",
        "/usr/bin/dnf-automatic",
        "/sbin/apk",
        "/usr/sbin/apk",
        "/usr/local/sbin/apk",
        "/usr/bin/puppet",
        "/bin/puppet",
        "/opt/puppetlabs/puppet/bin/puppet",
        "/usr/bin/chef-client",
        "/bin/chef-client",
        "/bin/autossl_check",
        "/usr/bin/autossl_check",
        "/proc/self/exe",
        "/usr/lib/snapd/snapd",
        "/usr/local/bin/dockerd",
        "/usr/libexec/netplan/generate",
        "./usr/bin/podman",
        "yumBackend.py",
        "crio",
        "dockerd"
      ]
    },
    {
      "field": "file.extension",
      "raw_field": "file.extension",
      "operator": "in",
      "values": [
        "swp",
        "swpx",
        "swx"
      ],
      "raw_values": [
        "swp",
        "swpx",
        "swx"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "file.ext.original.name",
      "raw_field": "file.Ext.original.name",
      "operator": "like",
      "values": [
        ".ansible"
      ],
      "raw_values": [
        ".ansible*"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": "like",
      "values": [
        ".ansible_tmp"
      ],
      "raw_values": [
        ".ansible_tmp*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sed",
        "perl"
      ],
      "raw_values": [
        "sed",
        "perl"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "sed",
        "e2scrub_all.tmp"
      ],
      "raw_values": [
        "sed*",
        "e2scrub_all.tmp*"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"linux\" and event.action in (\"rename\", \"creation\") and\nfile.path : (\"/usr/lib/yum-plugins/*\", \"/etc/yum/pluginconf.d/*\") and not (\n  process.executable in (\n    \"/bin/dockerd\", \"/usr/bin/dockerd\", \"/usr/sbin/dockerd\", \"/bin/microdnf\", \"/usr/bin/microdnf\", \"/bin/rpm\",\n    \"/usr/bin/rpm\", \"/bin/snapd\", \"/usr/bin/snapd\", \"/bin/yum\", \"/usr/bin/yum\", \"/bin/dnf\", \"/usr/bin/dnf\",\n    \"/bin/podman\", \"/usr/bin/podman\", \"/bin/dnf-automatic\", \"/usr/bin/dnf-automatic\", \"/sbin/apk\", \"/usr/sbin/apk\",\n    \"/usr/local/sbin/apk\", \"/bin/podman\", \"/usr/bin/podman\", \"/usr/bin/puppet\", \"/bin/puppet\",\n    \"/opt/puppetlabs/puppet/bin/puppet\", \"/usr/bin/chef-client\", \"/bin/chef-client\", \"/bin/autossl_check\",\n    \"/usr/bin/autossl_check\", \"/proc/self/exe\", \"/usr/lib/snapd/snapd\", \"/usr/local/bin/dockerd\",\n    \"/usr/libexec/netplan/generate\", \"./usr/bin/podman\"\n  ) or\n  process.name in (\"yumBackend.py\", \"crio\", \"dockerd\") or\n  file.extension in (\"swp\", \"swpx\", \"swx\") or\n  file.Ext.original.name like \".ansible*\" or\n  file.name like \".ansible_tmp*\" or\n  process.executable : (\n    \"/nix/store/*\", \"/var/lib/dpkg/*\", \"/tmp/vmis.*\", \"/snap/*\", \"/dev/fd/*\", \"/usr/lib/*\", \"/usr/libexec/*\",\n    \"/etc/kernel/*\"\n\n  ) or\n  process.executable == null or\n  (process.name == \"sed\" and file.name : \"sed*\") or\n  (process.name == \"perl\" and file.name : \"e2scrub_all.tmp*\")\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_yum_package_manager_plugin_file_creation.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}