{
  "id": "54a372a6-08e0-5b21-befe-2565c9518d1c",
  "catalog": "elastic",
  "name": "Remote SSH Login Enabled via systemsetup Command",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "jamf",
        "xpcproxy",
        "sudo"
      ],
      "raw_values": [
        "/usr/local/jamf/bin/jamf",
        "/usr/libexec/xpcproxy",
        "/usr/bin/sudo"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "systemsetup"
      ],
      "raw_values": [
        "systemsetup"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like~",
      "values": [
        "-setremotelogin"
      ],
      "raw_values": [
        "-setremotelogin",
        "on"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n process.name == \"systemsetup\" and\n process.args like~ \"-setremotelogin\" and \n process.args like~ \"on\" and\n process.parent.executable != null and\n not process.parent.executable like (\"/usr/local/jamf/bin/jamf\", \"/usr/libexec/xpcproxy\", \"/usr/bin/sudo\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/lateral_movement_remote_ssh_login_enabled.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Lateral Movement",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}