{
  "id": "5cf1d4de-269a-5770-a674-a620fdb06122",
  "catalog": "elastic",
  "name": "FortiGate Overly Permissive Firewall Policy Created",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.defense-evasion"
  ],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "fortinet.firewall.action",
      "raw_field": "fortinet.firewall.action",
      "operator": "in",
      "values": [
        "add",
        "edit"
      ],
      "raw_values": [
        "Add",
        "Edit"
      ]
    },
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "fortinet_fortigate.log"
      ],
      "raw_values": [
        "fortinet_fortigate.log"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "0100044547"
      ],
      "raw_values": [
        "0100044547"
      ]
    },
    {
      "field": "fortinet.firewall.cfgpath",
      "raw_field": "fortinet.firewall.cfgpath",
      "operator": "==",
      "values": [
        "firewall.policy"
      ],
      "raw_values": [
        "firewall.policy"
      ]
    },
    {
      "field": "fortinet.firewall.cfgattr",
      "raw_field": "fortinet.firewall.cfgattr",
      "operator": "like~",
      "values": [
        "srcaddr[all]",
        "dstaddr[all]",
        "service[all]"
      ],
      "raw_values": [
        "*srcaddr[all]*",
        "*dstaddr[all]*",
        "*service[all]*"
      ]
    }
  ],
  "raw_query": "any where data_stream.dataset == \"fortinet_fortigate.log\" and\n    event.code == \"0100044547\" and\n    fortinet.firewall.cfgpath == \"firewall.policy\" and\n    fortinet.firewall.action in (\"Add\", \"Edit\") and\n    fortinet.firewall.cfgattr like~ \"*srcaddr[all]*\" and\n    fortinet.firewall.cfgattr like~ \"*dstaddr[all]*\" and\n    fortinet.firewall.cfgattr like~ \"*service[all]*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/network/defense_evasion_fortigate_overly_permissive_firewall_policy.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Resources: Investigation Guide",
      "Domain: Network",
      "Data Source: Fortinet",
      "Data Source: Fortinet FortiGate"
    ]
  }
}