{
  "id": "63957ace-170a-5808-a223-c8114566cbd8",
  "catalog": "elastic",
  "name": "Potential Traffic Tunneling using QEMU",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "-netdev",
        "-nographic",
        "connect=",
        "restrict=off",
        "hostfwd="
      ],
      "raw_values": [
        "-netdev",
        "-nographic",
        "*connect=*",
        "*restrict=off*",
        "*hostfwd=*"
      ]
    }
  ],
  "raw_query": "process where event.type == \"start\" and\n process.args : \"-netdev\" and\n (\n  (process.args : \"-nographic\" and process.command_line : \"*connect=*\" and process.command_line : \"*restrict=off*\") or\n   process.command_line : \"*hostfwd=*\"\n )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/cross-platform/command_and_control_tunnel_qemu.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "OS: Linux",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Windows Security Event Logs",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}