{
  "id": "6457c0da-1be5-50f8-bd3b-acac2fc68625",
  "catalog": "elastic",
  "name": "Potential Persistence via Periodic Tasks",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "periodic.conf"
      ],
      "raw_values": [
        "/private/etc/periodic/*",
        "/private/etc/defaults/periodic.conf",
        "/private/etc/periodic.conf"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "modification"
      ],
      "raw_values": [
        "modification"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"macos\" and event.action == \"modification\" and\n file.path like (\"/private/etc/periodic/*\", \"/private/etc/defaults/periodic.conf\", \"/private/etc/periodic.conf\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/persistence_periodic_tasks_file_mdofiy.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}