{
  "id": "66c2dc1c-41a0-54ab-a84d-eeb2d2f465cb",
  "catalog": "elastic",
  "name": "Several Failed Protected Branch Force Pushes by User",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "github.audit"
      ],
      "raw_values": [
        "github.audit"
      ]
    },
    {
      "field": "github.category",
      "raw_field": "github.category",
      "operator": "==",
      "values": [
        "protected_branch"
      ],
      "raw_values": [
        "protected_branch"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "protected_branch.rejected_ref_update"
      ],
      "raw_values": [
        "protected_branch.rejected_ref_update"
      ]
    }
  ],
  "raw_query": "from logs-github.audit-* metadata _id, _index, _version\n| where\n  data_stream.dataset == \"github.audit\" and\n  github.category == \"protected_branch\" and\n  event.action == \"protected_branch.rejected_ref_update\"\n| stats\n  Esql.document_count = COUNT(*),\n  Esql.github_org_values = values(github.org),\n  Esql.github_repo_values = values(github.repo),\n  Esql.github_branch_values = values(github.branch),\n  Esql.github_reasons_code_values = values(github.reasons.code),\n  Esql.github_reasons_message_value = values(github.reasons.message),\n  Esql.user_name_values = values(user.name),\n  Esql.agent_id_values = values(agent.id),\n  Esql.data_stream_dataset_values = values(data_stream.dataset),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n\n  by user.name\n\n| keep Esql.*\n\n| where\n  Esql.document_count >= 5\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/integrations/github/impact_high_number_of_failed_protected_branch_force_pushes_by_user.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Cloud",
      "Use Case: Threat Detection",
      "Tactic: Impact",
      "Tactic: Exfiltration",
      "Data Source: Github",
      "Resources: Investigation Guide"
    ]
  }
}