{
  "id": "66edeb62-ddd7-5e30-a61d-9e74659da559",
  "catalog": "elastic",
  "name": "Werfault ReflectDebugger Persistence",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "registry"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change"
      ],
      "raw_values": [
        "change"
      ]
    },
    {
      "field": "registry.value",
      "raw_field": "registry.value",
      "operator": ":",
      "values": [
        "reflectdebugger"
      ],
      "raw_values": [
        "ReflectDebugger"
      ]
    }
  ],
  "raw_query": "registry where host.os.type == \"windows\" and event.type == \"change\" and\n  registry.value : \"ReflectDebugger\"\n\n  /*\n    Full registry key path omitted due to data source variations:\n    HKLM\\\\Software\\\\Microsoft\\\\Windows\\\\Windows Error Reporting\\\\Hangs\\\\ReflectDebugger\n  */\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/persistence_werfault_reflectdebugger.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: SentinelOne",
      "Data Source: Sysmon",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}