{
  "id": "66f67f21-efa5-5484-b237-c1a0d1a2e248",
  "catalog": "elastic",
  "name": "Potential Network Scan Detected",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "network_flow",
        "flow_started"
      ],
      "raw_values": [
        "network_flow",
        "flow_started"
      ]
    }
  ],
  "raw_query": "from logs-network_traffic.*, packetbeat-*, logs-panw.panos*\n| mv_expand event.action\n| where event.action in (\"network_flow\", \"flow_started\") and destination.port is not null and source.ip is not null and destination.ip is not null\n| eval Esql.time_window = DATE_TRUNC(1min, @timestamp)\n| where CIDR_MATCH(source.ip, \"10.0.0.0/8\", \"172.16.0.0/12\", \"192.168.0.0/16\")\n| eval sensitive_port = case(destination.port IN (21, 22, 23, 53, 88, 139, 389, 445, 3389, 5900, 5985, 5986, 9389), true, false)\n| stats\n    Esql.count_distinct_destination_ports = COUNT_DISTINCT(destination.port),\n    Esql.count_distinct_sensitive_ports = COUNT_DISTINCT(destination.port) where sensitive_port == true,\n    Esql.values_destination_ports = VALUES(destination.port),\n    Esql.values_sensitive_ports = VALUES(destination.port) where sensitive_port == true\n  by Esql.time_window, destination.ip, source.ip\n| where (Esql.count_distinct_destination_ports >= 50 or Esql.count_distinct_sensitive_ports >= 5)\n| keep source.ip, destination.ip, Esql.*\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/network/discovery_potential_port_scan_detected.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Network",
      "Tactic: Discovery",
      "Tactic: Reconnaissance",
      "Use Case: Network Security Monitoring",
      "Data Source: PAN-OS",
      "Resources: Investigation Guide"
    ]
  }
}