{
  "id": "6901c3bc-dac5-567b-8f5c-826ca883d1d9",
  "catalog": "elastic",
  "name": "Multiple Device Token Hashes for Single Okta Session",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "policy.evaluate_sign_on",
        "user.session.start",
        "user.authentication.sso"
      ],
      "raw_values": [
        "policy.evaluate_sign_on",
        "user.session.start",
        "user.authentication.sso"
      ]
    },
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "okta.system"
      ],
      "raw_values": [
        "okta.system"
      ]
    },
    {
      "field": "okta.actor.alternate_id",
      "raw_field": "okta.actor.alternate_id",
      "operator": "!=",
      "values": [
        "system@okta.com"
      ],
      "raw_values": [
        "system@okta.com"
      ]
    },
    {
      "field": "r",
      "raw_field": "r",
      "operator": "like",
      "values": [
        "[^@\\\\s]+\\\\@[^@\\\\s]+"
      ],
      "raw_values": [
        "[^@\\\\s]+\\\\@[^@\\\\s]+"
      ]
    },
    {
      "field": "okta.authentication_context.external_session_id",
      "raw_field": "okta.authentication_context.external_session_id",
      "operator": "!=",
      "values": [
        "unknown"
      ],
      "raw_values": [
        "unknown"
      ]
    }
  ],
  "raw_query": "from logs-okta*\n| where\n    data_stream.dataset == \"okta.system\" and\n    not event.action in (\n        \"policy.evaluate_sign_on\",\n        \"user.session.start\",\n        \"user.authentication.sso\"\n    ) and\n    okta.actor.alternate_id != \"system@okta.com\" and\n    okta.actor.alternate_id rlike \"[^@\\\\s]+\\\\@[^@\\\\s]+\" and\n    okta.authentication_context.external_session_id != \"unknown\"\n| keep\n    event.action,\n    okta.actor.alternate_id,\n    okta.authentication_context.external_session_id,\n    okta.debug_context.debug_data.dt_hash\n| stats\n    Esql.okta_debug_context_debug_data_dt_hash_count_distinct = count_distinct(okta.debug_context.debug_data.dt_hash)\n  by\n    okta.actor.alternate_id,\n    okta.authentication_context.external_session_id\n| where\n    Esql.okta_debug_context_debug_data_dt_hash_count_distinct >= 2\n| sort\n    Esql.okta_debug_context_debug_data_dt_hash_count_distinct desc\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/integrations/okta/credential_access_multiple_device_token_hashes_for_single_okta_session.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Use Case: Identity and Access Audit",
      "Data Source: Okta",
      "Tactic: Credential Access",
      "Domain: SaaS",
      "Resources: Investigation Guide"
    ]
  }
}