{
  "id": "6be1c568-2593-50aa-8fc0-c6de003a43b3",
  "catalog": "elastic",
  "name": "Potential Linux Credential Dumping via Unshadow",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "unshadow"
      ],
      "raw_values": [
        "unshadow"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\") and\nprocess.name == \"unshadow\" and process.args_count >= 3\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/credential_access_credential_dumping.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}