{
  "id": "6c0f5126-be81-5818-b562-c1099cb7c9e3",
  "catalog": "elastic",
  "name": "DNS Request for IP Lookup Service via Unsigned Binary",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "dns"
  ],
  "conditions": [
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": "like~",
      "values": [
        "ip-api.com",
        "ipwho.is",
        "checkip.dyndns.org",
        "api.ipify.org",
        "api.npoint.io",
        "whatismyip.akamai.com",
        "bot.whatismyipaddress.com",
        "ifcfg.me",
        "ifconfig.me",
        "ident.me",
        "ipof.in",
        "ip.tyk.nu",
        "ipwhois.app",
        "freeipapi.com",
        "icanhazip.com",
        "curlmyip.com",
        "wgetip.com",
        "eth0.me",
        "ipecho.net",
        "ip.appspot.com",
        "api.myip.com",
        "geoiptool.com",
        "api.2ip.ua",
        "api.ip.sb",
        "ipinfo.io",
        "checkip.amazonaws.com",
        "wtfismyip.com",
        "iplogger.",
        "freegeoip.net",
        "freegeoip.app",
        "myip.ipip.net",
        "geoplugin.net",
        "myip.dnsomatic.com",
        "www.geoplugin.net",
        "api64.ipify.org",
        "ip4.seeip.org",
        ".geojs.io",
        "portmap.io",
        "api.db-ip.com",
        "geolocation-db.com",
        "inet-ip.info",
        "httpbin.org",
        "myip.opendns.com"
      ],
      "raw_values": [
        "*ip-api.com*",
        "*ipwho.is*",
        "*checkip.dyndns.org*",
        "*api.ipify.org*",
        "*api.npoint.io*",
        "*whatismyip.akamai.com*",
        "*bot.whatismyipaddress.com*",
        "*ifcfg.me*",
        "*ifconfig.me*",
        "*ident.me*",
        "*ipof.in*",
        "*ip.tyk.nu*",
        "*ipwhois.app*",
        "*freeipapi.com*",
        "*icanhazip.com*",
        "*curlmyip.com*",
        "*wgetip.com*",
        "*eth0.me*",
        "*ipecho.net*",
        "*ip.appspot.com*",
        "*api.myip.com*",
        "*geoiptool.com*",
        "*api.2ip.ua*",
        "*api.ip.sb*",
        "*ipinfo.io*",
        "*checkip.amazonaws.com*",
        "*wtfismyip.com*",
        "*iplogger.*",
        "*freegeoip.net*",
        "*freegeoip.app*",
        "*myip.ipip.net*",
        "*geoplugin.net*",
        "*myip.dnsomatic.com*",
        "*www.geoplugin.net*",
        "*api64.ipify.org*",
        "*ip4.seeip.org*",
        "*.geojs.io*",
        "*portmap.io*",
        "*api.db-ip.com*",
        "*geolocation-db.com*",
        "*inet-ip.info*",
        "*httpbin.org*",
        "*myip.opendns.com*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "lookup_result"
      ],
      "raw_values": [
        "lookup_result"
      ]
    }
  ],
  "raw_query": "dns where host.os.type == \"macos\" and event.action == \"lookup_result\" and \n  (process.code_signature.trusted == false or process.code_signature.exists == false) and\n  dns.question.name like~ (\"*ip-api.com*\", \"*ipwho.is*\", \"*checkip.dyndns.org*\", \"*api.ipify.org*\",\n                           \"*api.npoint.io*\", \"*whatismyip.akamai.com*\", \"*bot.whatismyipaddress.com*\",\n                           \"*ifcfg.me*\", \"*ifconfig.me*\", \"*ident.me*\", \"*ipof.in*\", \"*ip.tyk.nu*\",\n                           \"*ipwhois.app*\", \"*freeipapi.com*\", \"*icanhazip.com*\", \"*curlmyip.com*\",\n                           \"*wgetip.com*\", \"*eth0.me*\", \"*ipecho.net*\", \"*ip.appspot.com*\",\n                           \"*api.myip.com*\", \"*geoiptool.com*\", \"*api.2ip.ua*\", \"*api.ip.sb*\",\n                           \"*ipinfo.io*\", \"*checkip.amazonaws.com*\", \"*wtfismyip.com*\", \"*iplogger.*\",\n                           \"*freegeoip.net*\", \"*freegeoip.app*\", \"*myip.ipip.net*\", \"*geoplugin.net*\",\n                           \"*myip.dnsomatic.com*\", \"*www.geoplugin.net*\", \"*api64.ipify.org*\",\n                           \"*ip4.seeip.org*\", \"*.geojs.io*\", \"*portmap.io*\", \"*api.db-ip.com*\",\n                           \"*geolocation-db.com*\", \"*inet-ip.info*\", \"*httpbin.org*\", \"*myip.opendns.com*\") and\n  not process.executable like \"/Users/*/Library/Developer/CoreSimulator/*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/discovery_dns_request_for_ip_lookup_service.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Discovery",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}