{
  "id": "6e18092c-5563-598b-aa44-2306f58d60c2",
  "catalog": "elastic",
  "name": "Potential Etherhiding C2 via Blockchain Connection",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "python",
        "ruby",
        "perl",
        "tclsh"
      ],
      "raw_values": [
        "python*",
        "ruby*",
        "perl*",
        "tclsh*"
      ]
    },
    {
      "field": "destination.domain",
      "raw_field": "destination.domain",
      "operator": ":",
      "values": [
        "eth-mainnet",
        "ethereum",
        "eth.*.com"
      ],
      "raw_values": [
        "eth-mainnet*",
        "ethereum*",
        "eth.*.com"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "zsh",
        "osascript",
        "node",
        "cursor"
      ],
      "raw_values": [
        "bash",
        "sh",
        "zsh",
        "osascript",
        "node",
        "Cursor"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "modification"
      ],
      "raw_values": [
        "modification"
      ]
    }
  ],
  "raw_query": "sequence by process.entity_id with maxspan=15s\n  [network where host.os.type == \"macos\" and event.type == \"start\" and\n    (process.name in (\"bash\", \"sh\", \"zsh\", \"osascript\", \"node\", \"Cursor\") or\n    process.name like (\"python*\", \"ruby*\", \"perl*\", \"tclsh*\")) and\n    destination.domain like (\"eth-mainnet*\", \"ethereum*\", \"eth.*.com\")]\n  [file where host.os.type == \"macos\" and event.action == \"modification\" and file.extension in (\"js\", \"py\", \"sh\")]\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/command_and_control_potential_etherhiding_c2.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}