{
  "id": "6fa5b898-54e1-5620-889d-ef2418caad84",
  "catalog": "elastic",
  "name": "Potential Privilege Escalation via SUID/SGID Proxy Execution",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.privilege-escalation",
    "attack.persistence",
    "attack.defense-evasion"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "sudo",
        "mount",
        "umount",
        "fusermount3",
        "passwd",
        "chfn",
        "chsh",
        "gpasswd",
        "newgrp",
        "unix_chkpwd",
        "newuidmap",
        "newgidmap",
        "dbus-daemon-launch-helper",
        "ssh-keysign",
        "pkexec",
        "polkit-agent-helper-1",
        "snap-confine"
      ],
      "raw_values": [
        "/bin/su",
        "/usr/bin/su",
        "/usr/bin/sudo",
        "/bin/mount",
        "/usr/bin/mount",
        "/bin/umount",
        "/usr/bin/umount",
        "/usr/bin/fusermount3",
        "/bin/passwd",
        "/usr/bin/passwd",
        "/bin/chfn",
        "/usr/bin/chfn",
        "/bin/chsh",
        "/usr/bin/chsh",
        "/bin/gpasswd",
        "/usr/bin/gpasswd",
        "/bin/newgrp",
        "/usr/bin/newgrp",
        "/sbin/unix_chkpwd",
        "/usr/sbin/unix_chkpwd",
        "/usr/bin/newuidmap",
        "/usr/bin/newgidmap",
        "/usr/lib/dbus-1.0/dbus-daemon-launch-helper",
        "/usr/libexec/dbus-daemon-launch-helper",
        "/usr/lib/openssh/ssh-keysign",
        "/usr/libexec/openssh/ssh-keysign",
        "/usr/bin/pkexec",
        "/usr/libexec/pkexec",
        "/usr/lib/polkit-1/pkexec",
        "/usr/lib/polkit-1/polkit-agent-helper-1",
        "/usr/libexec/polkit-agent-helper-1",
        "/usr/lib/snapd/snap-confine"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "in",
      "values": [
        "unifiedmonitoring",
        "agent",
        "polkit-kde-authentication-agent-1",
        "xfce-polkit",
        "dolphin"
      ],
      "raw_values": [
        "/usr/libexec/oracle-cloud-agent/plugins/unifiedmonitoring/unifiedmonitoring",
        "/usr/libexec/oracle-cloud-agent/agent",
        "/usr/lib/x86_64-linux-gnu/libexec/polkit-kde-authentication-agent-1",
        "/usr/libexec/xfce-polkit",
        "/usr/bin/dolphin"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n  (process.user.id == \"0\" and process.real_user.id != \"0\") or\n  (process.group.id == \"0\" and process.real_group.id != \"0\")\n) and process.args in (\n  \"/bin/su\", \"/usr/bin/su\",\n  \"/usr/bin/sudo\",\n  \"/bin/mount\", \"/usr/bin/mount\",\n  \"/bin/umount\", \"/usr/bin/umount\",\n  \"/usr/bin/fusermount3\",\n  \"/bin/passwd\", \"/usr/bin/passwd\",\n  \"/bin/chfn\", \"/usr/bin/chfn\",\n  \"/bin/chsh\", \"/usr/bin/chsh\",\n  \"/bin/gpasswd\", \"/usr/bin/gpasswd\",\n  \"/bin/newgrp\", \"/usr/bin/newgrp\",\n  \"/sbin/unix_chkpwd\", \"/usr/sbin/unix_chkpwd\",\n  \"/usr/bin/newuidmap\", \"/usr/bin/newgidmap\",\n  \"/usr/lib/dbus-1.0/dbus-daemon-launch-helper\", \"/usr/libexec/dbus-daemon-launch-helper\",\n  \"/usr/lib/openssh/ssh-keysign\", \"/usr/libexec/openssh/ssh-keysign\",\n  \"/usr/bin/pkexec\", \"/usr/libexec/pkexec\", \"/usr/lib/polkit-1/pkexec\",\n  \"/usr/lib/polkit-1/polkit-agent-helper-1\", \"/usr/libexec/polkit-agent-helper-1\",\n  \"/usr/lib/snapd/snap-confine\"\n) and process.parent.args_count == 1 and\nnot process.parent.executable in (\n  \"/usr/libexec/oracle-cloud-agent/plugins/unifiedmonitoring/unifiedmonitoring\", \"/usr/libexec/oracle-cloud-agent/agent\",\n  \"/usr/lib/x86_64-linux-gnu/libexec/polkit-kde-authentication-agent-1\", \"/usr/libexec/xfce-polkit\", \"/usr/bin/dolphin\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/privilege_escalation_potential_suid_sgid_proxy_execution.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Tactic: Persistence",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}