{
  "id": "7109b0e0-e1e9-5664-bc1b-015c1da09606",
  "catalog": "elastic",
  "name": "Unsigned DLL Side-Loading from a Suspicious Folder",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "library"
  ],
  "conditions": [
    {
      "field": "dll.code_signature.status",
      "raw_field": "dll.code_signature.status",
      "operator": ":",
      "values": [
        "trusted",
        "errorexpired",
        "errorcode_endpoint",
        "errorchaining"
      ],
      "raw_values": [
        "trusted",
        "errorExpired",
        "errorCode_endpoint*",
        "errorChaining"
      ]
    },
    {
      "field": "dll.path",
      "raw_field": "dll.path",
      "operator": ":",
      "values": [
        ":\\\\perflogs\\\\*.dll",
        ":\\\\users\\\\*\\\\pictures\\\\*.dll",
        ":\\\\users\\\\*\\\\music\\\\*.dll",
        ":\\\\users\\\\public\\\\*.dll",
        ":\\\\users\\\\*\\\\documents\\\\*.dll",
        ":\\\\users\\\\*\\\\downloads\\\\*.dll",
        ":\\\\windows\\\\tasks\\\\*.dll",
        ":\\\\windows\\\\system32\\\\tasks\\\\*.dll",
        ":\\\\intel\\\\*.dll",
        ":\\\\amd\\\\temp\\\\*.dll",
        ":\\\\windows\\\\appreadiness\\\\*.dll",
        ":\\\\windows\\\\servicestate\\\\*.dll",
        ":\\\\windows\\\\security\\\\*.dll",
        ":\\\\windows\\\\system\\\\*.dll",
        ":\\\\windows\\\\identitycrl\\\\*.dll",
        ":\\\\windows\\\\branding\\\\*.dll",
        ":\\\\windows\\\\csc\\\\*.dll",
        ":\\\\windows\\\\digitallocker\\\\*.dll",
        ":\\\\windows\\\\en-us\\\\*.dll",
        ":\\\\windows\\\\wlansvc\\\\*.dll",
        ":\\\\windows\\\\prefetch\\\\*.dll",
        ":\\\\windows\\\\fonts\\\\*.dll",
        ":\\\\windows\\\\diagnostics\\\\*.dll",
        ":\\\\windows\\\\tapi\\\\*.dll",
        ":\\\\windows\\\\inf\\\\*.dll",
        ":\\\\windows\\\\tracing\\\\*.dll",
        ":\\\\windows\\\\ime\\\\*.dll",
        ":\\\\windows\\\\performance\\\\*.dll",
        ":\\\\windows\\\\intel\\\\*.dll",
        ":\\\\windows\\\\ms\\\\*.dll",
        ":\\\\windows\\\\dot3svc\\\\*.dll",
        ":\\\\windows\\\\serviceprofiles\\\\*.dll",
        ":\\\\windows\\\\panther\\\\*.dll",
        ":\\\\windows\\\\remotepackages\\\\*.dll",
        ":\\\\windows\\\\ocr\\\\*.dll",
        ":\\\\windows\\\\appcompat\\\\*.dll",
        ":\\\\windows\\\\apppatch\\\\*.dll",
        ":\\\\windows\\\\addins\\\\*.dll",
        ":\\\\windows\\\\setup\\\\*.dll",
        ":\\\\windows\\\\help\\\\*.dll",
        ":\\\\windows\\\\skb\\\\*.dll",
        ":\\\\windows\\\\vss\\\\*.dll",
        ":\\\\windows\\\\web\\\\*.dll",
        ":\\\\windows\\\\servicing\\\\*.dll",
        ":\\\\windows\\\\cbstemp\\\\*.dll",
        ":\\\\windows\\\\logs\\\\*.dll",
        ":\\\\windows\\\\waas\\\\*.dll",
        ":\\\\windows\\\\twain_32\\\\*.dll",
        ":\\\\windows\\\\shellexperiences\\\\*.dll",
        ":\\\\windows\\\\shellcomponents\\\\*.dll",
        ":\\\\windows\\\\pla\\\\*.dll",
        ":\\\\windows\\\\migration\\\\*.dll",
        ":\\\\windows\\\\debug\\\\*.dll",
        ":\\\\windows\\\\cursors\\\\*.dll",
        ":\\\\windows\\\\containers\\\\*.dll",
        ":\\\\windows\\\\boot\\\\*.dll",
        ":\\\\windows\\\\bcastdvr\\\\*.dll",
        ":\\\\windows\\\\textinput\\\\*.dll",
        ":\\\\windows\\\\schemas\\\\*.dll",
        ":\\\\windows\\\\schcache\\\\*.dll",
        ":\\\\windows\\\\resources\\\\*.dll",
        ":\\\\windows\\\\rescache\\\\*.dll",
        ":\\\\windows\\\\provisioning\\\\*.dll",
        ":\\\\windows\\\\printdialog\\\\*.dll",
        ":\\\\windows\\\\policydefinitions\\\\*.dll",
        ":\\\\windows\\\\media\\\\*.dll",
        ":\\\\windows\\\\globalization\\\\*.dll",
        ":\\\\windows\\\\l2schemas\\\\*.dll",
        ":\\\\windows\\\\livekernelreports\\\\*.dll",
        ":\\\\windows\\\\modemlogs\\\\*.dll",
        ":\\\\windows\\\\immersivecontrolpanel\\\\*.dll",
        ":\\\\$recycle.bin\\\\*.dll"
      ],
      "raw_values": [
        "?:\\\\PerfLogs\\\\*.dll",
        "?:\\\\Users\\\\*\\\\Pictures\\\\*.dll",
        "?:\\\\Users\\\\*\\\\Music\\\\*.dll",
        "?:\\\\Users\\\\Public\\\\*.dll",
        "?:\\\\Users\\\\*\\\\Documents\\\\*.dll",
        "?:\\\\Users\\\\*\\\\Downloads\\\\*.dll",
        "?:\\\\Windows\\\\Tasks\\\\*.dll",
        "?:\\\\Windows\\\\System32\\\\Tasks\\\\*.dll",
        "?:\\\\Intel\\\\*.dll",
        "?:\\\\AMD\\\\Temp\\\\*.dll",
        "?:\\\\Windows\\\\AppReadiness\\\\*.dll",
        "?:\\\\Windows\\\\ServiceState\\\\*.dll",
        "?:\\\\Windows\\\\security\\\\*.dll",
        "?:\\\\Windows\\\\System\\\\*.dll",
        "?:\\\\Windows\\\\IdentityCRL\\\\*.dll",
        "?:\\\\Windows\\\\Branding\\\\*.dll",
        "?:\\\\Windows\\\\csc\\\\*.dll",
        "?:\\\\Windows\\\\DigitalLocker\\\\*.dll",
        "?:\\\\Windows\\\\en-US\\\\*.dll",
        "?:\\\\Windows\\\\wlansvc\\\\*.dll",
        "?:\\\\Windows\\\\Prefetch\\\\*.dll",
        "?:\\\\Windows\\\\Fonts\\\\*.dll",
        "?:\\\\Windows\\\\diagnostics\\\\*.dll",
        "?:\\\\Windows\\\\TAPI\\\\*.dll",
        "?:\\\\Windows\\\\INF\\\\*.dll",
        "?:\\\\windows\\\\tracing\\\\*.dll",
        "?:\\\\windows\\\\IME\\\\*.dll",
        "?:\\\\Windows\\\\Performance\\\\*.dll",
        "?:\\\\windows\\\\intel\\\\*.dll",
        "?:\\\\windows\\\\ms\\\\*.dll",
        "?:\\\\Windows\\\\dot3svc\\\\*.dll",
        "?:\\\\Windows\\\\ServiceProfiles\\\\*.dll",
        "?:\\\\Windows\\\\panther\\\\*.dll",
        "?:\\\\Windows\\\\RemotePackages\\\\*.dll",
        "?:\\\\Windows\\\\OCR\\\\*.dll",
        "?:\\\\Windows\\\\appcompat\\\\*.dll",
        "?:\\\\Windows\\\\apppatch\\\\*.dll",
        "?:\\\\Windows\\\\addins\\\\*.dll",
        "?:\\\\Windows\\\\Setup\\\\*.dll",
        "?:\\\\Windows\\\\Help\\\\*.dll",
        "?:\\\\Windows\\\\SKB\\\\*.dll",
        "?:\\\\Windows\\\\Vss\\\\*.dll",
        "?:\\\\Windows\\\\Web\\\\*.dll",
        "?:\\\\Windows\\\\servicing\\\\*.dll",
        "?:\\\\Windows\\\\CbsTemp\\\\*.dll",
        "?:\\\\Windows\\\\Logs\\\\*.dll",
        "?:\\\\Windows\\\\WaaS\\\\*.dll",
        "?:\\\\Windows\\\\twain_32\\\\*.dll",
        "?:\\\\Windows\\\\ShellExperiences\\\\*.dll",
        "?:\\\\Windows\\\\ShellComponents\\\\*.dll",
        "?:\\\\Windows\\\\PLA\\\\*.dll",
        "?:\\\\Windows\\\\Migration\\\\*.dll",
        "?:\\\\Windows\\\\debug\\\\*.dll",
        "?:\\\\Windows\\\\Cursors\\\\*.dll",
        "?:\\\\Windows\\\\Containers\\\\*.dll",
        "?:\\\\Windows\\\\Boot\\\\*.dll",
        "?:\\\\Windows\\\\bcastdvr\\\\*.dll",
        "?:\\\\Windows\\\\TextInput\\\\*.dll",
        "?:\\\\Windows\\\\schemas\\\\*.dll",
        "?:\\\\Windows\\\\SchCache\\\\*.dll",
        "?:\\\\Windows\\\\Resources\\\\*.dll",
        "?:\\\\Windows\\\\rescache\\\\*.dll",
        "?:\\\\Windows\\\\Provisioning\\\\*.dll",
        "?:\\\\Windows\\\\PrintDialog\\\\*.dll",
        "?:\\\\Windows\\\\PolicyDefinitions\\\\*.dll",
        "?:\\\\Windows\\\\media\\\\*.dll",
        "?:\\\\Windows\\\\Globalization\\\\*.dll",
        "?:\\\\Windows\\\\L2Schemas\\\\*.dll",
        "?:\\\\Windows\\\\LiveKernelReports\\\\*.dll",
        "?:\\\\Windows\\\\ModemLogs\\\\*.dll",
        "?:\\\\Windows\\\\ImmersiveControlPanel\\\\*.dll",
        "?:\\\\$Recycle.Bin\\\\*.dll"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "dll.name",
      "raw_field": "dll.name",
      "operator": ":",
      "values": [
        "chrome_elf.dll"
      ],
      "raw_values": [
        "chrome_elf.dll"
      ]
    }
  ],
  "raw_query": "library where host.os.type == \"windows\" and\n\n process.code_signature.trusted == true and\n\n (dll.Ext.relative_file_creation_time <= 500 or dll.Ext.relative_file_name_modify_time <= 500) and\n\n  not dll.code_signature.status : (\"trusted\", \"errorExpired\", \"errorCode_endpoint*\", \"errorChaining\") and\n\n      /* Suspicious Paths */\n      dll.path : (\"?:\\\\PerfLogs\\\\*.dll\",\n                  \"?:\\\\Users\\\\*\\\\Pictures\\\\*.dll\",\n                  \"?:\\\\Users\\\\*\\\\Music\\\\*.dll\",\n                  \"?:\\\\Users\\\\Public\\\\*.dll\",\n                  \"?:\\\\Users\\\\*\\\\Documents\\\\*.dll\",\n\t\t\t\t  \"?:\\\\Users\\\\*\\\\Downloads\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Tasks\\\\*.dll\",\n                  \"?:\\\\Windows\\\\System32\\\\Tasks\\\\*.dll\",\n                  \"?:\\\\Intel\\\\*.dll\",\n                  \"?:\\\\AMD\\\\Temp\\\\*.dll\",\n                  \"?:\\\\Windows\\\\AppReadiness\\\\*.dll\",\n                  \"?:\\\\Windows\\\\ServiceState\\\\*.dll\",\n                  \"?:\\\\Windows\\\\security\\\\*.dll\",\n\t\t  \"?:\\\\Windows\\\\System\\\\*.dll\",\n                  \"?:\\\\Windows\\\\IdentityCRL\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Branding\\\\*.dll\",\n                  \"?:\\\\Windows\\\\csc\\\\*.dll\",\n                  \"?:\\\\Windows\\\\DigitalLocker\\\\*.dll\",\n                  \"?:\\\\Windows\\\\en-US\\\\*.dll\",\n                  \"?:\\\\Windows\\\\wlansvc\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Prefetch\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Fonts\\\\*.dll\",\n                  \"?:\\\\Windows\\\\diagnostics\\\\*.dll\",\n                  \"?:\\\\Windows\\\\TAPI\\\\*.dll\",\n                  \"?:\\\\Windows\\\\INF\\\\*.dll\",\n                  \"?:\\\\windows\\\\tracing\\\\*.dll\",\n                  \"?:\\\\windows\\\\IME\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Performance\\\\*.dll\",\n                  \"?:\\\\windows\\\\intel\\\\*.dll\",\n                  \"?:\\\\windows\\\\ms\\\\*.dll\",\n                  \"?:\\\\Windows\\\\dot3svc\\\\*.dll\",\n                  \"?:\\\\Windows\\\\ServiceProfiles\\\\*.dll\",\n                  \"?:\\\\Windows\\\\panther\\\\*.dll\",\n                  \"?:\\\\Windows\\\\RemotePackages\\\\*.dll\",\n                  \"?:\\\\Windows\\\\OCR\\\\*.dll\",\n                  \"?:\\\\Windows\\\\appcompat\\\\*.dll\",\n                  \"?:\\\\Windows\\\\apppatch\\\\*.dll\",\n                  \"?:\\\\Windows\\\\addins\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Setup\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Help\\\\*.dll\",\n                  \"?:\\\\Windows\\\\SKB\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Vss\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Web\\\\*.dll\",\n                  \"?:\\\\Windows\\\\servicing\\\\*.dll\",\n                  \"?:\\\\Windows\\\\CbsTemp\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Logs\\\\*.dll\",\n                  \"?:\\\\Windows\\\\WaaS\\\\*.dll\",\n                  \"?:\\\\Windows\\\\twain_32\\\\*.dll\",\n                  \"?:\\\\Windows\\\\ShellExperiences\\\\*.dll\",\n                  \"?:\\\\Windows\\\\ShellComponents\\\\*.dll\",\n                  \"?:\\\\Windows\\\\PLA\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Migration\\\\*.dll\",\n                  \"?:\\\\Windows\\\\debug\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Cursors\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Containers\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Boot\\\\*.dll\",\n                  \"?:\\\\Windows\\\\bcastdvr\\\\*.dll\",\n                  \"?:\\\\Windows\\\\TextInput\\\\*.dll\",\n                  \"?:\\\\Windows\\\\schemas\\\\*.dll\",\n                  \"?:\\\\Windows\\\\SchCache\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Resources\\\\*.dll\",\n                  \"?:\\\\Windows\\\\rescache\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Provisioning\\\\*.dll\",\n                  \"?:\\\\Windows\\\\PrintDialog\\\\*.dll\",\n                  \"?:\\\\Windows\\\\PolicyDefinitions\\\\*.dll\",\n                  \"?:\\\\Windows\\\\media\\\\*.dll\",\n                  \"?:\\\\Windows\\\\Globalization\\\\*.dll\",\n                  \"?:\\\\Windows\\\\L2Schemas\\\\*.dll\",\n                  \"?:\\\\Windows\\\\LiveKernelReports\\\\*.dll\",\n                  \"?:\\\\Windows\\\\ModemLogs\\\\*.dll\",\n                  \"?:\\\\Windows\\\\ImmersiveControlPanel\\\\*.dll\",\n                  \"?:\\\\$Recycle.Bin\\\\*.dll\") and\n\n\t /* DLL loaded from the process.executable current directory */\n\t (endswith~(substring(dll.path, 0, length(dll.path) - (length(dll.name) + 1)), substring(process.executable, 0, length(process.executable) - (length(process.name) + 1))) or dll.name : \"chrome_elf.dll\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_unsigned_dll_loaded_from_suspdir.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}