{
  "id": "7359af0a-1cb3-5172-a878-7b5275231019",
  "catalog": "elastic",
  "name": "Execution via Electron Child Process Node.js Module",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.defense-evasion",
    "attack.execution"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "const*require*child_process"
      ],
      "raw_values": [
        "const*require*child_process*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and \n process.args == \"-e\" and process.args : \"const*require*child_process*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/execution_defense_evasion_electron_app_childproc_node_js.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}