{
  "id": "7905cadf-d1f3-5ec5-a823-e23449ad0096",
  "catalog": "elastic",
  "name": "First Time Seen DNS Query to RMM Domain",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.command-and-control"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "lookup_requested"
      ],
      "raw_values": [
        "lookup_requested"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "chrome.exe",
        "msedge.exe",
        "microsoftedge.exe",
        "microsoftedgecp.exe",
        "firefox.exe",
        "iexplore.exe",
        "safari.exe",
        "brave.exe",
        "opera.exe",
        "vivaldi.exe",
        "msedgewebview2.exe"
      ],
      "raw_values": [
        "chrome.exe",
        "msedge.exe",
        "MicrosoftEdge.exe",
        "MicrosoftEdgeCP.exe",
        "firefox.exe",
        "iexplore.exe",
        "safari.exe",
        "brave.exe",
        "opera.exe",
        "vivaldi.exe",
        "msedgewebview2.exe"
      ]
    },
    {
      "field": "parent_domain",
      "raw_field": "parent_domain",
      "operator": "in",
      "values": [
        "teamviewer.com",
        "logmein.com",
        "logmeinrescue.com",
        "logmeininc.com",
        "internapcdn.net",
        "anydesk.com",
        "screenconnect.com",
        "connectwise.com",
        "splashtop.com",
        "zohoassist.com",
        "dwservice.net",
        "gotoassist.com",
        "getgo.com",
        "rustdesk.com",
        "remoteutilities.com",
        "atera.com",
        "ammyy.com",
        "n-able.com",
        "kaseya.net",
        "bomgar.com",
        "beyondtrustcloud.com",
        "parsec.app",
        "parsecusercontent.com",
        "tailscale.com",
        "twingate.com",
        "jumpcloud.com",
        "vnc.com",
        "remotepc.com",
        "netsupportsoftware.com",
        "getscreen.me",
        "beanywhere.com",
        "swi-rc.com",
        "swi-tc.com",
        "qetqo.com",
        "tmate.io",
        "playanext.com",
        "supremocontrol.com",
        "itarian.com",
        "datto.com",
        "auvik.com",
        "syncromsp.com",
        "pulseway.com",
        "immy.bot",
        "immybot.com",
        "level.io",
        "ninjarmm.com",
        "ninjaone.com",
        "centrastage.net",
        "datto.net",
        "liongard.com",
        "naverisk.com",
        "panorama9.com",
        "superops.ai",
        "superops.com",
        "tacticalrmm.com",
        "meshcentral.com",
        "remotly.com",
        "fixme.it",
        "islonline.com",
        "zoho.eu",
        "goverlan.com",
        "iperius.net",
        "iperiusremote.com",
        "remotix.com",
        "mikogo.com",
        "r-hud.net",
        "pcvisit.de",
        "netviewer.com",
        "helpwire.app",
        "remotetopc.com",
        "rport.io",
        "action1.com",
        "tiflux.com",
        "gotoresolve.com"
      ],
      "raw_values": [
        "teamviewer.com",
        "logmein.com",
        "logmeinrescue.com",
        "logmeininc.com",
        "internapcdn.net",
        "anydesk.com",
        "screenconnect.com",
        "connectwise.com",
        "splashtop.com",
        "zohoassist.com",
        "dwservice.net",
        "gotoassist.com",
        "getgo.com",
        "rustdesk.com",
        "remoteutilities.com",
        "atera.com",
        "ammyy.com",
        "n-able.com",
        "kaseya.net",
        "bomgar.com",
        "beyondtrustcloud.com",
        "parsec.app",
        "parsecusercontent.com",
        "tailscale.com",
        "twingate.com",
        "jumpcloud.com",
        "vnc.com",
        "remotepc.com",
        "netsupportsoftware.com",
        "getscreen.me",
        "beanywhere.com",
        "swi-rc.com",
        "swi-tc.com",
        "qetqo.com",
        "tmate.io",
        "playanext.com",
        "supremocontrol.com",
        "itarian.com",
        "datto.com",
        "auvik.com",
        "syncromsp.com",
        "pulseway.com",
        "immy.bot",
        "immybot.com",
        "level.io",
        "ninjarmm.com",
        "ninjaone.com",
        "centrastage.net",
        "datto.net",
        "liongard.com",
        "naverisk.com",
        "panorama9.com",
        "superops.ai",
        "superops.com",
        "tacticalrmm.com",
        "meshcentral.com",
        "remotly.com",
        "fixme.it",
        "islonline.com",
        "zoho.eu",
        "goverlan.com",
        "iperius.net",
        "iperiusremote.com",
        "remotix.com",
        "mikogo.com",
        "r-hud.net",
        "pcvisit.de",
        "netviewer.com",
        "helpwire.app",
        "remotetopc.com",
        "rport.io",
        "action1.com",
        "tiflux.com",
        "gotoresolve.com"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "network"
      ],
      "raw_values": [
        "network"
      ]
    }
  ],
  "raw_query": "FROM logs-endpoint.events.network-*, logs-windows.sysmon_operational-* METADATA _index\n| WHERE host.os.type == \"windows\"\n    AND event.category == \"network\"\n    AND event.action in (\"lookup_requested\", \"DNSEvent (DNS query)\")\n    AND dns.question.name IS NOT NULL\n\n// Exclude browser processes\n| WHERE NOT\n    process.name IN (\n        \"chrome.exe\", \"msedge.exe\", \"MicrosoftEdge.exe\", \"MicrosoftEdgeCP.exe\",\n        \"firefox.exe\", \"iexplore.exe\", \"safari.exe\", \"brave.exe\",\n        \"opera.exe\", \"vivaldi.exe\", \"msedgewebview2.exe\"\n    )\n\n// Extract the parent domain (last two labels, e.g. example.com)\n| GROK dns.question.name \"\"\"(?:[^.]+\\.)+(?<parent_domain>[^.]+\\.[^.]+)$\"\"\"\n| EVAL parent_domain = COALESCE(parent_domain, dns.question.name)\n\n// Known RMM parent domains, add or remove entries here as your environment changes.\n| WHERE parent_domain IN (\n    \"teamviewer.com\",\n    \"logmein.com\",\n    \"logmeinrescue.com\",\n    \"logmeininc.com\",\n    \"internapcdn.net\",\n    \"anydesk.com\",\n    \"screenconnect.com\",\n    \"connectwise.com\",\n    \"splashtop.com\",\n    \"zohoassist.com\",\n    \"dwservice.net\",\n    \"gotoassist.com\",\n    \"getgo.com\",\n    \"logmeinrescue.com\",\n    \"rustdesk.com\",\n    \"remoteutilities.com\",\n    \"atera.com\",\n    \"ammyy.com\",\n    \"n-able.com\",\n    \"kaseya.net\",\n    \"bomgar.com\",\n    \"beyondtrustcloud.com\",\n    \"parsec.app\",\n    \"parsecusercontent.com\",\n    \"tailscale.com\",\n    \"twingate.com\",\n    \"jumpcloud.com\",\n    \"vnc.com\",\n    \"remotepc.com\",\n    \"netsupportsoftware.com\",\n    \"getscreen.me\",\n    \"beanywhere.com\",\n    \"swi-rc.com\",\n    \"swi-tc.com\",\n    \"qetqo.com\",\n    \"tmate.io\",\n    \"playanext.com\",\n    \"supremocontrol.com\",\n    \"itarian.com\",\n    \"datto.com\",\n    \"auvik.com\",\n    \"syncromsp.com\",\n    \"pulseway.com\",\n    \"immy.bot\",\n    \"immybot.com\",\n    \"level.io\",\n    \"ninjarmm.com\",\n    \"ninjaone.com\",\n    \"centrastage.net\",\n    \"datto.net\",\n    \"liongard.com\",\n    \"naverisk.com\",\n    \"panorama9.com\",\n    \"superops.ai\",\n    \"superops.com\",\n    \"tacticalrmm.com\",\n    \"meshcentral.com\",\n    \"remotly.com\",\n    \"fixme.it\",\n    \"islonline.com\",\n    \"zoho.eu\",\n    \"goverlan.com\",\n    \"iperius.net\",\n    \"iperiusremote.com\",\n    \"remotix.com\",\n    \"mikogo.com\",\n    \"r-hud.net\",\n    \"pcvisit.de\",\n    \"netviewer.com\",\n    \"helpwire.app\",\n    \"remotetopc.com\",\n    \"rport.io\",\n    \"action1.com\",\n    \"tiflux.com\",\n    \"gotoresolve.com\"\n)\n\n// Aggregate by parent domain and get 1st time seen timestamp as well as unique count of agents\n| STATS\n    event_count = COUNT(*),\n    Esql.first_time_seen = MIN(@timestamp),\n    Esql.count_distinct_host_id = COUNT_DISTINCT(host.id),\n    Esql.process_executable_values = VALUES(process.executable),\n    Esql.dns_question_name_values = VALUES(dns.question.name),\n    Esql.host_name_values = VALUES(host.name) BY parent_domain\n\n// Calculate the time difference between first time seen and rule execution time\n| eval Esql.recent = DATE_DIFF(\"minute\", Esql.first_time_seen, now())\n\n// First time seen is within 6m of the rule execution time and first seen in the last 5 days as per the rule from schedule and limited to 1 unique host\n| where Esql.recent <= 6 and Esql.count_distinct_host_id == 1\n\n// populate fields for rule exception\n| eval host.name = MV_FIRST(Esql.host_name_values),\n       process.executable = MV_FIRST(Esql.process_executable_values), dns.question.name = MV_FIRST(Esql.dns_question_name_values)\n| keep host.name, process.executable, dns.question.name, Esql.*\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/windows/command_and_control_dns_rmm_domains_non_browser.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Resources: Investigation Guide",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon"
    ]
  }
}