{
  "id": "79740af5-d681-5ae4-8da1-d730163c9757",
  "catalog": "elastic",
  "name": "Executable Masquerading as Kernel Process",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "kworker",
        "kthread"
      ],
      "raw_values": [
        "kworker*",
        "kthread*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\") and\nprocess.name : (\"kworker*\", \"kthread*\") and process.executable != null\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/defense_evasion_kthreadd_masquerading.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}