{
  "id": "7afd530e-4a3e-58ff-9d4e-2554aa5bb17c",
  "catalog": "elastic",
  "name": "Suspicious LSASS Access via MalSecLogon",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "winlog.event_data.targetimage",
      "raw_field": "winlog.event_data.TargetImage",
      "operator": ":",
      "values": [
        ":\\\\windows\\\\system32\\\\lsass.exe"
      ],
      "raw_values": [
        "?:\\\\WINDOWS\\\\system32\\\\lsass.exe"
      ]
    },
    {
      "field": "winlog.event_data.calltrace",
      "raw_field": "winlog.event_data.CallTrace",
      "operator": ":",
      "values": [
        "seclogon.dll"
      ],
      "raw_values": [
        "*seclogon.dll*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "svchost.exe"
      ],
      "raw_values": [
        "svchost.exe"
      ]
    },
    {
      "field": "winlog.event_data.grantedaccess",
      "raw_field": "winlog.event_data.GrantedAccess",
      "operator": "==",
      "values": [
        "0x14c0"
      ],
      "raw_values": [
        "0x14c0"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.code == \"10\" and\n  winlog.event_data.TargetImage : \"?:\\\\WINDOWS\\\\system32\\\\lsass.exe\" and\n\n   /* seclogon service accessing lsass */\n  winlog.event_data.CallTrace : \"*seclogon.dll*\" and process.name : \"svchost.exe\" and\n\n   /* PROCESS_CREATE_PROCESS & PROCESS_DUP_HANDLE & PROCESS_QUERY_INFORMATION */\n  winlog.event_data.GrantedAccess == \"0x14c0\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_lsass_handle_via_malseclogon.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Sysmon",
      "Resources: Investigation Guide"
    ]
  }
}