{
  "id": "7b8d8c30-ea41-585c-9cbc-db3aed13662c",
  "catalog": "elastic",
  "name": "Startup Persistence by a Suspicious Process",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.persistence"
  ],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "wmic.exe",
        "mshta.exe",
        "pwsh.exe",
        "cscript.exe",
        "wscript.exe",
        "regsvr32.exe",
        "regasm.exe",
        "rundll32.exe",
        "eqnedt32.exe",
        "winword.exe",
        "excel.exe",
        "powerpnt.exe",
        "mspub.exe",
        "msaccess.exe",
        "iexplore.exe",
        "installutil.exe"
      ],
      "raw_values": [
        "cmd.exe",
        "powershell.exe",
        "wmic.exe",
        "mshta.exe",
        "pwsh.exe",
        "cscript.exe",
        "wscript.exe",
        "regsvr32.exe",
        "RegAsm.exe",
        "rundll32.exe",
        "EQNEDT32.EXE",
        "WINWORD.EXE",
        "EXCEL.EXE",
        "POWERPNT.EXE",
        "MSPUB.EXE",
        "MSACCESS.EXE",
        "iexplore.exe",
        "InstallUtil.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "!=",
      "values": [
        "deletion"
      ],
      "raw_values": [
        "deletion"
      ]
    },
    {
      "field": "user.domain",
      "raw_field": "user.domain",
      "operator": "!=",
      "values": [
        "nt authority"
      ],
      "raw_values": [
        "NT AUTHORITY"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"windows\" and event.type != \"deletion\" and\n  user.domain != \"NT AUTHORITY\" and\n  file.path : (\"C:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\*\",\n               \"C:\\\\ProgramData\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\StartUp\\\\*\") and\n  process.name : (\"cmd.exe\",\n                  \"powershell.exe\",\n                  \"wmic.exe\",\n                  \"mshta.exe\",\n                  \"pwsh.exe\",\n                  \"cscript.exe\",\n                  \"wscript.exe\",\n                  \"regsvr32.exe\",\n                  \"RegAsm.exe\",\n                  \"rundll32.exe\",\n                  \"EQNEDT32.EXE\",\n                  \"WINWORD.EXE\",\n                  \"EXCEL.EXE\",\n                  \"POWERPNT.EXE\",\n                  \"MSPUB.EXE\",\n                  \"MSACCESS.EXE\",\n                  \"iexplore.exe\",\n                  \"InstallUtil.exe\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/persistence_startup_folder_file_written_by_suspicious_process.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Resources: Investigation Guide",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: SentinelOne"
    ]
  }
}