{
  "id": "7c866b8f-d20f-5bed-b4d1-74e63191cad6",
  "catalog": "elastic",
  "name": "Browser Process Spawned from an Unusual Parent",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "chrome.exe",
        "msedge.exe"
      ],
      "raw_values": [
        "chrome.exe",
        "msedge.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "--remote-debugging-port=922",
        "--window-position=-*,-"
      ],
      "raw_values": [
        "\\",
        "--remote-debugging-port=922?",
        "--window-position=-*,-*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "explorer.exe"
      ],
      "raw_values": [
        "C:\\\\Windows\\\\explorer.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.name : (\"chrome.exe\", \"msedge.exe\") and\n  process.parent.executable != null and process.command_line != null and\n  (\n  process.command_line :\n           (\"\\\"C:\\\\Program Files (x86)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe\\\"\",\n            \"\\\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\\\"\",\n            \"\\\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\\\" --headless --disable-logging --log-level=3 --v=0\",\n            \"\\\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\\\" --headless --log-level=3\",\n            \"\\\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\\\" --headless\",\n            \"\\\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\\\" --remote-debugging-port=922? --profile-directory=\\\"Default\\\"*\",\n            \"\\\"C:\\\\Program Files\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\\\" --headless --restore-last-session --remote-debugging-port=45452*\") or\n\n  (process.args : \"--remote-debugging-port=922?\" and process.args : \"--window-position=-*,-*\")\n   ) and\n  not process.parent.executable :\n                         (\"C:\\\\Windows\\\\explorer.exe\",\n                          \"C:\\\\Program Files (x86)\\\\*.exe\",\n                          \"C:\\\\Program Files\\\\*.exe\",\n                          \"C:\\\\Windows\\\\System32\\\\rdpinit.exe\",\n                          \"C:\\\\Windows\\\\System32\\\\sihost.exe\",\n                          \"C:\\\\Windows\\\\System32\\\\RuntimeBroker.exe\",\n                          \"C:\\\\Windows\\\\System32\\\\SECOCL64.exe\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_browsers_unusual_parent.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}