{
  "id": "7e2b1e84-755c-5ac5-8e3d-d15bdf8c11ad",
  "catalog": "elastic",
  "name": "Privileged Accounts Brute Force",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.status",
      "raw_field": "winlog.event_data.Status",
      "operator": "in",
      "values": [
        "0xc000015b",
        "0xc000005e",
        "0xc0000133",
        "0xc0000192",
        "0xc00000dc"
      ],
      "raw_values": [
        "0xc000015b",
        "0xc000005e",
        "0xc0000133",
        "0xc0000192",
        "0xc00000dc"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "authentication"
      ],
      "raw_values": [
        "authentication"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "logon-failed"
      ],
      "raw_values": [
        "logon-failed"
      ]
    },
    {
      "field": "winlog.logon.type",
      "raw_field": "winlog.logon.type",
      "operator": "==",
      "values": [
        "network"
      ],
      "raw_values": [
        "Network"
      ]
    }
  ],
  "raw_query": "from logs-system.security*, logs-windows.forwarded*, winlogbeat-* metadata _id, _version, _index\n| where event.category == \"authentication\" and host.os.type == \"windows\" and event.action == \"logon-failed\" and\n  winlog.logon.type == \"Network\" and source.ip is not null and winlog.computer_name is not null and\n  not cidr_match(TO_IP(source.ip), \"127.0.0.0/8\", \"::1\") and\n  to_lower(winlog.event_data.TargetUserName) like \"*admin*\"  and\n  /*\n    noisy failure status codes often associated to authentication misconfiguration\n     0xC000015B - The user has not been granted the requested logon type (also called the logon right) at this machine.\n     0XC000005E - There are currently no logon servers available to service the logon request.\n     0XC0000133 - Clocks between DC and other computer too far out of sync.\n     0XC0000192 An attempt was made to logon, but the Netlogon service was not started.\n     0xc00000dc - DC is in shutdown phase, it will normally tell current clients to use another DC for authentication.\n  */\n  not winlog.event_data.Status in (\"0xc000015b\", \"0xc000005e\", \"0xc0000133\", \"0xc0000192\", \"0xc00000dc\")\n// truncate the timestamp to a 60-second window\n| eval Esql.time_window = date_trunc(60 seconds, @timestamp)\n| stats Esql.failed_auth_count = COUNT(*),\n        Esql.target_user_name_values = VALUES(winlog.event_data.TargetUserName),\n        Esql.count_distinct_user_name = count_distinct(winlog.event_data.TargetUserName),\n        Esql.user_domain_values = VALUES(user.domain),\n        Esql.error_codes = VALUES(winlog.event_data.Status),\n        Esql.data_stream_namespace.values = VALUES(data_stream.namespace) by winlog.computer_name, source.ip, Esql.time_window, winlog.logon.type\n| where Esql.failed_auth_count >= 50 and Esql.count_distinct_user_name >= 2\n| eval user.name = mv_first(Esql.target_user_name_values)\n| KEEP winlog.computer_name, source.ip, user.name, Esql.time_window, winlog.logon.type, Esql.*\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_bruteforce_admin_account.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Resources: Investigation Guide",
      "Data Source: Windows Security Event Logs"
    ]
  }
}