{
  "id": "822705a9-e505-5a5d-8d91-2b69086f8295",
  "catalog": "elastic",
  "name": "Suspicious WMIC XSL Script Execution",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.defense-evasion",
    "attack.execution"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "format*:",
        "-format*:",
        "format:table"
      ],
      "raw_values": [
        "format*:*",
        "/format*:*",
        "*-format*:*",
        "* /format:table *",
        "* /format:table"
      ]
    },
    {
      "field": "dll.name",
      "raw_field": "dll.name",
      "operator": ":",
      "values": [
        "jscript.dll",
        "vbscript.dll"
      ],
      "raw_values": [
        "jscript.dll",
        "vbscript.dll"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "jscript.dll",
        "vbscript.dll"
      ],
      "raw_values": [
        "jscript.dll",
        "vbscript.dll"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "WMIC.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "wmic.exe"
      ],
      "raw_values": [
        "wmic.exe"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "library",
        "process"
      ],
      "raw_values": [
        "library",
        "process"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": ":",
      "values": [
        "image loaded"
      ],
      "raw_values": [
        "Image loaded*"
      ]
    }
  ],
  "raw_query": "sequence by process.entity_id with maxspan = 2m\n[process where host.os.type == \"windows\" and event.type == \"start\" and\n   (process.name : \"WMIC.exe\" or process.pe.original_file_name : \"wmic.exe\") and\n   process.args : (\"format*:*\", \"/format*:*\", \"*-format*:*\") and\n   not process.command_line : (\"* /format:table *\", \"* /format:table\")]\n[any where host.os.type == \"windows\" and (event.category == \"library\" or (event.category == \"process\" and event.action : \"Image loaded*\")) and\n (?dll.name : (\"jscript.dll\", \"vbscript.dll\") or file.name : (\"jscript.dll\", \"vbscript.dll\"))]\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_suspicious_wmi_script.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Resources: Investigation Guide"
    ]
  }
}