{
  "id": "84c166c3-a3e4-5a09-933e-9b95bafeeac9",
  "catalog": "elastic",
  "name": "Pass-the-Hash Attack Detection",
  "description": "Detects pass-the-hash via NTLM authentication anomalies",
  "severity": "critical",
  "mitre_techniques": [
    "attack.t1550.002"
  ],
  "event_categories": [
    "authentication"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "logged-in"
      ],
      "raw_values": [
        "logged-in"
      ]
    }
  ],
  "raw_query": "authentication where event.action == \"logged-in\" and source.ip != \"127.0.0.1\"",
  "language": "eql",
  "translated_query": null,
  "source_path": "demo",
  "metadata": {}
}