{
  "id": "86b9db5c-8ebc-5e90-954f-8cadbdf749f6",
  "catalog": "elastic",
  "name": "LSASS Process Access via Windows API",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.ext.api.name",
      "raw_field": "process.Ext.api.name",
      "operator": "in",
      "values": [
        "openprocess",
        "openthread",
        "readprocessmemory"
      ],
      "raw_values": [
        "OpenProcess",
        "OpenThread",
        "ReadProcessMemory"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "api"
      ],
      "raw_values": [
        "api"
      ]
    },
    {
      "field": "host.os.family",
      "raw_field": "host.os.family",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "target.process.name",
      "raw_field": "Target.process.name",
      "operator": "==",
      "values": [
        "lsass.exe"
      ],
      "raw_values": [
        "lsass.exe"
      ]
    }
  ],
  "raw_query": "from logs-endpoint.events.api-*, logs-m365_defender.event-* metadata _id, _version, _index\n\n| where event.category == \"api\" and host.os.family == \"windows\" and\n   process.Ext.api.name in (\"OpenProcess\", \"OpenThread\", \"ReadProcessMemory\") and\n   Target.process.name == \"lsass.exe\" and process.executable is not null and\n\n   // Noisy patterns\n   not to_lower(process.executable) like \"\"\"c:\\\\program files\\\\*.exe\"\"\" and\n   not to_lower(process.executable) like \"\"\"c:\\\\program files (x86)\\\\*.exe\"\"\" and\n   not process.executable like \"\"\"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\MsMpEng.exe\"\"\" and\n   not process.executable like \"\"\"C:\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\Platform\\\\*\\\\MsMpEng.exe\"\"\"\n\n /* normalize process paths to reduce known random patterns in process.executable */\n| eval Esql.process_path = replace(process.executable, \"\"\"([0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}|ns[a-z][A-Z0-9]{3,4}\\.tmp|DX[A-Z0-9]{3,4}\\.tmp|7z[A-Z0-9]{3,5}\\.tmp|[0-9\\.\\-\\_]{3,})\"\"\", \"\")\n\n// Group by process path\n| stats Esql.access_count = count(*),\n        Esql.count_distinct_hosts = count_distinct(host.id),\n        Esql.host_id_values = VALUES(host.id),\n        Esql.host_name_values = VALUES(host.name),\n        Esql.user_name_values = VALUES(user.name),\n        Esql.process_pid_values = VALUES(process.entity_id),\n        Esql.process_executable_values = VALUES(process.executable),\n        Esql.data_stream_namespace.values = VALUES(data_stream.namespace),\n        Esql.user_name_values = VALUES(user.name) by Esql.process_path\n\n// Limit to rare instances limited to 1 unique host\n| where Esql.count_distinct_hosts == 1 and Esql.access_count <= 3\n\n// Extract the single host ID and process into their corresponding ECS fields for alerts exclusion\n| eval host.id = mv_min(Esql.host_id_values),\n       host.name = mv_min(Esql.host_name_values),\n       process.executable = mv_min(Esql.process_executable_values), \n       user.name = mv_min(Esql.user_name_values)\n\n// Add the new field to the keep statement\n| keep Esql.*, host.id, host.name, user.name, process.executable\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_lsass_openprocess_api.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Data Source: Microsoft Defender for Endpoint",
      "Resources: Investigation Guide"
    ]
  }
}