{
  "id": "88b5a3f0-b4f7-52fe-aa40-eee4f6c4f4ba",
  "catalog": "elastic",
  "name": "Suspicious Kerberos Authentication Ticket Request",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.credential-access",
    "attack.lateral-movement"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "lsass.exe",
        "svchost.exe",
        "ws_tomcatservice.exe",
        "tomcat10.exe"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\system32\\\\lsass.exe",
        "\\\\device\\\\harddiskvolume*\\\\windows\\\\system32\\\\lsass.exe",
        "\\\\device\\\\harddiskvolume*\\\\windows\\\\system32\\\\svchost.exe",
        "C:\\\\Windows\\\\System32\\\\svchost.exe",
        "C:\\\\Program Files\\\\VMware\\\\VMware View\\\\Server\\\\bin\\\\ws_TomcatService.exe",
        "F:\\\\IGEL\\\\RemoteManager\\\\*\\\\bin\\\\tomcat10.exe"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": "in",
      "values": [
        "s-1-5-20",
        "s-1-5-18"
      ],
      "raw_values": [
        "S-1-5-20",
        "S-1-5-18"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "in",
      "values": [
        "4768",
        "4769"
      ],
      "raw_values": [
        "4768",
        "4769"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "source.ip",
      "raw_field": "source.ip",
      "operator": "!=",
      "values": [
        "127.0.0.1"
      ],
      "raw_values": [
        "127.0.0.1"
      ]
    },
    {
      "field": "destination.ip",
      "raw_field": "destination.ip",
      "operator": "!=",
      "values": [
        "::1",
        "127.0.0.1"
      ],
      "raw_values": [
        "::1",
        "127.0.0.1"
      ]
    }
  ],
  "raw_query": "sequence by source.port, source.ip with maxspan=3s\n [network where host.os.type == \"windows\" and destination.port == 88 and\n  process.executable != null and process.pid != 4 and \n  not process.executable : \n              (\"?:\\\\Windows\\\\system32\\\\lsass.exe\", \n               \"\\\\device\\\\harddiskvolume*\\\\windows\\\\system32\\\\lsass.exe\", \n               \"\\\\device\\\\harddiskvolume*\\\\windows\\\\system32\\\\svchost.exe\") and\n  not (process.executable : (\"C:\\\\Windows\\\\System32\\\\svchost.exe\", \n                             \"C:\\\\Program Files\\\\VMware\\\\VMware View\\\\Server\\\\bin\\\\ws_TomcatService.exe\", \n                             \"F:\\\\IGEL\\\\RemoteManager\\\\*\\\\bin\\\\tomcat10.exe\") and user.id in (\"S-1-5-20\", \"S-1-5-18\")) and   \n  source.ip != \"127.0.0.1\" and destination.ip != \"::1\" and destination.ip != \"127.0.0.1\"]\n [authentication where host.os.type == \"windows\" and event.code in (\"4768\", \"4769\")]\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/lateral_movement_credential_access_kerberos_correlation.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "Domain: Identity",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Tactic: Lateral Movement",
      "Use Case: Active Directory Monitoring",
      "Data Source: Active Directory",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: Windows Security Event Logs",
      "Resources: Investigation Guide"
    ]
  }
}