{
  "id": "89c22aa6-775e-5d23-a802-9bf073783e8b",
  "catalog": "elastic",
  "name": "System Public IP Discovery via DNS Query",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "msbuild.exe",
        "mshta.exe",
        "wscript.exe",
        "powershell.exe",
        "pwsh.exe",
        "msiexec.exe",
        "rundll32.exe",
        "bitsadmin.exe",
        "installutil.exe",
        "regasm.exe",
        "vbc.exe",
        "regsvcs.exe",
        "python.exe",
        "regsvr32.exe",
        "dllhost.exe",
        "node.exe",
        "javaw.exe",
        "java.exe",
        ".pif",
        ".com",
        ".exe"
      ],
      "raw_values": [
        "MSBuild.exe",
        "mshta.exe",
        "wscript.exe",
        "powershell.exe",
        "pwsh.exe",
        "msiexec.exe",
        "rundll32.exe",
        "bitsadmin.exe",
        "InstallUtil.exe",
        "RegAsm.exe",
        "vbc.exe",
        "RegSvcs.exe",
        "python.exe",
        "regsvr32.exe",
        "dllhost.exe",
        "node.exe",
        "javaw.exe",
        "java.exe",
        "*.pif",
        "*.com",
        "?:\\\\Users\\\\*.exe",
        "?:\\\\ProgramData\\\\*.exe"
      ]
    },
    {
      "field": "process.code_signature.subject_name",
      "raw_field": "process.code_signature.subject_name",
      "operator": ":",
      "values": [
        "autoit consulting ltd",
        "openjs foundation",
        "python software foundation"
      ],
      "raw_values": [
        "AutoIt Consulting Ltd",
        "OpenJS Foundation",
        "Python Software Foundation"
      ]
    },
    {
      "field": "dns.question.name",
      "raw_field": "dns.question.name",
      "operator": ":",
      "values": [
        "ip-api.com",
        "checkip.dyndns.org",
        "api.ipify.org",
        "api.ipify.com",
        "whatismyip.akamai.com",
        "bot.whatismyipaddress.com",
        "ifcfg.me",
        "ident.me",
        "ipof.in",
        "ip.tyk.nu",
        "icanhazip.com",
        "curlmyip.com",
        "wgetip.com",
        "eth0.me",
        "ipecho.net",
        "ip.appspot.com",
        "api.myip.com",
        "geoiptool.com",
        "api.2ip.ua",
        "api.ip.sb",
        "ipinfo.io",
        "checkip.amazonaws.com",
        "wtfismyip.com",
        "iplogger.",
        "freegeoip.net",
        "freegeoip.app",
        "geoplugin.net",
        "myip.dnsomatic.com",
        "www.geoplugin.net",
        "api64.ipify.org",
        "ip4.seeip.org",
        ".geojs.io",
        "portmap.io",
        "api.db-ip.com",
        "geolocation-db.com",
        "httpbin.org",
        "myip.opendns.com"
      ],
      "raw_values": [
        "ip-api.com",
        "checkip.dyndns.org",
        "api.ipify.org",
        "api.ipify.com",
        "whatismyip.akamai.com",
        "bot.whatismyipaddress.com",
        "ifcfg.me",
        "ident.me",
        "ipof.in",
        "ip.tyk.nu",
        "icanhazip.com",
        "curlmyip.com",
        "wgetip.com",
        "eth0.me",
        "ipecho.net",
        "ip.appspot.com",
        "api.myip.com",
        "geoiptool.com",
        "api.2ip.ua",
        "api.ip.sb",
        "ipinfo.io",
        "checkip.amazonaws.com",
        "wtfismyip.com",
        "iplogger.*",
        "freegeoip.net",
        "freegeoip.app",
        "geoplugin.net",
        "myip.dnsomatic.com",
        "www.geoplugin.net",
        "api64.ipify.org",
        "ip4.seeip.org",
        "*.geojs.io",
        "*portmap.io",
        "api.db-ip.com",
        "geolocation-db.com",
        "httpbin.org",
        "myip.opendns.com"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    }
  ],
  "raw_query": "network where host.os.type == \"windows\" and dns.question.name != null and process.name != null and\n(\n  process.name : (\"MSBuild.exe\", \"mshta.exe\", \"wscript.exe\", \"powershell.exe\", \"pwsh.exe\", \"msiexec.exe\", \"rundll32.exe\",\n  \"bitsadmin.exe\", \"InstallUtil.exe\", \"RegAsm.exe\", \"vbc.exe\", \"RegSvcs.exe\", \"python.exe\", \"regsvr32.exe\", \"dllhost.exe\",\n  \"node.exe\", \"javaw.exe\", \"java.exe\", \"*.pif\", \"*.com\") or\n\n  (?process.code_signature.trusted == false or ?process.code_signature.exists == false) or\n\n  ?process.code_signature.subject_name : (\"AutoIt Consulting Ltd\", \"OpenJS Foundation\", \"Python Software Foundation\") or\n\n  ?process.executable : (\"?:\\\\Users\\\\*.exe\", \"?:\\\\ProgramData\\\\*.exe\")\n ) and\n dns.question.name :\n         (\n          \"ip-api.com\",\n          \"checkip.dyndns.org\",\n          \"api.ipify.org\",\n          \"api.ipify.com\",\n          \"whatismyip.akamai.com\",\n          \"bot.whatismyipaddress.com\",\n          \"ifcfg.me\",\n          \"ident.me\",\n          \"ipof.in\",\n          \"ip.tyk.nu\",\n          \"icanhazip.com\",\n          \"curlmyip.com\",\n          \"wgetip.com\",\n          \"eth0.me\",\n          \"ipecho.net\",\n          \"ip.appspot.com\",\n          \"api.myip.com\",\n          \"geoiptool.com\",\n          \"api.2ip.ua\",\n          \"api.ip.sb\",\n          \"ipinfo.io\",\n          \"checkip.amazonaws.com\",\n          \"wtfismyip.com\",\n          \"iplogger.*\",\n          \"freegeoip.net\",\n          \"freegeoip.app\",\n          \"ipinfo.io\",\n          \"geoplugin.net\",\n          \"myip.dnsomatic.com\",\n          \"www.geoplugin.net\",\n          \"api64.ipify.org\",\n          \"ip4.seeip.org\",\n          \"*.geojs.io\",\n          \"*portmap.io\",\n          \"api.2ip.ua\",\n          \"api.db-ip.com\",\n          \"geolocation-db.com\",\n          \"httpbin.org\",\n          \"myip.opendns.com\"\n         )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/discovery_host_public_ip_address_lookup.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Discovery",
      "Tactic: Command and Control",
      "Resources: Investigation Guide",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike",
      "Data Source: Sysmon"
    ]
  }
}