{
  "id": "8a23d712-14f3-530f-91ed-dba56dcb4c26",
  "catalog": "elastic",
  "name": "Microsoft Exchange Worker Spawning Suspicious Processes",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.initial-access",
    "attack.execution"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe",
        "powershell_ise.exe"
      ],
      "raw_values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.exe",
        "powershell_ise.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "in",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "pwsh.dll",
        "powershell_ise.exe"
      ],
      "raw_values": [
        "Cmd.Exe",
        "PowerShell.EXE",
        "pwsh.dll",
        "powershell_ise.EXE"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "w3wp.exe"
      ],
      "raw_values": [
        "w3wp.exe"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": ":",
      "values": [
        "msexchange*apppool"
      ],
      "raw_values": [
        "MSExchange*AppPool"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.parent.name : \"w3wp.exe\" and process.parent.args : \"MSExchange*AppPool\" and\n  (\n    (process.name : (\"cmd.exe\", \"powershell.exe\", \"pwsh.exe\", \"powershell_ise.exe\") or\n    ?process.pe.original_file_name in (\"Cmd.Exe\", \"PowerShell.EXE\", \"pwsh.dll\", \"powershell_ise.EXE\"))\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/initial_access_suspicious_ms_exchange_worker_child_process.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Initial Access",
      "Tactic: Execution",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}