{
  "id": "970c32c3-2be6-5c5a-800c-70bd14aba56e",
  "catalog": "elastic",
  "name": "Tampering with RUNNER_TRACKING_ID in GitHub Actions Runners",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.execution",
    "attack.initial-access",
    "attack.defense-evasion"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "in",
      "values": [
        "linux",
        "macos"
      ],
      "raw_values": [
        "linux",
        "macos"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "runner.worker",
        "runner.listener"
      ],
      "raw_values": [
        "Runner.Worker",
        "Runner.Listener"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.env_vars",
      "raw_field": "process.env_vars",
      "operator": "like~",
      "values": [
        "runner_tracking_id",
        "runner_tracking_id=github_"
      ],
      "raw_values": [
        "RUNNER_TRACKING_ID*",
        "RUNNER_TRACKING_ID=github_*"
      ]
    }
  ],
  "raw_query": "process where host.os.type in (\"linux\", \"macos\") and event.type == \"start\" and event.action == \"exec\" and\nprocess.parent.name in (\"Runner.Worker\", \"Runner.Listener\") and process.env_vars like~ \"RUNNER_TRACKING_ID*\" and\nnot process.env_vars like~ \"RUNNER_TRACKING_ID=github_*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/cross-platform/execution_via_github_runner_with_runner_tracking_id_tampering_via_env_vars.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Tactic: Initial Access",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}