{
  "id": "9a40f7ea-815a-5af9-bc5f-1b6a92276f03",
  "catalog": "elastic",
  "name": "Command Execution via ForFiles",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "c copy @file",
        "f @",
        "c del @"
      ],
      "raw_values": [
        "/c",
        "-c",
        "-d",
        "/d",
        "cmd /c copy @file*",
        "cmd /c DEL /Q /F @*",
        "cmd /c del @*",
        "D:\\\\*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": "!=",
      "values": [
        "s-1-5-18"
      ],
      "raw_values": [
        "S-1-5-18"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "forfiles.exe"
      ],
      "raw_values": [
        "forfiles.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "==",
      "values": [
        "forfiles.exe"
      ],
      "raw_values": [
        "forfiles.exe"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and user.id != \"S-1-5-18\" and\n (process.name : \"forfiles.exe\" or ?process.pe.original_file_name == \"forfiles.exe\") and process.args : (\"/c\", \"-c\") and\n not process.args : (\"-d\", \"/d\", \"cmd /c copy @file*\", \"cmd /c DEL /Q /F @*\", \"cmd /c del @*\", \"D:\\\\*\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_indirect_exec_forfiles.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}