{
  "id": "9c8f8b8f-b024-5868-8892-704b339271cc",
  "catalog": "elastic",
  "name": "Potential Password Spraying Attack via SSH",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "ssh_login",
        "user_login"
      ],
      "raw_values": [
        "ssh_login",
        "user_login"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "authentication"
      ],
      "raw_values": [
        "authentication"
      ]
    },
    {
      "field": "event.outcome",
      "raw_field": "event.outcome",
      "operator": "==",
      "values": [
        "failure"
      ],
      "raw_values": [
        "failure"
      ]
    }
  ],
  "raw_query": "from logs-system.auth-* metadata _id, _index, _version\n\n// Create 5-minute time buckets\n| eval Esql.time_window_date_trunc = date_trunc(5 minutes, @timestamp)\n\n// Ensure event.action values in a list are expanded\n| mv_expand event.action \n\n| where\n  event.category == \"authentication\" and event.action in (\"ssh_login\", \"user_login\") and event.outcome == \"failure\" and\n  source.ip is not null \n\n// Keep relevant fields\n| keep\n   @timestamp,\n   _id,\n   _index,\n   _version,\n   event.category,\n   event.action,\n   event.outcome,\n   source.ip,\n   process.name,\n   user.name,\n   data_stream.dataset,\n   data_stream.namespace,\n   agent.id,\n   user.id,\n   Esql.time_window_date_trunc\n\n| stats\n  Esql.event_count = count(*),\n  Esql.user_name_count_distinct = count_distinct(user.name),\n  Esql.user_name_values = values(user.name),\n  Esql.process_name_values = values(process.name),\n  Esql.data_stream_dataset_values = values(data_stream.dataset),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n\n  by Esql.time_window_date_trunc, source.ip\n\n| where Esql.user_name_count_distinct > 10 and Esql.event_count >= 30\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/linux/credential_access_potential_password_spraying_attack.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Resources: Investigation Guide"
    ]
  }
}