{
  "id": "a5f660dc-9cbc-5818-85cc-b6cc86f6bad5",
  "catalog": "elastic",
  "name": "Virtual Private Network Connection Attempt",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "networksetup",
        "scutil",
        "osascript"
      ],
      "raw_values": [
        "networksetup",
        "scutil",
        "osascript"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like~",
      "values": [
        "-connectpppoeservice",
        "--nc",
        "start"
      ],
      "raw_values": [
        "-connectpppoeservice",
        "--nc",
        "start"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "osascript*set vpn to service"
      ],
      "raw_values": [
        "osascript*set VPN to service*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n  (\n    (process.name == \"networksetup\" and process.args like~ \"-connectpppoeservice\") or\n    (process.name == \"scutil\" and process.args like~ \"--nc\" and process.args like~ \"start\") or\n    (process.name == \"osascript\" and process.command_line : \"osascript*set VPN to service*\")\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/lateral_movement_vpn_connection_attempt.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Lateral Movement",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}