{
  "id": "a8419e88-7f65-5577-9a7a-19b7c25c10f5",
  "catalog": "elastic",
  "name": "Untrusted DLL Loaded by Azure AD Sync Service",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "dll.path",
      "raw_field": "dll.path",
      "operator": ":",
      "values": [
        ":\\\\windows\\\\assembly\\\\nativeimages",
        ":\\\\windows\\\\microsoft.net\\\\",
        ":\\\\windows\\\\winsxs\\\\",
        ":\\\\windows\\\\system32\\\\driverstore\\\\filerepository\\\\"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\assembly\\\\NativeImages*",
        "?:\\\\Windows\\\\Microsoft.NET\\\\*",
        "?:\\\\Windows\\\\WinSxS\\\\*",
        "?:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\*"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "nativeimages"
      ],
      "raw_values": [
        "?:\\\\Windows\\\\assembly\\\\NativeImages*",
        "?:\\\\Windows\\\\Microsoft.NET\\\\*",
        "?:\\\\Windows\\\\WinSxS\\\\*",
        "?:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "azureadconnectauthenticationagentservice.exe"
      ],
      "raw_values": [
        "AzureADConnectAuthenticationAgentService.exe"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "library",
        "process"
      ],
      "raw_values": [
        "library",
        "process"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "load"
      ],
      "raw_values": [
        "load"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": ":",
      "values": [
        "image loaded"
      ],
      "raw_values": [
        "Image loaded*"
      ]
    },
    {
      "field": "file.code_signature.status",
      "raw_field": "file.code_signature.status",
      "operator": "==",
      "values": [
        "valid"
      ],
      "raw_values": [
        "Valid"
      ]
    }
  ],
  "raw_query": "any where host.os.type == \"windows\" and process.name : \"AzureADConnectAuthenticationAgentService.exe\" and\n(\n (event.category == \"library\" and event.action == \"load\") or\n (event.category == \"process\" and event.action : \"Image loaded*\")\n) and\n\nnot (?dll.code_signature.trusted == true or file.code_signature.status == \"Valid\") and not\n\n  (\n   /* Elastic defend DLL path */\n   ?dll.path :\n         (\"?:\\\\Windows\\\\assembly\\\\NativeImages*\",\n          \"?:\\\\Windows\\\\Microsoft.NET\\\\*\",\n          \"?:\\\\Windows\\\\WinSxS\\\\*\",\n          \"?:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\*\") or\n\n   /* Sysmon DLL path is mapped to file.path */\n   file.path :\n         (\"?:\\\\Windows\\\\assembly\\\\NativeImages*\",\n          \"?:\\\\Windows\\\\Microsoft.NET\\\\*\",\n          \"?:\\\\Windows\\\\WinSxS\\\\*\",\n          \"?:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\*\")\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_imageload_azureadconnectauthsvc.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Resources: Investigation Guide"
    ]
  }
}