{
  "id": "aaf6934a-5479-575c-92a0-34a09b7e4b1d",
  "catalog": "elastic",
  "name": "ESXI Discovery via Find",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "executed",
        "process_started",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "executed",
        "process_started",
        "ProcessRollup2"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "find"
      ],
      "raw_values": [
        "find"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "==",
      "values": [
        "uninstall_viewagent.sh"
      ],
      "raw_values": [
        "/usr/lib/vmware/viewagent/bin/uninstall_viewagent.sh"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"executed\", \"process_started\", \"ProcessRollup2\") and\nprocess.name == \"find\" and process.args like (\"/etc/vmware/*\", \"/usr/lib/vmware/*\", \"/vmfs/*\") and\nnot ?process.parent.executable == \"/usr/lib/vmware/viewagent/bin/uninstall_viewagent.sh\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/discovery_esxi_software_via_find.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Discovery",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: Auditd Manager",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}