{
  "id": "acc6c7eb-8699-58cb-ace7-3176084fd027",
  "catalog": "elastic",
  "name": "Suspicious Calendar File Modification",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "mail",
        "xpcproxy",
        "launchd"
      ],
      "raw_values": [
        "/System/Library/*",
        "/System/Applications/Calendar.app/Contents/MacOS/*",
        "/System/Applications/Mail.app/Contents/MacOS/Mail",
        "/usr/libexec/xpcproxy",
        "/sbin/launchd",
        "/Applications/*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "modification"
      ],
      "raw_values": [
        "modification"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": "like~",
      "values": [
        ".ics"
      ],
      "raw_values": [
        "/Users/*/Library/Calendars/*.calendar/Events/*.ics"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"macos\" and event.action == \"modification\" and\n  file.path like~ \"/Users/*/Library/Calendars/*.calendar/Events/*.ics\" and\n  not process.executable like (\"/System/Library/*\", \"/System/Applications/Calendar.app/Contents/MacOS/*\", \n                               \"/System/Applications/Mail.app/Contents/MacOS/Mail\", \"/usr/libexec/xpcproxy\",\n                               \"/sbin/launchd\", \"/Applications/*\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/persistence_suspicious_calendar_modification.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}