{
  "id": "ada32f0d-7f3e-5cfd-a159-238ce3bf346b",
  "catalog": "elastic",
  "name": "Clearing Windows Console History",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.defense-evasion",
    "attack.execution"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "powershell.exe",
        "pwsh.exe",
        "powershell_ise.exe"
      ],
      "raw_values": [
        "powershell.exe",
        "pwsh.exe",
        "powershell_ise.exe"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "remove-item",
        "consolehost_history.txt",
        "clear-history",
        "set-psreadlineoption",
        "savenothing"
      ],
      "raw_values": [
        "*Remove-Item*",
        "* rm *",
        "*ConsoleHost_history.txt*",
        "*Clear-History*",
        "*Set-PSReadlineOption*",
        "*SaveNothing*"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": "in",
      "values": [
        "powershell.exe",
        "pwsh.dll",
        "powershell_ise.exe"
      ],
      "raw_values": [
        "PowerShell.EXE",
        "pwsh.dll",
        "powershell_ise.EXE"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  (\n    process.name : (\"powershell.exe\", \"pwsh.exe\", \"powershell_ise.exe\") or\n    ?process.pe.original_file_name in (\"PowerShell.EXE\", \"pwsh.dll\", \"powershell_ise.EXE\")\n  ) and\n  (\n    process.command_line : \"*Clear-History*\" or\n    (\n      process.command_line : (\"*Remove-Item*\", \"* rm *\") and\n      process.command_line : (\"*ConsoleHost_history.txt*\", \"*(Get-PSReadlineOption).HistorySavePath*\")\n    ) or\n    (process.command_line : \"*Set-PSReadlineOption*\" and process.command_line : \"*SaveNothing*\")\n  )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_clearing_windows_console_history.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Execution",
      "Resources: Investigation Guide",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike"
    ]
  }
}