{
  "id": "b179df76-bc0f-5480-a788-2da2724425c6",
  "catalog": "elastic",
  "name": "Suspicious JetBrains TeamCity Child Process",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "java.exe"
      ],
      "raw_values": [
        "?:\\\\TeamCity\\\\jre\\\\bin\\\\java.exe",
        "?:\\\\Program Files\\\\TeamCity\\\\jre\\\\bin\\\\java.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "cmd.exe",
        "powershell.exe",
        "msiexec.exe",
        "certutil.exe",
        "bitsadmin.exe",
        "wmic.exe",
        "curl.exe",
        "ssh.exe",
        "rundll32.exe",
        "regsvr32.exe",
        "mshta.exe",
        "certreq.exe",
        "net.exe",
        "nltest.exe",
        "whoami.exe",
        "hostname.exe",
        "tasklist.exe",
        "arp.exe",
        "nbtstat.exe",
        "netstat.exe",
        "reg.exe",
        "microsoft.workflow.compiler.exe",
        "atbroker.exe",
        "bginfo.exe",
        "cdb.exe",
        "cmstp.exe",
        "control.exe",
        "cscript.exe",
        "csi.exe",
        "dnx.exe",
        "dsget.exe",
        "dsquery.exe",
        "forfiles.exe",
        "fsi.exe",
        "ftp.exe",
        "gpresult.exe",
        "ieexec.exe",
        "iexpress.exe",
        "installutil.exe",
        "ipconfig.exe",
        "msxsl.exe",
        "netsh.exe",
        "odbcconf.exe",
        "ping.exe",
        "pwsh.exe",
        "qprocess.exe",
        "quser.exe",
        "qwinsta.exe",
        "rcsi.exe",
        "regasm.exe",
        "regsvcs.exe",
        "sc.exe",
        "schtasks.exe",
        "systeminfo.exe",
        "tracert.exe",
        "wscript.exe",
        "xwizard.exe",
        "explorer.exe",
        "msdt.exe"
      ],
      "raw_values": [
        "cmd.exe",
        "powershell.exe",
        "msiexec.exe",
        "certutil.exe",
        "bitsadmin.exe",
        "wmic.exe",
        "curl.exe",
        "ssh.exe",
        "rundll32.exe",
        "regsvr32.exe",
        "mshta.exe",
        "certreq.exe",
        "net.exe",
        "nltest.exe",
        "whoami.exe",
        "hostname.exe",
        "tasklist.exe",
        "arp.exe",
        "nbtstat.exe",
        "netstat.exe",
        "reg.exe",
        "Microsoft.Workflow.Compiler.exe",
        "atbroker.exe",
        "bginfo.exe",
        "cdb.exe",
        "cmstp.exe",
        "control.exe",
        "cscript.exe",
        "csi.exe",
        "dnx.exe",
        "dsget.exe",
        "dsquery.exe",
        "forfiles.exe",
        "fsi.exe",
        "ftp.exe",
        "gpresult.exe",
        "ieexec.exe",
        "iexpress.exe",
        "installutil.exe",
        "ipconfig.exe",
        "msxsl.exe",
        "netsh.exe",
        "odbcconf.exe",
        "ping.exe",
        "pwsh.exe",
        "qprocess.exe",
        "quser.exe",
        "qwinsta.exe",
        "rcsi.exe",
        "regasm.exe",
        "regsvcs.exe",
        "sc.exe",
        "schtasks.exe",
        "systeminfo.exe",
        "tracert.exe",
        "wscript.exe",
        "xwizard.exe",
        "explorer.exe",
        "msdt.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "-executionpolicy",
        ".ps1",
        "dir"
      ],
      "raw_values": [
        "-ExecutionPolicy",
        "?:\\\\TeamCity\\\\buildAgent\\\\work\\\\*.ps1",
        "dir",
        "/-c"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.parent.executable :\n                 (\"?:\\\\TeamCity\\\\jre\\\\bin\\\\java.exe\",\n                  \"?:\\\\Program Files\\\\TeamCity\\\\jre\\\\bin\\\\java.exe\",\n                  \"?:\\\\Program Files (x86)\\\\TeamCity\\\\jre\\\\bin\\\\java.exe\",\n                  \"?:\\\\TeamCity\\\\BuildAgent\\\\jre\\\\bin\\\\java.exe\") and\n  process.name : (\"cmd.exe\", \"powershell.exe\", \"msiexec.exe\", \"certutil.exe\", \"bitsadmin.exe\", \"wmic.exe\", \"curl.exe\", \"ssh.exe\",\n                   \"rundll32.exe\", \"regsvr32.exe\", \"mshta.exe\", \"certreq.exe\", \"net.exe\", \"nltest.exe\", \"whoami.exe\", \"hostname.exe\",\n                   \"tasklist.exe\", \"arp.exe\", \"nbtstat.exe\", \"netstat.exe\", \"reg.exe\", \"tasklist.exe\", \"Microsoft.Workflow.Compiler.exe\",\n                   \"arp.exe\", \"atbroker.exe\", \"bginfo.exe\", \"bitsadmin.exe\", \"cdb.exe\", \"cmstp.exe\", \"control.exe\", \"cscript.exe\", \"csi.exe\",\n                   \"dnx.exe\", \"dsget.exe\", \"dsquery.exe\", \"forfiles.exe\", \"fsi.exe\", \"ftp.exe\", \"gpresult.exe\", \"ieexec.exe\", \"iexpress.exe\",\n                   \"installutil.exe\", \"ipconfig.exe\",\"msxsl.exe\", \"netsh.exe\", \"odbcconf.exe\", \"ping.exe\", \"pwsh.exe\", \"qprocess.exe\",\n                   \"quser.exe\", \"qwinsta.exe\", \"rcsi.exe\", \"regasm.exe\", \"regsvcs.exe\", \"regsvr32.exe\", \"sc.exe\", \"schtasks.exe\",\n                   \"systeminfo.exe\", \"tracert.exe\", \"wmic.exe\", \"wscript.exe\",\"xwizard.exe\", \"explorer.exe\", \"msdt.exe\") and\n not (process.name : \"powershell.exe\" and process.args : \"-ExecutionPolicy\" and process.args : \"?:\\\\TeamCity\\\\buildAgent\\\\work\\\\*.ps1\") and\n not (process.name : \"cmd.exe\" and process.args : \"dir\" and process.args : \"/-c\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/initial_access_exploit_jetbrains_teamcity.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Initial Access",
      "Data Source: Elastic Endgame",
      "Use Case: Vulnerability",
      "Data Source: Elastic Defend",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Windows Security Event Logs",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}