{
  "id": "b625eb0c-80ea-5491-867d-fd020d31d579",
  "catalog": "elastic",
  "name": "Suspicious Write Attempt to AppArmor Policy Management Files",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "python",
        "perl",
        "ruby",
        "lua",
        "php"
      ],
      "raw_values": [
        ".*",
        "python*",
        "perl*",
        "ruby*",
        "lua*",
        "php*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        ".load",
        ".replace",
        ".remove"
      ],
      "raw_values": [
        "*/sys/kernel/security/apparmor/.load*",
        "*/sys/kernel/security/apparmor/.replace*",
        "*/sys/kernel/security/apparmor/.remove*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "cat",
        "echo",
        "tee",
        "truncate",
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox",
        "awk",
        "sed",
        "xargs",
        "find",
        "grep",
        "node",
        "timeout",
        "env"
      ],
      "raw_values": [
        "cat",
        "echo",
        "tee",
        "dd",
        "truncate",
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox",
        "awk",
        "sed",
        "xargs",
        "find",
        "grep",
        "node",
        "timeout",
        "env"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\") and\n( \n  process.name in (\n    \"cat\", \"echo\", \"tee\", \"dd\", \"truncate\", \"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\",\n    \"busybox\", \"awk\", \"sed\", \"xargs\", \"find\", \"grep\", \"node\", \"timeout\", \"env\"\n  ) or\n  process.name like (\".*\", \"python*\", \"perl*\", \"ruby*\", \"lua*\", \"php*\")\n) and\nprocess.command_line like (\n  \"*/sys/kernel/security/apparmor/.load*\",\n  \"*/sys/kernel/security/apparmor/.replace*\",\n  \"*/sys/kernel/security/apparmor/.remove*\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/defense_evasion_apparmor_exploitation_via_sys_fs.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Data Source: Elastic Endgame",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}