{
  "id": "ba9ad010-8595-5707-83ee-acf1754dd6c3",
  "catalog": "elastic",
  "name": "Access to a Sensitive LDAP Attribute",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access",
    "attack.privilege-escalation"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "winlog.event_data.properties",
      "raw_field": "winlog.event_data.Properties",
      "operator": ":",
      "values": [
        "612cb747-c0e8-4f92-9221-fdd5f15b550d",
        "b8dfa744-31dc-4ef1-ac7c-84baf7ef9da7",
        "b3f93023-9239-4f7c-b99c-6745d87adbc2",
        "b7ff5a38-0818-42b0-8110-d3d154c97f24"
      ],
      "raw_values": [
        "*612cb747-c0e8-4f92-9221-fdd5f15b550d*",
        "*b8dfa744-31dc-4ef1-ac7c-84baf7ef9da7*",
        "*b3f93023-9239-4f7c-b99c-6745d87adbc2*",
        "*b7ff5a38-0818-42b0-8110-d3d154c97f24*"
      ]
    },
    {
      "field": "winlog.event_data.accessmask",
      "raw_field": "winlog.event_data.AccessMask",
      "operator": "in",
      "values": [
        "0x0",
        "0x100"
      ],
      "raw_values": [
        "0x0",
        "0x100"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "4662"
      ],
      "raw_values": [
        "4662"
      ]
    },
    {
      "field": "winlog.event_data.subjectusersid",
      "raw_field": "winlog.event_data.SubjectUserSid",
      "operator": ":",
      "values": [
        "s-1-5-18"
      ],
      "raw_values": [
        "S-1-5-18"
      ]
    }
  ],
  "raw_query": "any where host.os.type == \"windows\" and event.code == \"4662\" and\n\n  not winlog.event_data.SubjectUserSid : \"S-1-5-18\" and\n\n  winlog.event_data.Properties : (\n   /* unixUserPassword */\n  \"*612cb747-c0e8-4f92-9221-fdd5f15b550d*\",\n\n  /* ms-PKI-AccountCredentials */\n  \"*b8dfa744-31dc-4ef1-ac7c-84baf7ef9da7*\",\n\n  /*  ms-PKI-DPAPIMasterKeys */\n  \"*b3f93023-9239-4f7c-b99c-6745d87adbc2*\",\n\n  /* msPKI-CredentialRoamingTokens */\n  \"*b7ff5a38-0818-42b0-8110-d3d154c97f24*\"\n  ) and\n\n  /*\n   Excluding noisy AccessMasks\n   0x0 undefined and 0x100 Control Access\n   https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4662\n   */\n  not winlog.event_data.AccessMask in (\"0x0\", \"0x100\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_ldap_attributes.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Tactic: Privilege Escalation",
      "Use Case: Active Directory Monitoring",
      "Data Source: Active Directory",
      "Data Source: Windows Security Event Logs",
      "Resources: Investigation Guide"
    ]
  }
}