{
  "id": "baf98fbd-ef30-58b1-a7ad-64f8999882e3",
  "catalog": "elastic",
  "name": "FortiGate Configuration File Downloaded",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "network"
  ],
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "fortinet_fortigate.log"
      ],
      "raw_values": [
        "fortinet_fortigate.log"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "0100032095"
      ],
      "raw_values": [
        "0100032095"
      ]
    },
    {
      "field": "fortinet.firewall.action",
      "raw_field": "fortinet.firewall.action",
      "operator": "==",
      "values": [
        "download"
      ],
      "raw_values": [
        "download"
      ]
    }
  ],
  "raw_query": "any where data_stream.dataset == \"fortinet_fortigate.log\" and\n    event.code == \"0100032095\" and\n    fortinet.firewall.action == \"download\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/network/collection_fortigate_config_download.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Use Case: Threat Detection",
      "Tactic: Collection",
      "Tactic: Credential Access",
      "Resources: Investigation Guide",
      "Domain: Network",
      "Data Source: Fortinet",
      "Data Source: Fortinet FortiGate"
    ]
  }
}