{
  "id": "bb435f95-746d-590c-b6f7-bf68111ed0b9",
  "catalog": "elastic",
  "name": "Potential Persistence via Mandatory User Profile",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "creation",
        "change"
      ],
      "raw_values": [
        "creation",
        "change"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "user.id",
      "raw_field": "user.id",
      "operator": "!=",
      "values": [
        "s-1-5-18"
      ],
      "raw_values": [
        "S-1-5-18"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "ntuser.man"
      ],
      "raw_values": [
        "NTUSER.MAN"
      ]
    },
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        ".man"
      ],
      "raw_values": [
        "?:\\\\Users\\\\*.MAN"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"windows\" and\n event.type in (\"creation\", \"change\") and user.id != \"S-1-5-18\" and\n file.name : \"NTUSER.MAN\" and file.path : \"?:\\\\Users\\\\*.MAN\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/persistence_suspicious_user_mandatory_profile_file.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}