{
  "id": "c0acbcc0-c1ca-5d29-92dd-f8b3a8d772dc",
  "catalog": "elastic",
  "name": "Sensitive Keys Or Passwords Search Detected via Defend for Containers",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.credential-access"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like~",
      "values": [
        "begin private",
        "begin openssh private",
        "begin rsa private",
        "begin dsa private",
        "begin ec private",
        "password",
        "ssh",
        "id_rsa",
        "id_dsa"
      ],
      "raw_values": [
        "*BEGIN PRIVATE*",
        "*BEGIN OPENSSH PRIVATE*",
        "*BEGIN RSA PRIVATE*",
        "*BEGIN DSA PRIVATE*",
        "*BEGIN EC PRIVATE*",
        "*password*",
        "*ssh*",
        "*id_rsa*",
        "*id_dsa*"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "grep",
        "egrep",
        "fgrep",
        "find",
        "locate",
        "mlocate",
        "cat",
        "sed",
        "awk",
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ],
      "raw_values": [
        "grep",
        "egrep",
        "fgrep",
        "find",
        "locate",
        "mlocate",
        "cat",
        "sed",
        "awk",
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "grep",
        "egrep",
        "fgrep",
        "find",
        "locate",
        "mlocate",
        "cat",
        "sed",
        "awk",
        "which",
        "man",
        "chmod",
        "chown"
      ],
      "raw_values": [
        "grep",
        "/bin/grep",
        "/usr/bin/grep",
        "/usr/local/bin/grep",
        "egrep",
        "/bin/egrep",
        "/usr/bin/egrep",
        "/usr/local/bin/egrep",
        "fgrep",
        "/bin/fgrep",
        "/usr/bin/fgrep",
        "/usr/local/bin/fgrep",
        "find",
        "/bin/find",
        "/usr/bin/find",
        "/usr/local/bin/find",
        "locate",
        "/bin/locate",
        "/usr/bin/locate",
        "/usr/local/bin/locate",
        "mlocate",
        "/bin/mlocate",
        "/usr/bin/mlocate",
        "/usr/local/bin/mlocate",
        "cat",
        "/bin/cat",
        "/usr/bin/cat",
        "/usr/local/bin/cat",
        "sed",
        "/bin/sed",
        "/usr/bin/sed",
        "/usr/local/bin/sed",
        "awk",
        "/bin/awk",
        "/usr/bin/awk",
        "/usr/local/bin/awk",
        "which",
        "/bin/which",
        "/usr/bin/which",
        "/usr/local/bin/which",
        "man",
        "/bin/man",
        "/usr/bin/man",
        "/usr/local/bin/man",
        "chmod",
        "/bin/chmod",
        "/usr/bin/chmod",
        "/usr/local/bin/chmod",
        "chown",
        "/bin/chown",
        "/usr/bin/chown",
        "/usr/local/bin/chown"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n  process.name in (\"grep\", \"egrep\", \"fgrep\", \"find\", \"locate\", \"mlocate\", \"cat\", \"sed\", \"awk\") or\n  (\n    /* account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg */\n    process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\n    process.args in (\n      \"grep\", \"/bin/grep\", \"/usr/bin/grep\", \"/usr/local/bin/grep\",\n      \"egrep\", \"/bin/egrep\", \"/usr/bin/egrep\", \"/usr/local/bin/egrep\",\n      \"fgrep\", \"/bin/fgrep\", \"/usr/bin/fgrep\", \"/usr/local/bin/fgrep\",\n      \"find\", \"/bin/find\", \"/usr/bin/find\", \"/usr/local/bin/find\",\n      \"locate\", \"/bin/locate\", \"/usr/bin/locate\", \"/usr/local/bin/locate\",\n      \"mlocate\", \"/bin/mlocate\", \"/usr/bin/mlocate\", \"/usr/local/bin/mlocate\",\n      \"cat\", \"/bin/cat\", \"/usr/bin/cat\", \"/usr/local/bin/cat\",\n      \"sed\", \"/bin/sed\", \"/usr/bin/sed\", \"/usr/local/bin/sed\",\n      \"awk\", \"/bin/awk\", \"/usr/bin/awk\", \"/usr/local/bin/awk\"\n    ) and \n    /* default exclusion list to not FP on default multi-process commands */\n    not process.args in (\n      \"which\", \"/bin/which\", \"/usr/bin/which\", \"/usr/local/bin/which\",\n      \"man\", \"/bin/man\", \"/usr/bin/man\", \"/usr/local/bin/man\",\n      \"chmod\", \"/bin/chmod\", \"/usr/bin/chmod\", \"/usr/local/bin/chmod\",\n      \"chown\", \"/bin/chown\", \"/usr/bin/chown\", \"/usr/local/bin/chown\"\n    )\n  )\n) and\nprocess.args like~ (\n  \"*BEGIN PRIVATE*\", \"*BEGIN OPENSSH PRIVATE*\", \"*BEGIN RSA PRIVATE*\", \"*BEGIN DSA PRIVATE*\", \"*BEGIN EC PRIVATE*\",\n  \"*password*\", \"*ssh*\", \"*id_rsa*\", \"*id_dsa*\"\n) and process.interactive == true and container.id like \"*\" \n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/integrations/cloud_defend/credential_access_sensitive_keys_or_passwords_search_inside_a_container.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Data Source: Elastic Defend for Containers",
      "Domain: Container",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Credential Access",
      "Resources: Investigation Guide"
    ]
  }
}