{
  "id": "c19d1b69-c82c-513e-a775-a765aaf80a19",
  "catalog": "elastic",
  "name": "Potential Kubeletctl Execution Detected via Defend for Containers",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "--server",
        "run",
        "portforward",
        "scan",
        "attach",
        "exec",
        "pods",
        "runningpods",
        "cri",
        "pid2pod"
      ],
      "raw_values": [
        "-s",
        "--server",
        "run",
        "portForward",
        "scan",
        "attach",
        "exec",
        "pods",
        "runningpods",
        "cri",
        "pid2pod"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "kubeletctl"
      ],
      "raw_values": [
        "kubeletctl"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like",
      "values": [
        "kubeletctl"
      ],
      "raw_values": [
        "*kubeletctl*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n  (process.name == \"kubeletctl\" or process.args like \"*kubeletctl*\") or\n  (process.args in (\"-s\", \"--server\") and process.args in (\"run\", \"portForward\", \"scan\", \"attach\", \"exec\", \"pods\", \"runningpods\", \"cri\", \"pid2pod\"))\n) and\nprocess.interactive == true and container.id like \"?*\" \n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/integrations/cloud_defend/execution_kubeletctl_execution.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Data Source: Elastic Defend for Containers",
      "Domain: Container",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Tactic: Discovery",
      "Resources: Investigation Guide"
    ]
  }
}