{
  "id": "c2ae7827-c18e-55a7-a527-67814d217cc7",
  "catalog": "elastic",
  "name": "Active Directory Group Modification by SYSTEM",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.persistence"
  ],
  "event_categories": [
    "iam"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "4728"
      ],
      "raw_values": [
        "4728"
      ]
    },
    {
      "field": "winlog.event_data.subjectusersid",
      "raw_field": "winlog.event_data.SubjectUserSid",
      "operator": ":",
      "values": [
        "s-1-5-18"
      ],
      "raw_values": [
        "S-1-5-18"
      ]
    },
    {
      "field": "group.id",
      "raw_field": "group.id",
      "operator": ":",
      "values": [
        "s-1-5-21-*-513"
      ],
      "raw_values": [
        "S-1-5-21-*-513"
      ]
    }
  ],
  "raw_query": "iam where host.os.type == \"windows\" and event.code == \"4728\" and\nwinlog.event_data.SubjectUserSid : \"S-1-5-18\" and\n\n/* DOMAIN_USERS and local groups */\nnot group.id : \"S-1-5-21-*-513\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/persistence_group_modification_by_system.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Use Case: Active Directory Monitoring",
      "Data Source: Active Directory",
      "Data Source: Windows Security Event Logs",
      "Resources: Investigation Guide"
    ]
  }
}