{
  "id": "cb3905d5-5557-572d-ab07-cb696c35d298",
  "catalog": "elastic",
  "name": "Modification of Environment Variable via Unsigned or Untrusted Parent",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "launchctl"
      ],
      "raw_values": [
        "launchctl"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "==",
      "values": [
        "setenv"
      ],
      "raw_values": [
        "setenv"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n  process.name == \"launchctl\" and\n  (process.parent.code_signature.exists == false or process.parent.code_signature.trusted == false) and\n  process.args == \"setenv\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/defense_evasion_modify_environment_launchctl.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}