{
  "id": "cb58a609-5889-593a-bed0-ac499c799bd9",
  "catalog": "elastic",
  "name": "Launch Service Creation and Immediate Loading",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.persistence"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "launch_daemon"
      ],
      "raw_values": [
        "launch_daemon"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "launchctl"
      ],
      "raw_values": [
        "launchctl"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "==",
      "values": [
        "load"
      ],
      "raw_values": [
        "load"
      ]
    }
  ],
  "raw_query": "sequence by host.id with maxspan=30s\n [file where host.os.type == \"macos\" and event.action == \"launch_daemon\"] by process.entity_id\n [process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and process.name == \"launchctl\" and process.args == \"load\"] by process.parent.entity_id\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/persistence_creation_change_launch_agents_file.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}