{
  "id": "cbbc0a8d-e05c-500b-9d7e-1ccac0be2079",
  "catalog": "elastic",
  "name": "Potential Veeam Credential Access Command",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.defense-evasion",
    "attack.credential-access"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "invoke-sqlcmd",
        "invoke-sqlexecute",
        "invoke-dbaquery",
        "invoke-sqlquery",
        "[veeambackup].[dbo].[credentials]"
      ],
      "raw_values": [
        "Invoke-Sqlcmd",
        "Invoke-SqlExecute",
        "Invoke-DbaQuery",
        "Invoke-SqlQuery",
        "*[VeeamBackup].[dbo].[Credentials]*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "sqlcmd.exe"
      ],
      "raw_values": [
        "sqlcmd.exe"
      ]
    },
    {
      "field": "process.pe.original_file_name",
      "raw_field": "process.pe.original_file_name",
      "operator": ":",
      "values": [
        "sqlcmd.exe"
      ],
      "raw_values": [
        "sqlcmd.exe"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  (\n    (process.name : \"sqlcmd.exe\" or ?process.pe.original_file_name : \"sqlcmd.exe\") or\n    process.args : (\"Invoke-Sqlcmd\", \"Invoke-SqlExecute\", \"Invoke-DbaQuery\", \"Invoke-SqlQuery\")\n  ) and\n  process.args : \"*[VeeamBackup].[dbo].[Credentials]*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_veeam_commands.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Credential Access",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}