{
  "id": "d270895d-4e88-565d-906c-daa8fe536ce9",
  "catalog": "elastic",
  "name": "Entra ID Federated Identity Credential Issuer Modified",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "update application"
      ],
      "raw_values": [
        "Update application"
      ]
    }
  ],
  "raw_query": "from logs-azure.auditlogs-* metadata _id, _version, _index\n| where event.action == \"Update application\"\n| where `azure.auditlogs.properties.target_resources.0.modified_properties.0.display_name` == \"FederatedIdentityCredentials\"\n| eval Esql.target_resources_old_value_clean = replace(`azure.auditlogs.properties.target_resources.0.modified_properties.0.old_value`, \"\\\\\\\\\", \"\")\n| eval Esql.target_resources_new_value_clean = replace(`azure.auditlogs.properties.target_resources.0.modified_properties.0.new_value`, \"\\\\\\\\\", \"\")\n| dissect Esql.target_resources_old_value_clean \"%{}\\\"Issuer\\\":\\\"%{Esql.external_idp_old_issuer}\\\"%{}\"\n| dissect Esql.target_resources_new_value_clean \"%{}\\\"Issuer\\\":\\\"%{Esql.external_idp_new_issuer}\\\"%{}\"\n| where Esql.external_idp_old_issuer is not null and Esql.external_idp_new_issuer is not null\n| where Esql.external_idp_old_issuer != Esql.external_idp_new_issuer\n| keep @timestamp, Esql.*, azure.*, event.*, cloud.*, related.*, tags, source.*, agent.*, client.*, _id, _version, _index, data_stream.namespace\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/integrations/azure/persistence_entra_id_service_principal_federated_issuer_modified.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Cloud",
      "Domain: Identity",
      "Data Source: Azure",
      "Data Source: Microsoft Entra ID",
      "Data Source: Microsoft Entra ID Audit Logs",
      "Use Case: Identity and Access Audit",
      "Tactic: Persistence",
      "Tactic: Privilege Escalation",
      "Resources: Investigation Guide"
    ]
  }
}