{
  "id": "d807f185-c8ed-5dad-a699-9f53c64a650f",
  "catalog": "elastic",
  "name": "Cron Job Created or Modified",
  "description": "",
  "severity": "high",
  "mitre_techniques": [],
  "event_categories": [
    "file"
  ],
  "conditions": [
    {
      "field": "file.path",
      "raw_field": "file.path",
      "operator": ":",
      "values": [
        "cron.allow",
        "cron.deny",
        "crontab",
        "tmp.",
        "jumpcloud-updater"
      ],
      "raw_values": [
        "/etc/cron.allow",
        "/etc/cron.deny",
        "/etc/cron.d/*",
        "/etc/cron.hourly/*",
        "/etc/cron.daily/*",
        "/etc/cron.weekly/*",
        "/etc/cron.monthly/*",
        "/etc/crontab",
        "/var/spool/cron/crontabs/*",
        "/var/spool/anacron/*",
        "/var/spool/cron/crontabs/tmp.*",
        "/etc/cron.d/jumpcloud-updater"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "vmis.",
        "platform-python",
        "microsoft"
      ],
      "raw_values": [
        "/nix/store/*",
        "/var/lib/dpkg/*",
        "/tmp/vmis.*",
        "/snap/*",
        "/dev/fd/*",
        "/usr/libexec/platform-python*",
        "/var/lib/waagent/Microsoft*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "rename",
        "creation"
      ],
      "raw_values": [
        "rename",
        "creation"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": "in",
      "values": [
        "dpkg",
        "dockerd",
        "microdnf",
        "rpm",
        "snapd",
        "yum",
        "dnf",
        "podman",
        "dnf-automatic",
        "pacman",
        "dpkg-divert",
        "apk",
        "apt",
        "puppet",
        "chef-client",
        "autossl_check",
        "exe",
        "pamac-daemon",
        "platform-engine",
        "ruby",
        "platform-python",
        "python3",
        "utild",
        "anacron",
        "kaniko-executor",
        "pvedaemon",
        "systemd",
        "coreutils",
        "univention-config-registry",
        "dnf5",
        "snap-update-ns",
        "crond",
        "executor",
        "droplet-agent.postinst",
        "cf-agent",
        "schedd",
        "imunify-notifier",
        "jumpcloud-agent",
        "crio",
        "dnf_install",
        "vim"
      ],
      "raw_values": [
        "/bin/dpkg",
        "/usr/bin/dpkg",
        "/bin/dockerd",
        "/usr/bin/dockerd",
        "/usr/sbin/dockerd",
        "/bin/microdnf",
        "/usr/bin/microdnf",
        "/bin/rpm",
        "/usr/bin/rpm",
        "/bin/snapd",
        "/usr/bin/snapd",
        "/bin/yum",
        "/usr/bin/yum",
        "/bin/dnf",
        "/usr/bin/dnf",
        "/bin/podman",
        "/usr/bin/podman",
        "/bin/dnf-automatic",
        "/usr/bin/dnf-automatic",
        "/bin/pacman",
        "/usr/bin/pacman",
        "/usr/bin/dpkg-divert",
        "/bin/dpkg-divert",
        "/sbin/apk",
        "/usr/sbin/apk",
        "/usr/local/sbin/apk",
        "/usr/bin/apt",
        "/usr/sbin/pacman",
        "/usr/bin/puppet",
        "/bin/puppet",
        "/opt/puppetlabs/puppet/bin/puppet",
        "/usr/bin/chef-client",
        "/bin/chef-client",
        "/bin/autossl_check",
        "/usr/bin/autossl_check",
        "/proc/self/exe",
        "/usr/bin/pamac-daemon",
        "/bin/pamac-daemon",
        "/usr/local/bin/dockerd",
        "/opt/elasticbeanstalk/bin/platform-engine",
        "/opt/puppetlabs/puppet/bin/ruby",
        "/usr/libexec/platform-python",
        "/opt/imunify360/venv/bin/python3",
        "/opt/eset/efs/lib/utild",
        "/usr/sbin/anacron",
        "/kaniko/kaniko-executor",
        "/usr/bin/pvedaemon",
        "./usr/bin/podman",
        "/usr/lib/systemd/systemd",
        "/usr/bin/coreutils",
        "/usr/sbin/univention-config-registry",
        "/usr/bin/dnf5",
        "./usr/lib/snapd/snap-update-ns",
        "crond",
        "executor",
        "puppet",
        "droplet-agent.postinst",
        "cf-agent",
        "schedd",
        "imunify-notifier",
        "jumpcloud-agent",
        "crio",
        "dnf_install",
        "utild",
        "vi",
        "vim"
      ]
    },
    {
      "field": "file.extension",
      "raw_field": "file.extension",
      "operator": "in",
      "values": [
        "swp",
        "swpx",
        "swx",
        "dpkg-remove"
      ],
      "raw_values": [
        "swp",
        "swpx",
        "swx",
        "dpkg-remove"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "file.ext.original.extension",
      "raw_field": "file.Ext.original.extension",
      "operator": "==",
      "values": [
        "dpkg-new"
      ],
      "raw_values": [
        "dpkg-new"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sed",
        "perl"
      ],
      "raw_values": [
        "sed",
        "perl"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": "like",
      "values": [
        "sed",
        "e2scrub_all.tmp"
      ],
      "raw_values": [
        "sed*",
        "e2scrub_all.tmp*",
        "*~"
      ]
    }
  ],
  "raw_query": "file where host.os.type == \"linux\" and event.action in (\"rename\", \"creation\") and file.path like (\n  \"/etc/cron.allow\", \"/etc/cron.deny\", \"/etc/cron.d/*\", \"/etc/cron.hourly/*\", \"/etc/cron.daily/*\", \"/etc/cron.weekly/*\",\n  \"/etc/cron.monthly/*\", \"/etc/crontab\", \"/var/spool/cron/crontabs/*\", \"/var/spool/anacron/*\"\n) and not (\n  process.executable in (\n    \"/bin/dpkg\", \"/usr/bin/dpkg\", \"/bin/dockerd\", \"/usr/bin/dockerd\", \"/usr/sbin/dockerd\", \"/bin/microdnf\",\n    \"/usr/bin/microdnf\", \"/bin/rpm\", \"/usr/bin/rpm\", \"/bin/snapd\", \"/usr/bin/snapd\", \"/bin/yum\", \"/usr/bin/yum\",\n    \"/bin/dnf\", \"/usr/bin/dnf\", \"/bin/podman\", \"/usr/bin/podman\", \"/bin/dnf-automatic\", \"/usr/bin/dnf-automatic\",\n    \"/bin/pacman\", \"/usr/bin/pacman\", \"/usr/bin/dpkg-divert\", \"/bin/dpkg-divert\", \"/sbin/apk\", \"/usr/sbin/apk\",\n    \"/usr/local/sbin/apk\", \"/usr/bin/apt\", \"/usr/sbin/pacman\", \"/bin/podman\", \"/usr/bin/podman\", \"/usr/bin/puppet\",\n    \"/bin/puppet\", \"/opt/puppetlabs/puppet/bin/puppet\", \"/usr/bin/chef-client\", \"/bin/chef-client\",\n    \"/bin/autossl_check\", \"/usr/bin/autossl_check\", \"/proc/self/exe\", \"/usr/bin/pamac-daemon\",\n    \"/bin/pamac-daemon\", \"/usr/local/bin/dockerd\", \"/opt/elasticbeanstalk/bin/platform-engine\",\n    \"/opt/puppetlabs/puppet/bin/ruby\", \"/usr/libexec/platform-python\", \"/opt/imunify360/venv/bin/python3\",\n    \"/opt/eset/efs/lib/utild\", \"/usr/sbin/anacron\", \"/usr/bin/podman\", \"/kaniko/kaniko-executor\",\n    \"/usr/bin/pvedaemon\", \"./usr/bin/podman\", \"/usr/lib/systemd/systemd\", \"./usr/bin/podman\", \"/usr/bin/coreutils\",\n    \"/usr/sbin/univention-config-registry\", \"/usr/bin/dnf5\", \"./usr/lib/snapd/snap-update-ns\"\n  ) or\n  file.path like (\"/var/spool/cron/crontabs/tmp.*\", \"/etc/cron.d/jumpcloud-updater\") or\n  file.extension in (\"swp\", \"swpx\", \"swx\", \"dpkg-remove\") or\n  file.Ext.original.extension == \"dpkg-new\" or\n  process.executable like (\n    \"/nix/store/*\", \"/var/lib/dpkg/*\", \"/tmp/vmis.*\", \"/snap/*\", \"/dev/fd/*\", \"/usr/libexec/platform-python*\",\n    \"/var/lib/waagent/Microsoft*\"\n  ) or\n  process.executable == null or\n  process.name in (\n    \"crond\", \"executor\", \"puppet\", \"droplet-agent.postinst\", \"cf-agent\", \"schedd\", \"imunify-notifier\",\n    \"jumpcloud-agent\", \"crio\", \"dnf_install\", \"utild\"\n  ) or\n  (process.name == \"sed\" and file.name like \"sed*\") or\n  (process.name == \"perl\" and file.name like \"e2scrub_all.tmp*\")  or\n  (process.name in (\"vi\", \"vim\") and file.name like \"*~\")\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_cron_job_creation.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Privilege Escalation",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}