{
  "id": "dabc2c55-2ced-55a6-a2ab-5741488eb8d6",
  "catalog": "elastic",
  "name": "Control Panel Process with Unusual Arguments",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        ".jpg",
        ".png",
        ".gif",
        ".bmp",
        ".jpeg",
        ".tiff",
        ".inf"
      ],
      "raw_values": [
        "*.jpg*",
        "*.png*",
        "*.gif*",
        "*.bmp*",
        "*.jpeg*",
        "*.TIFF*",
        "*.inf*",
        "*.cpl:*/*",
        "*../../..*",
        "*/AppData/Local/*",
        "*:\\\\Users\\\\Public\\\\*",
        "*\\\\AppData\\\\Local\\\\*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "control.exe"
      ],
      "raw_values": [
        "control.exe"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.name : \"control.exe\" and\n  process.command_line : (\n    \"*.jpg*\", \"*.png*\",\n    \"*.gif*\", \"*.bmp*\",\n    \"*.jpeg*\", \"*.TIFF*\",\n    \"*.inf*\", \"*.cpl:*/*\",\n    \"*../../..*\",\n    \"*/AppData/Local/*\",\n    \"*:\\\\Users\\\\Public\\\\*\",\n    \"*\\\\AppData\\\\Local\\\\*\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/defense_evasion_execution_control_panel_suspicious_args.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Defense Evasion",
      "Tactic: Execution",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike",
      "Resources: Investigation Guide"
    ]
  }
}