{
  "id": "dc55466a-7f13-532b-95db-5574635ad000",
  "catalog": "elastic",
  "name": "Suspicious SIP Check by macOS Application",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.discovery",
    "attack.defense-evasion"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like",
      "values": [
        "csrutil*status",
        "enabled"
      ],
      "raw_values": [
        "*csrutil*status*",
        "*enabled*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "==",
      "values": [
        "mosylemdm"
      ],
      "raw_values": [
        "/Library/Application Support/Mosyle/MosyleMDM.app/Contents/MacOS/MosyleMDM"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type == \"start\" and event.action == \"exec\" and\n  process.command_line like \"*csrutil*status*\" and\n  process.command_line like \"*enabled*\" and\n  (process.parent.executable like \"/*.app/*\" or\n   process.parent.executable like \"/Applications/*.app/*\" or\n   process.parent.executable like \"/Volumes/*.app/*\") and\n  not process.parent.executable == \"/Library/Application Support/Mosyle/MosyleMDM.app/Contents/MacOS/MosyleMDM\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/discovery_suspicious_sip_check.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Discovery",
      "Tactic: Defense Evasion",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}