{
  "id": "dc970cc8-1fd7-589e-8e52-a586d32c6cde",
  "catalog": "elastic",
  "name": "Potential SAP NetWeaver Exploitation",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.execution"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "bash",
        "dash",
        "ksh",
        "tcsh",
        "zsh",
        "curl",
        "perl",
        "python",
        "ruby",
        "php",
        "wget",
        "cmd.exe",
        "powershell.exe",
        "rundll32.exe",
        "msbuild.exe",
        "curl.exe",
        "certutil.exe"
      ],
      "raw_values": [
        "sh",
        "bash",
        "dash",
        "ksh",
        "tcsh",
        "zsh",
        "curl",
        "perl*",
        "python*",
        "ruby*",
        "php*",
        "wget",
        "cmd.exe",
        "powershell.exe",
        "rundll32.exe",
        "msbuild.exe",
        "curl.exe",
        "certutil.exe"
      ]
    },
    {
      "field": "process.working_directory",
      "raw_field": "process.working_directory",
      "operator": ":",
      "values": [
        "/*/sap.com*/servlet_jsp/irj/",
        "\\\\sap.com*\\\\servlet_jsp\\\\irj\\\\"
      ],
      "raw_values": [
        "/*/sap.com*/servlet_jsp/irj/*",
        "*\\\\sap.com*\\\\servlet_jsp\\\\irj\\\\*"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "in",
      "values": [
        "linux",
        "windows"
      ],
      "raw_values": [
        "linux",
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where event.type == \"start\" and host.os.type in (\"linux\", \"windows\") and\n   process.name : (\"sh\",\n                   \"bash\",\n                   \"dash\",\n                   \"ksh\",\n                   \"tcsh\",\n                   \"zsh\",\n                   \"curl\",\n                   \"perl*\",\n                   \"python*\",\n                   \"ruby*\",\n                   \"php*\",\n                   \"wget\",\n                   \"cmd.exe\",\n                   \"powershell.exe\",\n                   \"rundll32.exe\",\n                   \"msbuild.exe\",\n                   \"curl.exe\",\n                   \"certutil.exe\") and\n   (\n    process.working_directory : (\"/*/sap.com*/servlet_jsp/irj/*\", \"*\\\\sap.com*\\\\servlet_jsp\\\\irj\\\\*\") or\n    process.command_line : (\"*/sap.com*/servlet_jsp/irj/*\", \"*\\\\sap.com*\\\\servlet_jsp\\\\irj\\\\*\") or\n    process.parent.command_line : (\"*/sap.com*/servlet_jsp/irj/*\", \"*\\\\sap.com*\\\\servlet_jsp\\\\irj\\\\*\")\n   )\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/cross-platform/execution_sap_netweaver_webshell_exec.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Use Case: Vulnerability",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}