{
  "id": "de32ca73-6922-547f-844d-5bade8afb50d",
  "catalog": "elastic",
  "name": "Suspicious Image Load (taskschd.dll) from MS Office",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": ":",
      "values": [
        "library",
        "driver"
      ],
      "raw_values": [
        "library",
        "driver"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "winword.exe",
        "excel.exe",
        "powerpnt.exe",
        "mspub.exe",
        "msaccess.exe"
      ],
      "raw_values": [
        "WINWORD.EXE",
        "EXCEL.EXE",
        "POWERPNT.EXE",
        "MSPUB.EXE",
        "MSACCESS.EXE"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "process"
      ],
      "raw_values": [
        "process"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": ":",
      "values": [
        "image loaded"
      ],
      "raw_values": [
        "Image loaded*"
      ]
    },
    {
      "field": "dll.name",
      "raw_field": "dll.name",
      "operator": ":",
      "values": [
        "taskschd.dll"
      ],
      "raw_values": [
        "taskschd.dll"
      ]
    },
    {
      "field": "file.name",
      "raw_field": "file.name",
      "operator": ":",
      "values": [
        "taskschd.dll"
      ],
      "raw_values": [
        "taskschd.dll"
      ]
    }
  ],
  "raw_query": "any where host.os.type == \"windows\" and\n (event.category : (\"library\", \"driver\") or (event.category == \"process\" and event.action : \"Image loaded*\")) and\n  process.name : (\"WINWORD.EXE\", \"EXCEL.EXE\", \"POWERPNT.EXE\", \"MSPUB.EXE\", \"MSACCESS.EXE\") and\n  (?dll.name : \"taskschd.dll\" or file.name : \"taskschd.dll\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/persistence_suspicious_image_load_scheduled_task_ms_office.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Execution",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Sysmon",
      "Resources: Investigation Guide"
    ]
  }
}