{
  "id": "de453a57-3303-52a7-a34b-759c0d4f0c98",
  "catalog": "elastic",
  "name": "Web Server Spawned via Python",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.execution"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "http.server",
        "simplehttpserver"
      ],
      "raw_values": [
        "http.server",
        "SimpleHTTPServer"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "like",
      "values": [
        "python"
      ],
      "raw_values": [
        "python*"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like~",
      "values": [
        "python* -m http.server"
      ],
      "raw_values": [
        "*python* -m http.server*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "==",
      "values": [
        "systemd"
      ],
      "raw_values": [
        "/usr/lib/systemd/systemd"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\") and\n(\n  (process.name like \"python*\" and process.args in (\"http.server\", \"SimpleHTTPServer\")) or\n  (\n    process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\") and\n    process.command_line like~ \"*python* -m http.server*\"\n  )\n) and\nnot process.parent.executable == \"/usr/lib/systemd/systemd\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/execution_python_webserver_spawned.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Data Source: Elastic Endgame",
      "Resources: Investigation Guide"
    ]
  }
}