{
  "id": "e15b5477-d5b3-56ee-a4fd-586e70689cdc",
  "catalog": "elastic",
  "name": "Kernel Driver Load",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.persistence",
    "attack.defense-evasion"
  ],
  "event_categories": [
    "driver"
  ],
  "conditions": [
    {
      "field": "auditd.data.syscall",
      "raw_field": "auditd.data.syscall",
      "operator": "in",
      "values": [
        "init_module",
        "finit_module"
      ],
      "raw_values": [
        "init_module",
        "finit_module"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "loaded-kernel-module"
      ],
      "raw_values": [
        "loaded-kernel-module"
      ]
    }
  ],
  "raw_query": "driver where host.os.type == \"linux\" and event.action == \"loaded-kernel-module\" and\nauditd.data.syscall in (\"init_module\", \"finit_module\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_kernel_driver_load.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Data Source: Auditd Manager",
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Defense Evasion",
      "Resources: Investigation Guide"
    ]
  }
}