{
  "id": "e4cd583d-4f0e-5e90-adff-85c42a319d1a",
  "catalog": "elastic",
  "name": "Potential Suspicious DebugFS Root Device Access",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "debugfs"
      ],
      "raw_values": [
        "debugfs"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\nprocess.name == \"debugfs\" and process.args : \"/dev/sd*\" and not process.args == \"-R\" and\nnot user.Ext.real.id == \"0\" and not group.Ext.real.id == \"0\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/privilege_escalation_sda_disk_mount_non_root.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}