{
  "id": "e5f5e56b-51d4-577e-9176-9364a6fcf71a",
  "catalog": "elastic",
  "name": "Potential Sudo Privilege Escalation via CVE-2019-14287",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2",
        "executed",
        "process_started"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2",
        "executed",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sudo"
      ],
      "raw_values": [
        "sudo"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "==",
      "values": [
        "-u#-1"
      ],
      "raw_values": [
        "-u#-1"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\n  event.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\", \"executed\", \"process_started\") and\n  process.name == \"sudo\" and process.args == \"-u#-1\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/privilege_escalation_sudo_cve_2019_14287.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Data Source: Elastic Defend",
      "Use Case: Vulnerability",
      "Data Source: Elastic Endgame",
      "Data Source: Auditd Manager",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}