{
  "id": "e77ce966-1103-541b-98b9-eb396be1b61c",
  "catalog": "elastic",
  "name": "Suspicious PDF Reader Child Process",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.execution",
    "attack.initial-access"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "acrord32.exe",
        "acrobat.exe",
        "foxitphantompdf.exe",
        "foxitreader.exe"
      ],
      "raw_values": [
        "AcroRd32.exe",
        "Acrobat.exe",
        "FoxitPhantomPDF.exe",
        "FoxitReader.exe"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": ":",
      "values": [
        "arp.exe",
        "dsquery.exe",
        "dsget.exe",
        "gpresult.exe",
        "hostname.exe",
        "ipconfig.exe",
        "nbtstat.exe",
        "net.exe",
        "net1.exe",
        "netsh.exe",
        "netstat.exe",
        "nltest.exe",
        "ping.exe",
        "qprocess.exe",
        "quser.exe",
        "qwinsta.exe",
        "reg.exe",
        "sc.exe",
        "systeminfo.exe",
        "tasklist.exe",
        "tracert.exe",
        "whoami.exe",
        "bginfo.exe",
        "cdb.exe",
        "cmstp.exe",
        "csi.exe",
        "dnx.exe",
        "fsi.exe",
        "ieexec.exe",
        "iexpress.exe",
        "installutil.exe",
        "microsoft.workflow.compiler.exe",
        "msbuild.exe",
        "mshta.exe",
        "msxsl.exe",
        "odbcconf.exe",
        "rcsi.exe",
        "regsvr32.exe",
        "xwizard.exe",
        "atbroker.exe",
        "forfiles.exe",
        "schtasks.exe",
        "regasm.exe",
        "regsvcs.exe",
        "cmd.exe",
        "cscript.exe",
        "powershell.exe",
        "pwsh.exe",
        "wmic.exe",
        "wscript.exe",
        "bitsadmin.exe",
        "certutil.exe",
        "ftp.exe"
      ],
      "raw_values": [
        "arp.exe",
        "dsquery.exe",
        "dsget.exe",
        "gpresult.exe",
        "hostname.exe",
        "ipconfig.exe",
        "nbtstat.exe",
        "net.exe",
        "net1.exe",
        "netsh.exe",
        "netstat.exe",
        "nltest.exe",
        "ping.exe",
        "qprocess.exe",
        "quser.exe",
        "qwinsta.exe",
        "reg.exe",
        "sc.exe",
        "systeminfo.exe",
        "tasklist.exe",
        "tracert.exe",
        "whoami.exe",
        "bginfo.exe",
        "cdb.exe",
        "cmstp.exe",
        "csi.exe",
        "dnx.exe",
        "fsi.exe",
        "ieexec.exe",
        "iexpress.exe",
        "installutil.exe",
        "Microsoft.Workflow.Compiler.exe",
        "msbuild.exe",
        "mshta.exe",
        "msxsl.exe",
        "odbcconf.exe",
        "rcsi.exe",
        "regsvr32.exe",
        "xwizard.exe",
        "atbroker.exe",
        "forfiles.exe",
        "schtasks.exe",
        "regasm.exe",
        "regsvcs.exe",
        "cmd.exe",
        "cscript.exe",
        "powershell.exe",
        "pwsh.exe",
        "wmic.exe",
        "wscript.exe",
        "bitsadmin.exe",
        "certutil.exe",
        "ftp.exe"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.parent.name : (\"AcroRd32.exe\",\n                         \"Acrobat.exe\",\n                         \"FoxitPhantomPDF.exe\",\n                         \"FoxitReader.exe\") and\n  process.name : (\"arp.exe\", \"dsquery.exe\", \"dsget.exe\", \"gpresult.exe\", \"hostname.exe\", \"ipconfig.exe\", \"nbtstat.exe\",\n                  \"net.exe\", \"net1.exe\", \"netsh.exe\", \"netstat.exe\", \"nltest.exe\", \"ping.exe\", \"qprocess.exe\",\n                  \"quser.exe\", \"qwinsta.exe\", \"reg.exe\", \"sc.exe\", \"systeminfo.exe\", \"tasklist.exe\", \"tracert.exe\",\n                  \"whoami.exe\", \"bginfo.exe\", \"cdb.exe\", \"cmstp.exe\", \"csi.exe\", \"dnx.exe\", \"fsi.exe\", \"ieexec.exe\",\n                  \"iexpress.exe\", \"installutil.exe\", \"Microsoft.Workflow.Compiler.exe\", \"msbuild.exe\", \"mshta.exe\",\n                  \"msxsl.exe\", \"odbcconf.exe\", \"rcsi.exe\", \"regsvr32.exe\", \"xwizard.exe\", \"atbroker.exe\",\n                  \"forfiles.exe\", \"schtasks.exe\", \"regasm.exe\", \"regsvcs.exe\", \"cmd.exe\", \"cscript.exe\",\n                  \"powershell.exe\", \"pwsh.exe\", \"wmic.exe\", \"wscript.exe\", \"bitsadmin.exe\", \"certutil.exe\", \"ftp.exe\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/execution_suspicious_pdf_reader.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Execution",
      "Tactic: Initial Access",
      "Resources: Investigation Guide",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: Windows Security Event Logs",
      "Data Source: Microsoft Defender for Endpoint",
      "Data Source: Sysmon",
      "Data Source: SentinelOne",
      "Data Source: Crowdstrike"
    ]
  }
}