{
  "id": "ec2418fe-4258-5159-a841-7161d6875946",
  "catalog": "elastic",
  "name": "Web Server Exploitation Detected via Defend for Containers",
  "description": "",
  "severity": "critical",
  "mitre_techniques": [
    "attack.persistence",
    "attack.execution",
    "attack.command-and-control"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": ":",
      "values": [
        "php-fpm",
        "gunicorn",
        ".cgi",
        ".fcgi"
      ],
      "raw_values": [
        "php-fpm*",
        "gunicorn*",
        "*.cgi",
        "*.fcgi"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": "like~",
      "values": [
        "puma",
        "rails",
        "passenger",
        "hypercorn",
        "flask",
        "uvicorn",
        "django",
        "app.py",
        "server.py",
        "wsgi.py",
        "asgi.py",
        "next start",
        "--port",
        "port=",
        "host=",
        "0.0.0.0",
        "/dist/*.js",
        "/build/*.js",
        "/server/*.js",
        "/app/*.js",
        "/apps/*/*.js",
        "/index.js",
        "/main.js",
        "/srv/",
        "/opt/",
        "/var/www/",
        "org.apache.catalina.startup.bootstrap",
        "-dcatalina.base=",
        "org.eclipse.jetty.start.main",
        "-djetty.home=",
        "org.jboss.modules.main",
        "-djboss.home.dir=",
        "weblogic.server",
        "-dweblogic.name=",
        "weblogic-launcher.jar",
        "com.ibm.ws.runtime.wsserver",
        "com.ibm.ws.kernel.boot.cmdline.bootstrap",
        "com.sun.enterprise.glassfish.bootstrap.asmain",
        "com.caucho.server.resin.resin",
        "org.springframework.boot.loader.",
        "quarkus-run.jar",
        "io.quarkus.runner.generatedmain",
        "io.micronaut.runtime.micronaut",
        "io.dropwizard.cli.servercommand",
        "play.core.server.prodserverstart",
        "io.helidon.microprofile.server.main",
        "io.helidon.webserver",
        "io.vertx.core.launcher",
        "org.keycloak",
        "org.apereo.cas",
        "org.elasticsearch.bootstrap.elasticsearch",
        "com.atlassian.jira.startup.launcher",
        "bitbucketserverlauncher",
        "com.google.gerrit.pgm.daemon",
        "-dsolr.solr.home=",
        "plackup"
      ],
      "raw_values": [
        "*puma*",
        "*rails*",
        "*passenger*",
        "*hypercorn*",
        "*flask*",
        "*uvicorn*",
        "*django*",
        "*app.py*",
        "*server.py*",
        "*wsgi.py*",
        "*asgi.py*",
        "*next start*",
        "*--port*",
        "*PORT=*",
        "*HOST=*",
        "*0.0.0.0*",
        "*/dist/*.js*",
        "*/build/*.js*",
        "*/server/*.js*",
        "*/app/*.js*",
        "*/apps/*/*.js*",
        "*/index.js*",
        "*/main.js*",
        "*/srv/*",
        "*/opt/*",
        "*/var/www/*",
        "org.apache.catalina.startup.Bootstrap",
        "-Dcatalina.base=*",
        "org.eclipse.jetty.start.Main",
        "-Djetty.home=*",
        "org.jboss.modules.Main",
        "-Djboss.home.dir=*",
        "weblogic.Server",
        "-Dweblogic.Name=*",
        "*weblogic-launcher.jar*",
        "com.ibm.ws.runtime.WsServer",
        "com.ibm.ws.kernel.boot.cmdline.Bootstrap",
        "com.sun.enterprise.glassfish.bootstrap.ASMain",
        "com.caucho.server.resin.Resin",
        "org.springframework.boot.loader.*",
        "*quarkus-run.jar*",
        "io.quarkus.runner.GeneratedMain",
        "io.micronaut.runtime.Micronaut",
        "io.dropwizard.cli.ServerCommand",
        "play.core.server.ProdServerStart",
        "io.helidon.microprofile.server.Main",
        "io.helidon.webserver*",
        "io.vertx.core.Launcher",
        "org.keycloak*",
        "org.apereo.cas*",
        "org.elasticsearch.bootstrap.Elasticsearch",
        "com.atlassian.jira.startup.Launcher",
        "*BitbucketServerLauncher*",
        "com.google.gerrit.pgm.Daemon",
        "*-Dsolr.solr.home=*",
        "*plackup*"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": ":",
      "values": [
        "/opt/cursor-agent/",
        "/home/*/",
        "/root/",
        "/opt/vscode-server/",
        "/usr/lib/node_modules/openclaw/dist/index.js"
      ],
      "raw_values": [
        "/opt/cursor-agent/*",
        "/home/*/*",
        "/root/*",
        "/opt/vscode-server/*",
        "/usr/lib/node_modules/openclaw/dist/index.js"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": ":",
      "values": [
        "python* -c",
        "php* -r",
        "perl* -e",
        "ruby* -e",
        "lua* -e",
        "node * -e",
        "base64 -*d",
        "|*base64",
        "xxd",
        "openssl*enc * -d",
        "netcat",
        "ncat",
        "tcp",
        "socat",
        "openssl*s_client",
        "stty*raw*-echo",
        "cron",
        "ssh",
        ".ssh",
        "shadow",
        "passwd",
        "chpasswd",
        "aws_access_key_id",
        "aws_secret_access_key",
        "aws_session_token",
        "accesskeyid",
        "secretaccesskey",
        "access_key",
        "credentials",
        "config",
        "azure_client_id",
        "azure_tenant_id",
        "azure_client_secret",
        "azure_federated_token_file",
        "identity_endpoint",
        "identity_header",
        "msi_endpoint",
        "msi_secret",
        "application_default_credentials.json",
        "type: service_account",
        "client_email",
        "private_key_id",
        "private_key",
        "google_application_credentials",
        "config.json",
        ".npmrc",
        "nohup",
        "setsid",
        "timeout *sh -c",
        "disown",
        "env *sh *-c",
        "echo",
        "chattr",
        "busybox",
        "chmod +x",
        "chmod 777",
        "gzip -*d",
        "bzip2 -*d",
        "xz -*d",
        "tar -*x",
        "|*sh",
        "|*python",
        "|*php",
        "|*perl",
        "|*ruby",
        "|*node",
        "|*lua",
        "|*busybox",
        "wget",
        "curl",
        "resty-",
        "resty",
        "null 2>&1 &"
      ],
      "raw_values": [
        "* /tmp/* ",
        "* /var/tmp/* ",
        "* /dev/shm/*",
        "* /var/www/*",
        "* /run/*",
        "* /var/run/*",
        "*python* -c*",
        "*php* -r*",
        "*perl* -e*",
        "*ruby* -e*",
        "*lua* -e*",
        "*node * -e *",
        "*base64 -*d*",
        "*|*base64 *",
        "*xxd *",
        "*openssl*enc * -d *",
        "*netcat *",
        "* nc *",
        "*ncat *",
        "*/dev/tcp*",
        "*/dev/udp/*",
        " *socat *",
        "*openssl*s_client *",
        "*stty*raw*-echo*",
        "*>*/etc/cron*",
        "*/etc/ssh*",
        "*/home/*/.ssh/*",
        "*/root/.ssh*",
        "*~/.ssh/*",
        "*/etc/shadow*",
        "*/etc/passwd*",
        "*chpasswd*",
        "*aws_access_key_id*",
        "*aws_secret_access_key*",
        "*aws_session_token*",
        "*accesskeyid*",
        "*secretaccesskey*",
        "*access_key*",
        "*.aws/credentials*",
        "*/.aws/config*",
        "*AZURE_CLIENT_ID*",
        "*AZURE_TENANT_ID*",
        "*AZURE_CLIENT_SECRET*",
        "*AZURE_FEDERATED_TOKEN_FILE*",
        "*IDENTITY_ENDPOINT*",
        "*IDENTITY_HEADER*",
        "*MSI_ENDPOINT*",
        "*MSI_SECRET*",
        "*/.azure/*",
        "*/run/secrets/azure/*",
        "*/.config/gcloud/*",
        "*application_default_credentials.json*",
        "*type: service_account*",
        "*client_email*",
        "*private_key_id*",
        "*private_key*",
        "*/run/secrets/google/*",
        "*GOOGLE_APPLICATION_CREDENTIALS*",
        "*/.docker/config.json*",
        "*/.npmrc*",
        "*/secrets/kubernetes.io/serviceaccount/*",
        "*nohup*",
        "*setsid *",
        "*timeout *sh -c *",
        "*disown*",
        "*env *sh *-c*",
        "*echo *",
        "*chattr *",
        "*busybox *",
        "*#!*",
        "*chmod +x *",
        "*chmod 777*",
        "*gzip -*d *",
        "*bzip2 -*d *",
        "*xz -*d *",
        "*tar -*x*",
        "*../../../*etc/*",
        "*/.../*",
        "*../../../*home/*/*",
        "*../../../*root/*",
        "*|*sh",
        "*|*python*",
        "*|*php*",
        "*|*perl*",
        "*|*ruby*",
        "*|*node*",
        "*|*lua*",
        "*|*busybox*",
        "*wget *",
        "*curl *",
        "*http://*",
        "*https://*",
        "* /tmp/*",
        "* /var/tmp/*",
        "* /dev/shm/* ",
        "* ~/*",
        "* /home/*",
        "chmod 777 /etc/resty-*",
        "resty*",
        "nohup php /home/*/public_html/lockindex.php index.php >/dev/null 2>&1 &",
        "nohup php /home/*/public_html/wp-content/* >> /dev/null 2>&1 &",
        "nohup php /home/*/public_html/wp-includes/* >> /dev/null 2>&1 &",
        "nohup php /home/*/public_html/*/wp-content/* >> /dev/null 2>&1 &"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "like~",
      "values": [
        "--output",
        "-o-"
      ],
      "raw_values": [
        "* -o *",
        "* --output*",
        "* -o- *"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "nginx",
        "apache2",
        "httpd",
        "caddy",
        "mongrel_rails",
        "uwsgi",
        "daphne",
        "httpd.worker",
        "flask",
        "php-cgi",
        "php-fcgi",
        "php-cgi.cagefs",
        "lswsctrl",
        "varnishd",
        "uvicorn",
        "waitress-serve",
        "starman"
      ],
      "raw_values": [
        "nginx",
        "apache2",
        "httpd",
        "caddy",
        "mongrel_rails",
        "uwsgi",
        "daphne",
        "httpd.worker",
        "flask",
        "php-cgi",
        "php-fcgi",
        "php-cgi.cagefs",
        "lswsctrl",
        "varnishd",
        "uvicorn",
        "waitress-serve",
        "starman"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish",
        "busybox"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "-cl",
        "-lc"
      ],
      "raw_values": [
        "-c",
        "-cl",
        "-lc"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "exec"
      ],
      "raw_values": [
        "exec"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "like",
      "values": [
        "ruby",
        "python",
        "perl",
        "php-fpm"
      ],
      "raw_values": [
        "ruby*",
        "python*",
        "perl*",
        "php-fpm*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "==",
      "values": [
        "node",
        "java",
        "nginx",
        "apache2",
        "php-cgi"
      ],
      "raw_values": [
        "node",
        "java",
        "nginx",
        "apache2",
        "php-cgi"
      ]
    }
  ],
  "raw_query": "process where event.type == \"start\" and event.action == \"exec\" and process.parent.interactive == false and\ncontainer.id like \"?*\" and (\n  process.parent.name in (\n    \"nginx\", \"apache2\", \"httpd\", \"caddy\", \"mongrel_rails\", \"uwsgi\", \"daphne\", \"httpd.worker\", \"flask\",\n    \"php-cgi\", \"php-fcgi\", \"php-cgi.cagefs\", \"lswsctrl\", \"varnishd\", \"uvicorn\", \"waitress-serve\", \"starman\"\n  ) or\n  process.parent.name like (\"php-fpm*\", \"gunicorn*\", \"*.cgi\", \"*.fcgi\") or\n  (process.parent.name like \"ruby*\" and process.parent.args like~ (\"*puma*\", \"*rails*\", \"*passenger*\")) or\n  (process.parent.name like \"python*\" and process.parent.args like~ (\n    \"*hypercorn*\", \"*flask*\", \"*uvicorn*\", \"*django*\", \"*app.py*\", \"*server.py*\", \"*wsgi.py*\", \"*asgi.py*\"\n  )) or\n  (process.parent.name like \"perl*\" and process.parent.args like~ \"*plackup*\") or\n  (process.parent.name == \"node\" and process.parent.args like~ (\n    \"*next start*\", \"*--port*\", \"*PORT=*\", \"*HOST=*\", \"*0.0.0.0*\", \"*/dist/*.js*\", \"*/build/*.js*\", \"*/server/*.js*\",\n    \"*/app/*.js*\",\"*/apps/*/*.js*\", \"*/index.js*\", \"*/main.js*\", \"*/srv/*\", \"*/opt/*\", \"*/var/www/*\"\n    ) and\n    not process.parent.args like (\"/opt/cursor-agent/*\", \"/home/*/*\", \"/root/*\", \"/opt/vscode-server/*\", \"/usr/lib/node_modules/openclaw/dist/index.js\") \n  ) or\n  (process.parent.name == \"java\" and process.parent.args like~ (\n    /* Tomcat */\n    \"org.apache.catalina.startup.Bootstrap\", \"-Dcatalina.base=*\",\n\n    /* Jetty */\n    \"org.eclipse.jetty.start.Main\", \"-Djetty.home=*\",\n\n    /* WildFly / JBoss */\n    \"org.jboss.modules.Main\", \"-Djboss.home.dir=*\",\n\n    /* WebLogic */\n    \"weblogic.Server\", \"-Dweblogic.Name=*\", \"*weblogic-launcher.jar*\",\n\n    /* WebSphere traditional + Liberty */\n    \"com.ibm.ws.runtime.WsServer\", \"com.ibm.ws.kernel.boot.cmdline.Bootstrap\",\n\n    /* GlassFish */\n    \"com.sun.enterprise.glassfish.bootstrap.ASMain\",\n\n    /* Resin */\n    \"com.caucho.server.resin.Resin\",\n\n    /* Spring Boot */\n    \"org.springframework.boot.loader.*\",\n\n    /* Quarkus */\n    \"*quarkus-run.jar*\", \"io.quarkus.runner.GeneratedMain\",\n\n    /* Micronaut */\n    \"io.micronaut.runtime.Micronaut\",\n\n    /* Dropwizard */\n    \"io.dropwizard.cli.ServerCommand\",\n\n    /* Play */\n    \"play.core.server.ProdServerStart\",\n\n    /* Helidon */\n    \"io.helidon.microprofile.server.Main\", \"io.helidon.webserver*\",\n\n    /* Vert.x */\n    \"io.vertx.core.Launcher\",\n\n    /* Keycloak */\n    \"org.keycloak*\",\n\n    /* Apereo CAS */\n    \"org.apereo.cas*\",\n\n    /* Elasticsearch */\n    \"org.elasticsearch.bootstrap.Elasticsearch\",\n\n    /* Atlassian / Gerrit */\n    \"com.atlassian.jira.startup.Launcher\", \"*BitbucketServerLauncher*\", \"com.google.gerrit.pgm.Daemon\",\n\n    /* Solr */\n    \"*-Dsolr.solr.home=*\"\n    )\n  )\n) and\nprocess.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\nprocess.args in (\"-c\", \"-cl\", \"-lc\") and (\n  process.args like (\n    /* Suspicious Paths */\n    \"* /tmp/* \", \"* /var/tmp/* \", \"* /dev/shm/*\", \"* /var/www/*\", \"* /run/*\", \"* /var/run/*\",\n\n    /* Interpreter Execution */\n    \"*python* -c*\", \"*php* -r*\", \"*perl* -e*\", \"*ruby* -e*\", \"*lua* -e*\", \"*node * -e *\",\n\n    /* Encoding / Decoding */\n    \"*base64 -*d*\", \"*|*base64 *\", \"*xxd *\", \"*openssl*enc * -d *\",\n\n    /* Reverse Shells */\n    \"*netcat *\", \"* nc *\", \"*ncat *\", \"*/dev/tcp*\", \"*/dev/udp/*\", \" *socat *\", \"*openssl*s_client *\", \"*stty*raw*-echo*\",\n\n    /* File Access */\n    \"*>*/etc/cron*\", \"*/etc/ssh*\", \"*/home/*/.ssh/*\", \"*/root/.ssh*\", \"*~/.ssh/*\", \"*/etc/shadow*\", \"*/etc/passwd*\", \"*chpasswd*\",\n      \n    /* AWS Credentials */\n    \"*aws_access_key_id*\", \"*aws_secret_access_key*\", \"*aws_session_token*\", \"*accesskeyid*\", \"*secretaccesskey*\",\n    \"*access_key*\", \"*.aws/credentials*\", \"*/.aws/config*\",\n    \n    /* Azure Credentials */\n    \"*AZURE_CLIENT_ID*\", \"*AZURE_TENANT_ID*\", \"*AZURE_CLIENT_SECRET*\", \"*AZURE_FEDERATED_TOKEN_FILE*\",\n    \"*IDENTITY_ENDPOINT*\", \"*IDENTITY_HEADER*\", \"*MSI_ENDPOINT*\", \"*MSI_SECRET*\", \"*/.azure/*\",\n    \"*/run/secrets/azure/*\",\n    \n    /* GCP Credentials */\n    \"*/.config/gcloud/*\", \"*application_default_credentials.json*\", \"*type: service_account*\",\n    \"*client_email*\", \"*private_key_id*\", \"*private_key*\", \"*/run/secrets/google/*\", \"*GOOGLE_APPLICATION_CREDENTIALS*\",\n    \n    /* Misc. Cloud */\n    \"*/.docker/config.json*\", \"*/.npmrc*\", \"*/secrets/kubernetes.io/serviceaccount/*\",\n\n    /* Helpers */\n    \"*nohup*\", \"*setsid *\", \"*timeout *sh -c *\", \"*disown*\", \"*env *sh *-c*\",\n\n    /* Miscellaneous */\n    \"*echo *\", \"*chattr *\", \"*busybox *\",  \"*#!*\", \"*chmod +x *\", \"*chmod 777*\", \n    \n    /* Decompression */\n    \"*gzip -*d *\", \"*bzip2 -*d *\", \"*xz -*d *\", \"*tar -*x*\",\n     \n     /* Path Traversal */\n     \"*../../../*etc/*\", \"*/.../*\", \"*../../../*home/*/*\", \"*../../../*root/*\",\n\n     \"*|*sh\", \"*|*python*\", \"*|*php*\", \"*|*perl*\", \"*|*ruby*\", \"*|*node*\", \"*|*lua*\", \"*|*busybox*\"\n  ) or\n  (\n    process.args like (\"*wget *\", \"*curl *\") and (\n      (\n        process.args like~ (\"* -o *\", \"* --output*\", \"* -o- *\") and\n        process.args regex \".*[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}.*\"\n      ) or\n      (\n        process.args like (\"*http://*\", \"*https://*\") and\n        process.args like (\n          \"* /tmp/*\", \"* /var/tmp/*\", \"* /dev/shm/* \", \"* /var/www/*\", \"* ~/*\",\n          \"* /home/*\", \"* /run/*\", \"* /var/run/*\"\n        )\n      )\n    )\n  )\n) and\nnot (\n  (process.parent.name == \"nginx\" and process.args like (\"chmod 777 /etc/resty-*\", \"resty*\")) or\n  (process.parent.name == \"apache2\" and (\n    process.args in (\n      \"/usr/local/bin/php -r 'echo phpversion();'\",\n      \"/usr/local/bin/php -r 'echo phpversion();'\",\n      \"/usr/bin/php -r 'echo phpversion();'\"\n    ) or\n    process.args like \"\"\"bash -c \"( /home/*/apps/richdocumentscode/collabora/Collabora_Online.AppImage*\"\"\"\n    )\n  ) or\n  (process.parent.name like \"php-fpm*\" and process.args in (\n    \"/usr/bin/php -r 'echo phpversion();'\",\n    \"/usr/bin/php -r 'echo phpversion();'\",\n    \"php -r 'print_r(phpversion());'\",\n    \"chattr -i -a /usr/local/virtualizor/license2.php\"\n    )\n  ) or\n  (process.parent.name == \"php-cgi\" and process.args like (\n    \"nohup php /home/*/public_html/lockindex.php index.php >/dev/null 2>&1 &\",\n    \"nohup php /home/*/public_html/wp-content/* >> /dev/null 2>&1 &\",\n    \"nohup php /home/*/public_html/wp-includes/* >> /dev/null 2>&1 &\",\n    \"nohup php /home/*/public_html/*/wp-content/* >> /dev/null 2>&1 &\"\n    )\n  )\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/integrations/cloud_defend/persistence_suspicious_webserver_child_process_execution.toml",
  "metadata": {
    "risk_score": 73,
    "tags": [
      "Data Source: Elastic Defend for Containers",
      "Domain: Container",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Execution",
      "Tactic: Command and Control",
      "Resources: Investigation Guide"
    ]
  }
}