{
  "id": "ecdb1bf6-f8e9-5993-b61f-c8c02aa93bc6",
  "catalog": "elastic",
  "name": "Kubelet Certificate File Access Detected via Defend for Containers",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "cat",
        "head",
        "tail",
        "more",
        "less",
        "sed",
        "awk"
      ],
      "raw_values": [
        "cat",
        "head",
        "tail",
        "more",
        "less",
        "sed",
        "awk"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "in",
      "values": [
        "cat",
        "head",
        "tail",
        "more",
        "less",
        "sed",
        "awk"
      ],
      "raw_values": [
        "cat",
        "/bin/cat",
        "/usr/bin/cat",
        "/usr/local/bin/cat",
        "head",
        "/bin/head",
        "/usr/bin/head",
        "/usr/local/bin/head",
        "tail",
        "/bin/tail",
        "/usr/bin/tail",
        "/usr/local/bin/tail",
        "more",
        "/bin/more",
        "/usr/bin/more",
        "/usr/local/bin/more",
        "less",
        "/bin/less",
        "/usr/bin/less",
        "/usr/local/bin/less",
        "sed",
        "/bin/sed",
        "/usr/bin/sed",
        "/usr/local/bin/sed",
        "awk",
        "/bin/awk",
        "/usr/bin/awk",
        "/usr/local/bin/awk"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.category",
      "raw_field": "event.category",
      "operator": "==",
      "values": [
        "file",
        "process"
      ],
      "raw_values": [
        "file",
        "process"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "change",
        "start"
      ],
      "raw_values": [
        "change",
        "start"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "open",
        "exec"
      ],
      "raw_values": [
        "open",
        "exec"
      ]
    }
  ],
  "raw_query": "any where host.os.type == \"linux\" and process.interactive == true and container.id like \"*\" and (\n  (event.category == \"file\" and event.type == \"change\" and event.action == \"open\" and file.path like \"/var/lib/kubelet/pki/*\") or\n  (event.category == \"process\" and event.type == \"start\" and event.action == \"exec\" and\n  (\n    process.name in (\"cat\", \"head\", \"tail\", \"more\", \"less\", \"sed\", \"awk\") or\n    process.args in (\n      \"cat\", \"/bin/cat\", \"/usr/bin/cat\", \"/usr/local/bin/cat\",\n      \"head\", \"/bin/head\", \"/usr/bin/head\", \"/usr/local/bin/head\",\n      \"tail\", \"/bin/tail\", \"/usr/bin/tail\", \"/usr/local/bin/tail\",\n      \"more\", \"/bin/more\", \"/usr/bin/more\", \"/usr/local/bin/more\",\n      \"less\", \"/bin/less\", \"/usr/bin/less\", \"/usr/local/bin/less\",\n      \"sed\", \"/bin/sed\", \"/usr/bin/sed\", \"/usr/local/bin/sed\",\n      \"awk\", \"/bin/awk\", \"/usr/bin/awk\", \"/usr/local/bin/awk\"\n    )\n  ) and process.args like \"*/var/lib/kubelet/pki/*\")\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/integrations/cloud_defend/discovery_kubelet_certificate_file_access.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Data Source: Elastic Defend for Containers",
      "Domain: Container",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Discovery",
      "Resources: Investigation Guide"
    ]
  }
}