{
  "id": "ed3b396c-d5f7-5dfc-8f25-5d293ff87c5d",
  "catalog": "elastic",
  "name": "Suspicious RunDLL32 Usage",
  "description": "Detects rundll32 executing from suspicious paths",
  "severity": "high",
  "mitre_techniques": [
    "attack.t1218.011"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "rundll32.exe"
      ],
      "raw_values": [
        "rundll32.exe"
      ]
    }
  ],
  "raw_query": "process where process.name == \"rundll32.exe\" and process.command_line like~ \"*\\\\Temp\\\\*\"",
  "language": "eql",
  "translated_query": null,
  "source_path": "demo",
  "metadata": {}
}