{
  "id": "ef2e8406-4ad1-59a9-a2bb-756410bf4f13",
  "catalog": "elastic",
  "name": "Potential Database Dumping Activity",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.exfiltration"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "exec_event",
        "start",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start",
        "ProcessRollup2"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "pg_dump",
        "pg_dumpall",
        "mysqldump",
        "mariadb-dump",
        "mongodump"
      ],
      "raw_values": [
        "pg_dump",
        "pg_dumpall",
        "mysqldump",
        "mariadb-dump",
        "mongodump"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and\nevent.action in (\"exec\", \"exec_event\", \"start\", \"ProcessRollup2\") and\nprocess.name in (\"pg_dump\", \"pg_dumpall\", \"mysqldump\", \"mariadb-dump\", \"mongodump\")\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/exfiltration_potential_database_dumping.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Exfiltration",
      "Data Source: Elastic Defend",
      "Data Source: Crowdstrike",
      "Data Source: SentinelOne",
      "Data Source: Elastic Endgame",
      "Resources: Investigation Guide"
    ]
  }
}