{
  "id": "f1f664b5-e313-5035-8830-90e7ec007f1a",
  "catalog": "elastic",
  "name": "Suspicious Remote Registry Access via SeBackupPrivilege",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.lateral-movement",
    "attack.credential-access"
  ],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "windows"
      ],
      "raw_values": [
        "windows"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "logged-in-special"
      ],
      "raw_values": [
        "logged-in-special"
      ]
    },
    {
      "field": "winlog.event_data.privilegelist",
      "raw_field": "winlog.event_data.PrivilegeList",
      "operator": ":",
      "values": [
        "sebackupprivilege",
        "sedebugprivilege"
      ],
      "raw_values": [
        "SeBackupPrivilege",
        "SeDebugPrivilege"
      ]
    },
    {
      "field": "event.code",
      "raw_field": "event.code",
      "operator": "==",
      "values": [
        "5145"
      ],
      "raw_values": [
        "5145"
      ]
    },
    {
      "field": "winlog.event_data.relativetargetname",
      "raw_field": "winlog.event_data.RelativeTargetName",
      "operator": ":",
      "values": [
        "winreg"
      ],
      "raw_values": [
        "winreg"
      ]
    }
  ],
  "raw_query": "sequence by winlog.computer_name, winlog.event_data.SubjectLogonId with maxspan=1m\n [iam where host.os.type == \"windows\" and event.action == \"logged-in-special\" and\n  winlog.event_data.PrivilegeList : \"SeBackupPrivilege\" and\n\n  /* excluding accounts with existing privileged access */\n  not winlog.event_data.PrivilegeList : \"SeDebugPrivilege\"]\n [any where host.os.type == \"windows\" and event.code == \"5145\" and winlog.event_data.RelativeTargetName : \"winreg\"]\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/windows/credential_access_suspicious_winreg_access_via_sebackup_priv.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Windows",
      "Use Case: Threat Detection",
      "Tactic: Lateral Movement",
      "Tactic: Credential Access",
      "Resources: Investigation Guide",
      "Use Case: Active Directory Monitoring",
      "Data Source: Active Directory",
      "Data Source: Windows Security Event Logs"
    ]
  }
}