{
  "id": "f25c873e-edfd-5991-8251-a3d9e0939c99",
  "catalog": "elastic",
  "name": "PsExec Lateral Movement",
  "description": "Detects PsExec used for lateral movement between hosts",
  "severity": "high",
  "mitre_techniques": [
    "attack.t1021.002"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "psexec.exe",
        "psexesvc.exe"
      ],
      "raw_values": [
        "psexec.exe",
        "psexesvc.exe"
      ]
    }
  ],
  "raw_query": "process where process.name in (\"psexec.exe\",\"psexesvc.exe\")",
  "language": "eql",
  "translated_query": null,
  "source_path": "demo",
  "metadata": {}
}