{
  "id": "f27ef723-ade1-5459-aeaa-749539a7fe2d",
  "catalog": "elastic",
  "name": "IPv4/IPv6 Forwarding Activity",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.command-and-control"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "net.ipv4.ip_forward",
        "ip_forward",
        "net.ipv6.conf.all.forwarding",
        "forwarding",
        "--write"
      ],
      "raw_values": [
        "*net.ipv4.ip_forward*",
        "*/proc/sys/net/ipv4/ip_forward*",
        "*net.ipv6.conf.all.forwarding*",
        "*/proc/sys/net/ipv6/conf/all/forwarding*",
        "*-w*",
        "*--write*",
        "*=*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "like~",
      "values": [
        "privsep-helper",
        "platform-python",
        "init.ipv6-global",
        "wsl-bootstrap"
      ],
      "raw_values": [
        "privsep-helper",
        "platform-python*",
        "init.ipv6-global",
        "wsl-bootstrap"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "exec",
        "start",
        "exec_event",
        "processrollup2"
      ],
      "raw_values": [
        "exec",
        "start",
        "exec_event",
        "ProcessRollup2"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "in",
      "values": [
        "bash",
        "dash",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ],
      "raw_values": [
        "bash",
        "dash",
        "sh",
        "tcsh",
        "csh",
        "zsh",
        "ksh",
        "fish"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": "in",
      "values": [
        "/usr/lib/pritunl/usr/bin/pritunl",
        "/usr/bin/dockerd-rootless.sh",
        "/etc/rc.d/init.d/network",
        "/etc/rc0.d/k90network"
      ],
      "raw_values": [
        "/usr/lib/pritunl/usr/bin/pritunl",
        "/usr/bin/dockerd-rootless.sh",
        "/etc/rc.d/init.d/network",
        "/etc/rc0.d/K90network"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "sysctl"
      ],
      "raw_values": [
        "sysctl"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": "like",
      "values": [
        "echo"
      ],
      "raw_values": [
        "*echo *"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": "==",
      "values": [
        "sshd"
      ],
      "raw_values": [
        "/usr/sbin/sshd"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": "like",
      "values": [
        "/etc/untangle/post-network-hook.d/"
      ],
      "raw_values": [
        "/etc/untangle/post-network-hook.d/*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"exec\", \"start\", \"exec_event\", \"ProcessRollup2\") and\n?process.parent.executable != null and process.command_line like (\n  \"*net.ipv4.ip_forward*\", \"*/proc/sys/net/ipv4/ip_forward*\", \"*net.ipv6.conf.all.forwarding*\",\n  \"*/proc/sys/net/ipv6/conf/all/forwarding*\"\n) and (\n  (process.name == \"sysctl\" and process.args like (\"*-w*\", \"*--write*\", \"*=*\")) or\n  (\n    process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\") and process.args == \"-c\" and\n    process.command_line like \"*echo *\"\n  )\n) and\nnot (\n  process.parent.name like~ (\"privsep-helper\", \"platform-python*\", \"init.ipv6-global\", \"wsl-bootstrap\") or\n  ?process.parent.executable == \"/usr/sbin/sshd\" or\n  ?process.parent.args in (\n    \"/usr/lib/pritunl/usr/bin/pritunl\", \"/usr/bin/dockerd-rootless.sh\", \"/etc/rc.d/init.d/network\", \"/etc/rc0.d/K90network\"\n  )  or\n  ?process.parent.args like \"/etc/untangle/post-network-hook.d/*\"\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/command_and_control_ip_forwarding_activity.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Command and Control",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne",
      "Data Source: Elastic Endgame",
      "Resources: Investigation Guide",
      "Data Source: Crowdstrike"
    ]
  }
}