{
  "id": "f8c705d7-28b6-5759-8637-b1a51b466484",
  "catalog": "elastic",
  "name": "Multiple Okta User Authentication Events with Same Device Token Hash",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [],
  "event_categories": [
    "any"
  ],
  "conditions": [
    {
      "field": "data_stream.dataset",
      "raw_field": "data_stream.dataset",
      "operator": "==",
      "values": [
        "okta.system"
      ],
      "raw_values": [
        "okta.system"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "like",
      "values": [
        "user.authentication."
      ],
      "raw_values": [
        "user.authentication.*"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "==",
      "values": [
        "user.session.start"
      ],
      "raw_values": [
        "user.session.start"
      ]
    },
    {
      "field": "okta.outcome.reason",
      "raw_field": "okta.outcome.reason",
      "operator": "==",
      "values": [
        "invalid_credentials"
      ],
      "raw_values": [
        "INVALID_CREDENTIALS"
      ]
    }
  ],
  "raw_query": "from logs-okta*\n| where\n    data_stream.dataset == \"okta.system\" and\n    (event.action like \"user.authentication.*\" or event.action == \"user.session.start\") and\n    okta.debug_context.debug_data.dt_hash != \"-\" and\n    okta.outcome.reason == \"INVALID_CREDENTIALS\"\n| keep\n    event.action,\n    okta.debug_context.debug_data.dt_hash,\n    okta.actor.id,\n    okta.actor.alternate_id,\n    okta.outcome.reason\n| stats\n    Esql.okta_actor_id_count_distinct = count_distinct(okta.actor.id)\n  by\n    okta.debug_context.debug_data.dt_hash,\n    okta.actor.alternate_id\n| where\n    Esql.okta_actor_id_count_distinct > 20\n| sort\n    Esql.okta_actor_id_count_distinct desc\n",
  "language": "esql",
  "translated_query": null,
  "source_path": "rules/integrations/okta/credential_access_okta_authentication_for_multiple_users_with_the_same_device_token_hash.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Use Case: Identity and Access Audit",
      "Data Source: Okta",
      "Tactic: Credential Access",
      "Resources: Investigation Guide"
    ]
  }
}