{
  "id": "f9de4518-df59-59b8-a14a-200642b81bbc",
  "catalog": "elastic",
  "name": "Namespace Manipulation Using Unshare",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.privilege-escalation"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": ":",
      "values": [
        "exec",
        "exec_event",
        "start"
      ],
      "raw_values": [
        "exec",
        "exec_event",
        "start"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.executable",
      "operator": ":",
      "values": [
        "udevadm",
        "systemd-udevd",
        "unshare"
      ],
      "raw_values": [
        "/usr/bin/udevadm",
        "*/lib/systemd/systemd-udevd",
        "/usr/bin/unshare"
      ]
    },
    {
      "field": "process.parent.args",
      "raw_field": "process.parent.args",
      "operator": ":",
      "values": [
        "/etc/kernel/postinst.d/zz-proxmox-boot",
        "/opt/openssh/sbin/sshd",
        "/usr/sbin/sshd",
        "/snap/",
        "/home/*/.local/share/jetbrains/toolbox/"
      ],
      "raw_values": [
        "/etc/kernel/postinst.d/zz-proxmox-boot",
        "/opt/openssh/sbin/sshd",
        "/usr/sbin/sshd",
        "/snap/*",
        "/home/*/.local/share/JetBrains/Toolbox/*"
      ]
    },
    {
      "field": "process.parent.name",
      "raw_field": "process.parent.name",
      "operator": "in",
      "values": [
        "zz-proxmox-boot",
        "java"
      ],
      "raw_values": [
        "zz-proxmox-boot",
        "java"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "==",
      "values": [
        "start"
      ],
      "raw_values": [
        "start"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.executable",
      "operator": ":",
      "values": [
        "unshare"
      ],
      "raw_values": [
        "/usr/bin/unshare"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.args",
      "operator": "==",
      "values": [
        "snap"
      ],
      "raw_values": [
        "/usr/bin/snap"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"linux\" and event.type == \"start\" and event.action : (\"exec\", \"exec_event\", \"start\") and\nprocess.executable: \"/usr/bin/unshare\" and not (\n  process.parent.executable: (\"/usr/bin/udevadm\", \"*/lib/systemd/systemd-udevd\", \"/usr/bin/unshare\") or\n  process.args == \"/usr/bin/snap\" and not process.parent.name in (\"zz-proxmox-boot\", \"java\") or\n  process.parent.args like (\n    \"/etc/kernel/postinst.d/zz-proxmox-boot\", \"/opt/openssh/sbin/sshd\", \"/usr/sbin/sshd\",\n    \"/snap/*\", \"/home/*/.local/share/JetBrains/Toolbox/*\"\n  )\n)\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/privilege_escalation_unshare_namespace_manipulation.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Privilege Escalation",
      "Data Source: Elastic Endgame",
      "Data Source: Elastic Defend",
      "Data Source: SentinelOne",
      "Resources: Investigation Guide"
    ]
  }
}