{
  "id": "fb4d784a-5916-5566-8dd3-452ecbaca32f",
  "catalog": "elastic",
  "name": "User or Group Creation/Modification",
  "description": "",
  "severity": "medium",
  "mitre_techniques": [
    "attack.persistence"
  ],
  "event_categories": [
    "iam"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "creation",
        "change"
      ],
      "raw_values": [
        "creation",
        "change"
      ]
    },
    {
      "field": "event.action",
      "raw_field": "event.action",
      "operator": "in",
      "values": [
        "changed-password",
        "added-user-account",
        "added-group-account-to"
      ],
      "raw_values": [
        "changed-password",
        "added-user-account",
        "added-group-account-to"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "linux"
      ],
      "raw_values": [
        "linux"
      ]
    },
    {
      "field": "auditd.result",
      "raw_field": "auditd.result",
      "operator": "==",
      "values": [
        "success"
      ],
      "raw_values": [
        "success"
      ]
    }
  ],
  "raw_query": "iam where host.os.type == \"linux\" and event.type in (\"creation\", \"change\") and auditd.result == \"success\" and\nevent.action in (\"changed-password\", \"added-user-account\", \"added-group-account-to\") and process.name != null\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/linux/persistence_user_or_group_creation_or_modification.toml",
  "metadata": {
    "risk_score": 21,
    "tags": [
      "Domain: Endpoint",
      "OS: Linux",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Data Source: Auditd Manager",
      "Resources: Investigation Guide"
    ]
  }
}