{
  "id": "ff55735c-89c3-5f19-afe8-6566f04f3967",
  "catalog": "elastic",
  "name": "Creation of Hidden Login Item via Apple Script",
  "description": "",
  "severity": "high",
  "mitre_techniques": [
    "attack.persistence",
    "attack.execution"
  ],
  "event_categories": [
    "process"
  ],
  "conditions": [
    {
      "field": "event.type",
      "raw_field": "event.type",
      "operator": "in",
      "values": [
        "start",
        "process_started"
      ],
      "raw_values": [
        "start",
        "process_started"
      ]
    },
    {
      "field": "host.os.type",
      "raw_field": "host.os.type",
      "operator": "==",
      "values": [
        "macos"
      ],
      "raw_values": [
        "macos"
      ]
    },
    {
      "field": "process.name",
      "raw_field": "process.name",
      "operator": "==",
      "values": [
        "osascript"
      ],
      "raw_values": [
        "osascript"
      ]
    },
    {
      "field": "process.command_line",
      "raw_field": "process.command_line",
      "operator": ":",
      "values": [
        "osascript*login item*hidden:true"
      ],
      "raw_values": [
        "osascript*login item*hidden:true*"
      ]
    }
  ],
  "raw_query": "process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and process.name == \"osascript\" and\n process.command_line : \"osascript*login item*hidden:true*\"\n",
  "language": "eql",
  "translated_query": null,
  "source_path": "rules/macos/persistence_creation_hidden_login_item_osascript.toml",
  "metadata": {
    "risk_score": 47,
    "tags": [
      "Domain: Endpoint",
      "OS: macOS",
      "Use Case: Threat Detection",
      "Tactic: Persistence",
      "Tactic: Execution",
      "Data Source: Elastic Defend",
      "Resources: Investigation Guide"
    ]
  }
}