any where winlog.channel:"Security" and ((event.code:"4663" and winlog.event_data.ObjectType:"File" and winlog.event_data.AccessMask:"0x1") and ((winlog.event_data.ObjectName like~ ("*\\User Data\\Default\\Login Data*", "*\\User Data\\Local State*", "*\\User Data\\Default\\Network\\Cookies*")) or (file.path like~ ("*\\cookies.sqlite", "*\\places.sqlite", "*release\\key3.db", "*release\\key4.db", "*release\\logins.json"))) and (not (process.executable:"System" or (process.executable like~ ("C:\\Program Files (x86)\\*", "C:\\Program Files\\*", "C:\\Windows\\system32\\*", "C:\\Windows\\SysWOW64\\*")))) and (not (process.executable:"C:\\ProgramData\\Microsoft\\Windows Defender\\*" and (process.executable like~ ("*\\MpCopyAccelerator.exe", "*\\MsMpEng.exe")))))